const JSONList = [

    { id: "1-4805", name: '【完整版】商密考核参考题库', describe: '商用密码应用安全性评估从业人员考核参考题库——wanqian6311整理', file: "1-4805.json" },
    { id: "众筹", name: '密评题库（含部分解析）', describe: '商用密码应用安全性评估从业人员考核参考题库-众筹版', file: "众筹版.json" },
    { id: "高频", name: '高频易错', describe: '商用密码应用安全性评估从业人员考核参考题库-高风险判定题+高频易错题+网友校正题', file: "高频易错.json" },
    { id: "1-1000", name: '【1000题】商密考核参考题库(1)', describe: '商用密码应用安全性评估从业人员考核参考题库——wanqian6311整理', file: "1-1000.json" },
    { id: "1001-2000", name: '【1000题】商密考核参考题库(2)', describe: '商用密码应用安全性评估从业人员考核参考题库——wanqian6311整理', file: "1001-2000.json" },
    { id: "2001-3000", name: '【1000题】商密考核参考题库(3)', describe: '商用密码应用安全性评估从业人员考核参考题库——wanqian6311整理', file: "2001-3000.json" },
    { id: "3001-4000", name: '【1000题】商密考核参考题库(4)', describe: '商用密码应用安全性评估从业人员考核参考题库——wanqian6311整理', file: "3001-4000.json" },
    { id: "4001-4805", name: '【805题】商密考核参考题库(5)', describe: '商用密码应用安全性评估从业人员考核参考题库——wanqian6311整理', file: "4001-4805.json" },
]
