const questions = {
  "questions":[
    {
        "id": "1",
        "title": "等级保护2.0中，使用虹膜+指纹的方式进入操作系统满足两种或两种以上组合的鉴别技术的要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "2",
        "title": "系统管理员应同时具备日志审计权限。（  ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "3",
        "title": "在Linux操作系统中，若/etc/profile文件中有“TMOUT=900”的配置项，则可强制所有会话的空闲时间达到900秒后自动断开。（   ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "解析内容描述，/etc/profile为全局设置，其中设置的空闲会话值对所有用户生效，故题干中的说法正确。"
    },
    {
        "id": "4",
        "title": "在进行远程数据传输过程中，应采用密码技术保障数据的保密性，但对密码算法无具体要求，采用任何算法均可。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "5",
        "title": "云服务客户选择云服务商提供的云计算平台的时，只需考虑云服务商是否具有相关资质、是否具有云计算平台备案证明和测评报告即可。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "6",
        "title": "机房通信线缆接地是防止雷击最基本的一条。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "7",
        "title": "按照网络安全等级保护安全设计技术要求，传统信息系统应按照通用要求进行安全设计，云计算平台应按照云计算安全扩展要求进行设计。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "云计算平台应在通用要求的基础上按照云计算安全扩展要求进行设计。"
    },
    {
        "id": "8",
        "title": "纵深防御的原则是从核心数据保护层面构建网络安全防护体系。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "9",
        "title": "综合日志审计系统的安全管理员就是内网的审计管理员，应当行使审计管理职责，对系统的审计记录进行存储、管理和查询。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "10",
        "title": "机房内重要设备和其他设备分区域隔离，采取防火措施，防止火灾蔓延，一定程度保护重要设备。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "11",
        "title": "关键信息基础设施的运营者采购网络产品和服务，应当按照规定与提供者签订安全保密协议 ，明确安全和保密义务与责任。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "12",
        "title": "网络安全等级保护是指网络（含信息系统、数据）实施分等级保护、分等级监管，对网络中使用的网络安全产品实行按等级管理，对网络中发生的安全事件分等级响应、处置。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "13",
        "title": "跨网数据交换产品的本质是物理隔离，因此能够为不同区域之间的数据交换提供有效的安全防护措施。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "14",
        "title": "工业控制系统中不允许使用无线通信方式。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "15",
        "title": "一般采用超级管理员用户登录进行配置管理和日志管理。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "16",
        "title": "工业控制系统中，控制器设备的身份鉴别、访问控制通常由其上位机组态软件进行配置，则当被测对象为控制器设备时，可以考察组态软件本身的身份鉴别机制，代替控制器设备的身份鉴别。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "组态软件作为过程监视层的应用软件，需单独作为被测对象进行考察，此时组态软件本身的身份鉴别已被考察。对于控制器设备，其身份鉴别模块在组态软件配置，故应考察组态软件对控制器身份鉴别的配置情况，查看是否有相关功能。"
    },
    {
        "id": "17",
        "title": "系统管理员可以通过管理工具或平台对系统进行管理操作。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "18",
        "title": "测评对象为三级互联网系统，测评时只需关注外部发起的网络攻击行为。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "19",
        "title": "应用系统如为采购的成熟商业软件，可不必做交付安装前的检测。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "20",
        "title": "使用堡垒机管理应用系统符合双因素鉴别技术。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "21",
        "title": "在云计算平台中，网络虚拟化后，物理的网络边界随之消失，所以无需网络边界访问控制能力。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "22",
        "title": "Windows操作系统开启了系统防火墙，并开启了相关策略，能够起到入侵检测功能。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "23",
        "title": "服务水平协议中应约定服务合约到期后，云服务商应完整提供云服务客户数据，并承诺相关数据在云计算平台上清除。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "24",
        "title": "出于数据安全考虑，在服务合约到期后，云服务商也应该继续保存一定时间的云服务客户数据。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "25",
        "title": "第三级物联网系统需要能够限制与网关节点通信的目标地址，以避免对陌生地址的攻击行为。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "26",
        "title": "动态防御的核心是安全策略的动态调整和联动，进而体现在相关产品“协同作战”上，防护、检测、响应相结合，以实现对网络和信息系统的联动和整体防护。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "27",
        "title": "保证系统的可用性，安全设备默认情况下其受控接口应允许所有通信。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "28",
        "title": "等级测评的测评内容主要来源于《网络安全等级保护基本要求》的条款，《网络安全等级测评测评要求》规范了等级测评工作开展的活动流程。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "29",
        "title": "安全管理现场测评应依据测评作业指导书进行，以控制点和要求项为主线开展访谈和核查工作。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "30",
        "title": "机房封闭了窗户后可以不用进行漏水检测。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "31",
        "title": "安全策略是安全管理部门的一个安全文件，主要阐明机构信息安全工作的使命和意愿，明确安全管理的范围、定义信息安全的总体目标和安全管理框架等等。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "32",
        "title": "对于测试过程中出现的异常情况（服务器出现故障、网络中断等等），只要让对方恢复即可，无需及时记录。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "33",
        "title": "在对数据进行差异备份前，仍需进行数据库的全量备份。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "34",
        "title": "应每年对安全管理制度的合理性和适用性进行论证和审定，对存在不足或需要改进的安全管理制度进行修订。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "35",
        "title": "对某单位三级等级保护对象进行测评，检查发现岗位职责文件中定义网络管理员为关键岗位并且明确了网络管理员的岗位职责，王亮担任该等级保护对象的网络管理员，那么单位不但应与王亮签订保密协议，也应与其签订岗位安全协议或岗位安全责任书。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "36",
        "title": "当机房根据用途不同分为多个房间，处于不同位置时，各个机房应按相关的物理安全要求分别检查。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "37",
        "title": "目前市场暂无基于linux主机的恶意代码防范软件。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "38",
        "title": "防止用户接入区终端被非法入侵，主要是通过防火墙防范外部的攻击。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "39",
        "title": "安全管理测评中，访谈安全主管，主要针对一些机构信息安全方面的上层、顶层问题进行广泛式提问，包括机构安全管理制度体系的构成、部门的设置等。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "40",
        "title": "云服务客户需要管理或控制云计算的基础设施，例如网络、操作系统、存储等。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "41",
        "title": "数据库管理系统通常提供授权功能来控制不同用户访问数据的权限，这主要是为了实现数据库的可靠性。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "42",
        "title": "制度文档的审阅一方面要检查制度文档的规范内容，另一方面应通过审阅记录文档检查制度文档的落实，若二者存在不一致，则表明制度未得到有效落实。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "43",
        "title": "某机房部署在主楼顶层，某测评师据此判定该机房“物理位置选择”控制点不符合，并在等级保护测评过程中建议业主单位对该机房实施物理迁移。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "44",
        "title": "在网络边界或区域间根据访问控制策略设置访问控制规则，默认情况下拒绝所有通信。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "45",
        "title": "在安全计算环境中,由于恶意代码防范主要在主机或服务器上实现，对于防火墙等安全设备，此项判定为不适用。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "46",
        "title": "在软件交付前进行系统功能性检测，并出具检测报告后系统上线运行。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "47",
        "title": "1个千兆端口在包长为64字节时的理论吞吐量为1.288Mpps。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "48",
        "title": "第二级和第三级系统，均要求：应保证跨越边界的访问和数据流通过边界设备提供的受控接口进行通信。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "49",
        "title": "在云平台的边界采用了访问控制措施，云平台内部的系统无需进行安全隔离。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "50",
        "title": "制定工具测试方案，要对目标系统中的网络设备、安全设备、服务器设备及目标系统网络拓扑结构等相关信息进行收集。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "51",
        "title": "集中审计分析系统可以对基础网络平台进行统一的日志收集、存储和分析，网络安全法要求日志保存时间不少于60天。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "52",
        "title": "应成立指导和管理网络安全工作的委员会或领导小组，其最高领导必须由单位主管领导担任。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "53",
        "title": "通过访谈安全主管确定由人事部专门负责人员的录用工作，故判断应指定或授权专门的部门或人员负责人员录用的测评指标为符合。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "54",
        "title": "云服务客户应在本地保存其业务数据的备份。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "55",
        "title": "安全计算环境在第二级中增加了数据保密性要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "56",
        "title": "在安全计算环境-访问控制中要求对重要主体和客体设置安全标记，并控制客体对有安全标记信息资源的访问。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "57",
        "title": "RIP是基于链路状态算法的路由协议，而OSPF是基于距离矢量算法的路由协议。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "58",
        "title": "针对基本要求各安全控制点中要求项的测评称为单项测评。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "59",
        "title": "多部门使用同一个共享账户AB进行登录，但该账户AB只有查询功能，无任何的增、删、改的功能，因此对于系统无任何安全隐患。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "60",
        "title": "防火墙的可信验证要求可作为通信设备或边界设备实现。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "61",
        "title": "系统安全管理员可对系统的资源和运行进行配置、控制和管理。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "62",
        "title": "可以通过利用SSH、FTP、HTTPS、IPSec VPN方式建立一条安全的信息传输路径，对网络中的安全设备或安全组件进行管理。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "63",
        "title": "系统运维手册、用户操作规程都属于日常管理操作的操作规程。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "64",
        "title": "某应用系统后台连续登录失败3次以后，需要输入验证码才能继续登录，这个应用系统实现了登录失败处理功能。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "65",
        "title": "安全计算环境——安全审计中有关审计进程的保护是在第三级以上要求中提出的。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "66",
        "title": "第三级系统所在机房必须部署防盗报警系统。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "67",
        "title": "对于第二级系统,网络设备的审计不需要覆盖到每个用户，只要对重要的用户行为进行审计即可。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "68",
        "title": "国家关键信息基础设施是第三级以上等级保护对象，第三级等级保护对象也是国家关键信息基础设施。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "69",
        "title": "《基本要求》（GB/T 22239-2019）可作为指导等级保护对象运营使用单位开展安全建设、整改和测评的标准依据，并分领域的给出了各领域的安全扩展要求。其中，云计算安全扩展要求包含了全部云计算平台的安全要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "70",
        "title": "《信息安全技术网络安全等级保护定级指南》适用于所有涉密、非涉密系统的定级工作。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "71",
        "title": "对于第三级的工业控制系统来说，在工业控制系统与组织中其他系统之间允许E-Mail、Web、Telnet、Rlogin、FTP等通用网络服务。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "72",
        "title": "对特定级别的等级保护对象的保护一定会用到安全通用要求和安全扩展要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "73",
        "title": "某单位应用管理员登录应用系统时，分别由两个人输入两段口令，测评时判定此种登录方式符合身份鉴别中关于双因素身份鉴别的要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "74",
        "title": "物联网中应采用相关技术确保只有授权的感知节点可以接入。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "75",
        "title": "当等级保护对象所处理的信息、业务状态和系统服务范围发生变化，可能导致业务信息安全或系统服务安全受到破坏后的受侵害客体和对客体的侵害程度发生变化时，应根据标准要求重新确定定级对象和安全保护等级。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "76",
        "title": "在对测评过程中发现的问题进行风险判定时，管理类问题无需判高风险。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "77",
        "title": "第二级系统，要求配备一定数量的系统、网络、安全管理员等，其中安全管理员可以兼任。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "78",
        "title": "在进行工具测试过程中，测试完成后与被测方相关人员确认测试的结果和证据后即可签字离场。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "79",
        "title": "被测系统核心业务防火墙仅可通过堡垒机进行运维管理，管理员通过账户密码+手机动态密码登录到堡垒机后，再通过账户密码登录到核心业务防火墙，核心业务防火墙通过堡垒机实现双因子认证。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "80",
        "title": "《网络安全等级保护测评高风险判定指引》中的判例包括判例描述、对应要求、补偿措施、整改建议等内容。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "81",
        "title": "在数据通信过程中，可以采用密码技术保证数据的完整性和保密性。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "82",
        "title": "在工业控制系统内使用广域网进行控制指令或相关数据交换的应采用加密认证技术手段实现身份认证、访问控制和数据加密传输。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "83",
        "title": "对于SCADA、RTU等工业控制系统可能使用广域网进行控制指令或相关数据交换，在控制指令或相关数据交换过程中，可以直接进行数据交换。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "84",
        "title": "在参考《网络安全等级保护测评高风险判定指引》进行风险判定时，可结合实际场景进行综合风险分析，并在测评报告中进行详细描述。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "85",
        "title": "可信验证的要求主要是针对安全计算环境提出来的。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "86",
        "title": "测评活动中，安全管理的测评对象就是与安全相关的文档 。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "87",
        "title": "等级测评采用的基本方法包括“访谈”、“核查”和“测试”，其中“测试”通常会使用工具，也称“工具测试”，工具测试方法在不同行业中的使用是相同的。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "88",
        "title": "定级对象终止阶段是等级保护实施过程中的最后环节。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "89",
        "title": "网络安全产品、密码产品及其相关服务的采购和使用必须符合国家相关部门的规定。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "90",
        "title": "使用测试工具进行漏洞扫描测试、性能测试及渗透测试等，不会对网络和系统的负载造成影响。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "91",
        "title": "开发测评指导书通常以确定测评对象为起点，依次完成测评指标映射、分解、量化测评指标、确定测评实施、验证测评指导书，最终形成测评指导书。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "92",
        "title": "第三级系统测评的力度要求数量上抽样种类上全部覆盖。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "93",
        "title": "感知设备进行更新配置时，无需再对用户进行权限检查。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "94",
        "title": "工业控制系统禁止使用拨号访问服务。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "95",
        "title": "网络安全等级保护的对象是信息系统。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "96",
        "title": "银行交易系统由于其特殊的敏感性和安全性，可以将交易系统服务器定级为第三级。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "97",
        "title": "等级保护制度和关键信息基础设施保护是网络安全的两个重要方面，不可分割。(  )",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "98",
        "title": "等级测评工作，是指测评机构依据国家网络安全等级保护制度规定，按照有关管理规范和技术标准，对已定级备案的非涉及国家秘密的网络（含信息系统、数据资源等）的安全保护状况进行检测评估的活动。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "99",
        "title": "基于《网络安全等级保护安全设计技术要求》，等级保护对象的安全设计应基于业务流程自身特点，建立“可信、可控、可管”的安全防护体系，使得系统能够按照预期运行，免受信息安全攻击和破坏。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "100",
        "title": "等级保护的主要环节包括定级、备案、安全建设整改、等级测评和监督检查。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "101",
        "title": "《网络安全等级保护测评过程指南》标准可用于指导网络运营者开展安全需求分析和安全自查。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "102",
        "title": "等级保护2.0在基本要求的基础上，扩展了云计算、大数据、物联网、智慧城市、工业控制系统的相关要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "103",
        "title": "《基本要求》（GB/T 22239-2019）中“安全通信网络”部分是对网络架构、通信传输和通信设备提出了安全要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "104",
        "title": "《网络安全等级保护实施指南》标准可用于为等级保护对象建设单位和运营、使用单位提供技术指导。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "105",
        "title": "《基本要求》（GB/T 22239-2019）安全技术要求分为物理安全、网络安全、主机安全、应用安全和数据安全五个方面。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "106",
        "title": "基于《网络安全等级保护安全设计技术要求》，信息系统的安全设计应结合业务流程自身特点，建立“可信、可控、可管”的安全防护体系，使得系统能够按照预期运行，免受信息安全攻击和破坏。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "107",
        "title": "无论等级保护对象使用何种技术、必须首先使用“安全通用要求”对等级保护对象进行测评，结合等级保护对象技术架构，再结合使用测评要求其他部分进行测评。(    )",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "108",
        "title": "整体测评是在单项测评基础上，对等级保护对象整体安全保护能力的判断。整体安全保护能力从区域互补和措施互补两个角度评判。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "109",
        "title": "在GB/T28448-2019《信息安全技术网络安全等级保护测评要求》中单项测评指是由测评指标、测评对象、测评实施构成。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "110",
        "title": "可信计算机的信任根是可信操作系统。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "111",
        "title": "等级保护对象受到破坏后对客体造成侵害的程度归结为以下三种：◼造成一般损害◼造成较严重损害◼造成严重损害。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "112",
        "title": "针对第三级等级保护对象，在安全通信网络方面，必须采用密码技术保证通信过程中数据的完整性。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "113",
        "title": "个人信息保护为第三级基本要求新增控制点。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "114",
        "title": "针对第二级信息系统“集中管控”要求网络集中监控系统对整个网络及业务系统的集中管理。 （    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "115",
        "title": "工业控制等级保护安全技术设计框架逐级增强，防护类别不同，安全保护设计的强度也不同。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "116",
        "title": "在对定级系统进行等级保护安全保护环境设计时，可以结合系统自身业务需求，将定级系统进一步细化成不同的子系统，确定每个子系统的等级，对子系统进行安全保护环境的设计。(    )",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "117",
        "title": "等级保护对象主要包括信息和信息系统、各类操作系统及网络基础设施等。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "118",
        "title": "27001标准体系中包括要求、指南、认证和审核等多种类型的标准。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "119",
        "title": "《信息系统安全等级保护基本要求》（GB/T 22239-2008）修订后将成为《网络安全等级保护基本要求》（GB/T 22239-2019）且由多个分册构成。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "120",
        "title": "所有的云计算平台都可以作为一个整体进行定级。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "121",
        "title": "ISO/IEC27001规定了组织建立和实施信息安全管理体系的要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "122",
        "title": "安全等级保护定级所定的级别是系统保障强度等级。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "123",
        "title": "《信息系统安全等级保护基本要求》（GB/T 22239-2019）中“安全通信网络”部分是对网络架构、通信传输和通信设备提出了安全要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "124",
        "title": "习近平总书记指出：“没有网络安全，就没有国家安全；没有信息化，就没有现代化”。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "125",
        "title": "《国家网络安全法》于2013年10月正式发布。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "126",
        "title": "1994年《中华人民共和国计算机信息系统安全保护条例》第九条规定：“计算机信息系统实行安全等级保护，安全等级的划分标准和安全等级保护的具体办法，由公安部会同有关部门制定”。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "127",
        "title": "等级测评机构推荐管理工作遵循统筹规划、合理布局、安全规范的方针，按照“谁推荐、谁负责，谁审核、谁负责”的原则有序开展。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "128",
        "title": "《中华人民共和国人民警察法》规定：人民警察履行“监督管理计算机信息系统的安全保护工作”的职责。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "129",
        "title": "网络安全与政治安全、经济安全、国土安全、社会安全并列为当前安全工作的五个重点领域。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "130",
        "title": "每个信息系统对应一个《备案证明》。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "131",
        "title": "开展等级保护工作的基本要求是：准确定级、严格审批、及时备案、认真整改、科学测评。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "132",
        "title": "2003年中办、国办转发的《国家信息化领导小组关于加强信息安全保障工作的意见》中明确提出了“实行信息安全等级保护”，“要重点保护基础信息网络和关系国家安全、经济命脉、社会稳定等方面的重要信息系统，抓紧建立信息安全等级保护制度，制定信息安全等级保护的管理办法和技术指南”等意见。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "133",
        "title": "网络安全等级保护制度是国家网络安全保障的基本制度、基本策略、基本方法。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "134",
        "title": "涉及国家秘密的信息系统，主要由国家保密工作部门负责，其他部门参与、配合。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "135",
        "title": "定级是等级保护工作的首要环节，是开展信息系统建设、整改、测评、备案、监督检查等后续工作的重要基础。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "136",
        "title": "《网络安全等级保护测评机构管理办法》中规定，测评机构在严格监督的情况下，可以采取挂靠或者聘用兼职测评师开展测评业务。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "137",
        "title": "测评机构名称、地址、测评人员、主要负责人和联系人发生变更的，等保办应组织重新进行推荐审查并出具审查意见。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "138",
        "title": "测评机构法人、股权结构发生变更或其他重大事项发生变更的，等保办应组织重新进行推荐审查并出具审查意见。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "139",
        "title": "静态口令+手机短信验证码的方式能够满足等级保护第三、四级组合身份鉴别的要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "140",
        "title": "从第二级开始，应确保用于身份鉴别的用户名和用户标识在系统整个生命周期的唯一性。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "141",
        "title": "用户向系统表明身份的行动，通常以注册ID形式表现，被称为认证。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "142",
        "title": "对目录和文件权限的设置属于自主访问控制的范畴。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "143",
        "title": "在访问控制措施部署的过程中，应首先明确受限访问的资源，并以黑名单的方式设置访问控制策略。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "144",
        "title": "在安全保护等级为三级及以上等级的网络中，应将强制访问控制扩展到所有主体与客体。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "145",
        "title": "系统安全审计的目的是能够及时、自动发现并分析已发生的安全事件，及时报警和阻断特定安全事件。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "审计一般都是事后的，在具体操作方面一般不能做到阻断，对于特定安全事件及时报警，不要求做阻断动作，另外考虑误报可能影响正常业务，审计系统如态势感知等，配置基本都是异常报警而不阻断。"
    },
    {
        "id": "146",
        "title": "系统安全审计的原则是对所有外部人员的操作、行为进行记录和分析，及时发现异常访问。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "147",
        "title": "为了保障数据传输过程中的完整性，可采用加密的VPN隧道进行数据传输。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "148",
        "title": "密码技术一般用于加密和解密数据，不能用于对数据进行完整性检查。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "149",
        "title": "由于数据的加解密对硬件性能消耗较大，因此可仅对重要业务数据进行加密传输，其它数据采用明文传输的方式降低或避免对业务产生的影响。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "150",
        "title": "可信验证技术的基本思想是构建可信根和建立信任链。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "151",
        "title": "在可信验证技术应用过程中，可信根应采用供应商自主研发的可信密码模块（TCM）与可信平台控制模块（TPCM），避免未预期的引入第三方存在安全隐患的模块。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "152",
        "title": "在等级保护安全级别为第四级的网络系统中，若存在与较低安全级别处于同一安全区域的资产，应进行实时监控，避免这些资产成为入侵更高安全等级区域的跳板。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "网络安全等级保护设计中对于等级保护安全级别为第四级的网络和信息系统应单独划分区域，不能将四级系统或部分资产与较低安全级别的系统规划到同一区域。"
    },
    {
        "id": "153",
        "title": "不同网络区域之间可以通过VLAN进行隔离。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "154",
        "title": "包过滤主要是通过审查包的内容作为过滤依据，放行正常包并拒绝发送可疑包。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "155",
        "title": "WEB应用防火墙工作在TCP/IP协议栈的网络层，通过对信息头部检测提供过滤能力。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "156",
        "title": "网页篡改是常见的WEB应用层攻击，造成的影响较大。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "157",
        "title": "安全隔离与信息单向导入是在安全隔离与信息交换技术的基础上，基于光的单向性发展起来的单向隔离技术。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "158",
        "title": "中间人攻击是一种“间接”的入侵攻击，这种攻击模式是通过各种技术手段将入侵者控制的一台计算机虚拟放置在网络连接中的两台通信计算机之间，使其成为“中间人”。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "159",
        "title": "除了中间人攻击，攻击者还可能利用“嗅探”方式对未加密的网络传播数据进行截获，并将数据篡改后重新发送。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "160",
        "title": "在云计算平台中，租户私有网络是分配给租户的专有虚拟网络空间，只能供租户自身使用，需要确保其私密性及防攻击能力。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "161",
        "title": "云计算平台在网络边界处部署流量监控、攻击和入侵行为检测机制，主要是避免从云计算平台之外发起的网络行为对云计算平台的影响。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "162",
        "title": "虚拟机逃逸是指在已控制一个虚拟机的前提下，通过利用各种安全漏洞，进一步拓展渗透到Hypervisor甚至其它虚拟机中。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "163",
        "title": "网络安全等级保护要求云计算平台应提供对云存储服务客户数据备份的存储位置进行查询的能力。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "164",
        "title": "不同的租户有各自的VPC，同一个租户不可能有多个VPC。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "165",
        "title": "租户VPC内的流量属于租户，平台和其他租户没有权限监控租户VPC内的流量，但是可以监控租户之间，以及租户与平台之间的网络流量。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "166",
        "title": "虚拟化技术除了提高效率和利润空间外，虚拟化安全技术还会明显的降低安全威胁。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "167",
        "title": "云计算平台支持对恶意代码进行检测和处置的能力，可以是平台自身的能力，也可以是开放接口由第三方提供的能力。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "168",
        "title": "应对接入系统的移动终端，采取基于SIM卡、证书等信息的强认证措施。应能限制移动设备在不同工作场景下对WiFi、3G、4G等网络的访问能力。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "169",
        "title": "适用等级保护第二级的单位，应当能够对未知接入的无线设备进行感知、发现和阻断。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "170",
        "title": "移动终端应安装漏洞扫描与杀毒软件，且使用可靠VPN软件，即可接入安全管理系统。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "应保证移动终端安装、注册并运行终端管理客户端软件。"
    },
    {
        "id": "171",
        "title": "为了对非法无线接入设备和非法移动终端进行识别，需建立合法无线接入设备和合法移动终端配置库。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "172",
        "title": "感知节点设备所处的物理环境应不对感知节点设备造成物理破坏，如强干扰、阻挡屏蔽等。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "173",
        "title": "温湿度传感器可以安装在阳光直射区域。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "感知节点设备在工作状态所处物理环境应能正确反映环境状态（如温湿度传感器不能安装在阳光直射区域）。"
    },
    {
        "id": "174",
        "title": "在物联网中新增加设备后，需要为其配置相应的安全策略。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "175",
        "title": "数据重放主要是使用历史数据进行的攻击,所以只需判断数据是不是最新的就可以了。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "176",
        "title": "由于物联网感知节点设备、网关节点设备部署分散，无需定期巡视部署环境。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "177",
        "title": "系统管理员应对RFID和Zigbee等各种无线传感器进行统一监测和处理。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "178",
        "title": "等保2.0物联网安全计算环境分别从感知节点设备安全、网关节点设备安全、抗数据重放以及数据融合处理四个方面进行了详细规定。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "179",
        "title": "现场设备执行控制操作时无需检查用户的权限。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "180",
        "title": "控制过程完整性保护的任务是使系统具备识别、隔离、响应、恢复等攻击应对措施，保证控制过程不被破坏。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "181",
        "title": "工业控制系统可以通过工控防火墙、网闸等对工业控制网络与企业网或互联网之间的边界进行安全防护。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "182",
        "title": "工控防火墙应提供针对工控协议的数据级深度解析和过滤。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "183",
        "title": "某安全厂商为解决实时工业控制系统与本单位办公网的隔离问题，开发了安全隔断的产品，即将实时工业控制系统需要上报的信息，转成数字在特定的屏幕上显示，然后通过光学识别器读入，恢复原有的信息上传至本单位的办公网，实现了完全的电隔离，这样保证了安全。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "不对传递的信息进行检查过滤仍然有安全风险。"
    },
    {
        "id": "184",
        "title": "第三级安全要求中强调应对工控网络提供全面的实时监测、风险告警等，对所有不符合边界访问控制策略的行为，不正常的状态、网络包频度、流量、网络端口扫描、探测行为进行实时报警和审计。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "185",
        "title": "对实时响应和操作要求高的场合，应将工业控制通信会话过程进行分阶段设计。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "186",
        "title": "ICMP协议在网络测试中很安全好用，在工控系统中可放心使用。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "对一些实时响应要求高的控制器频繁探测，会导致控制器不能实时响应，甚至宕机。"
    },
    {
        "id": "187",
        "title": "在进行工业控制系统安全设计时，审计管理需根据安全审计策略对各类网络安全信息进行分类管理与查询，并生成统一的审计报告。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "188",
        "title": "大数据安全指的是大数据应用相关的安全。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "大数据安全是指大数据平台以及大数据应用的安全，并非单指大数据应用自身安全。"
    },
    {
        "id": "189",
        "title": "大数据应用是基于大数据平台对数据处理过程,通常包括数据采集、数据交换和数据销毁。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "大数据平台对数据的处理过程，通常包括数据采集、数据存储、数据应用、数据交换和数据销毁等环节。"
    },
    {
        "id": "190",
        "title": "大数据存储、处理和分析设备所在机房必须位于中国境内。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "191",
        "title": "大数据应用应该提供数据销毁的机制，但不必公开销毁方式。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "应为大数据应用提供数据销毁机制，并明确销毁方式和销毁要求"
    },
    {
        "id": "192",
        "title": "大数据平台和第三方对外提供服务，只有第三方需要在大数据应用授权下才可对大数据资源进行访问、使用和管理。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "无论平台还是第三方，都需要在大数据应用授权下才可对大数据资源进行访问、使用和管理。"
    },
    {
        "id": "193",
        "title": "所有录用的人员均应签署保密协议和岗位责任协议。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "194",
        "title": "某单位退休员工从事网络运维工作，办理离退手续时，只需取回各种身份证件、钥匙、徽章等以及机构提供的硬件设备。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "195",
        "title": "人员调离或离岗时的保密协议可单独签署，也可在刚入职所签署的保密协议中规定离职后的保密期限和保密职责。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "196",
        "title": "针对不同岗位人员进行的技术技能考核可以与工作考核结合，但是不能由工作考核代替。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "197",
        "title": "安全运维管理中的环境管理主要针对机房环境的管理。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "198",
        "title": "资产标识主要根据资产的重要程度进行标识管理的。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "199",
        "title": "专用存储柜或专用存储房间均可满足介质存放在安全的环境中的要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "200",
        "title": "信息处理设备带离机房或办公地点必须对存储介质进行完全清除或被安全覆盖。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "201",
        "title": "对于运维人员都会操作的设备，就无需编写配置和操作手册了。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "202",
        "title": "对于第三级系统,无需指定专门的部门或人员对日志、监测和报警数据等进行分析、统计。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "203",
        "title": "系统所采用的密码技术和产品需要通过国家密码管理主管部门的认证。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "204",
        "title": "应用系统用户身份鉴别信息的口令设置为@dgWdekc10ee，在口令复杂度要求上判定为“符合”。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "205",
        "title": "应用系统的身份标识具有唯一性，是指登录应用系统的账户和自然人要一一对应。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "206",
        "title": "用户只能根据管理员分配的权限来访问应用系统相应的功能。（   ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "207",
        "title": "应用系统正式上线后应保留默认账户，方便系统维护。（   ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "208",
        "title": "应用系统的管理员配置访问控制策略，访问控制策略规定访问账户对系统的访问规则。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "209",
        "title": "第三级系统应对重要的业务数据、鉴别数据等设置敏感标记，控制账户对具有安全标记信息资源的访问。（   ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "210",
        "title": "应用系统的审计功能只需要覆盖管理用户。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "211",
        "title": "如果用户数量和操作事件多，为了保证的应用系统的存储空间和运行效率，可以只记录部分重要用户的重要操作。（   ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "212",
        "title": "应用系统管理员可中断审计日志。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "213",
        "title": "在传输层面，能报保证传输的数据在发送和接收时可以通过包括但不限于基于哈希运算的消息验证码等方式对传输的数据进行完整性的校验。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "214",
        "title": "重要鉴别数据的传输采用MD5码校验技术满足数据保密性的要求。（   ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "215",
        "title": "为了保障数据的安全，应对全部数据进行加密存储。（   ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "216",
        "title": "应仅采集和保存业务必须的用户个人信息。（   ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "217",
        "title": "SSL协议是位于TCP/IP层和数据链路层的通信协议。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "位于TCP/IP层和应用层"
    },
    {
        "id": "218",
        "title": "在进行网络安全等级保护测评时，安全审计的测评对象不包括网络设备。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "219",
        "title": "防火墙一般采用“所有未被允许的就是禁止的”和“所有未被禁止的就是允许的”两个基本准则，其中前者的安全性要比后者高。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "220",
        "title": "网络安全等级保在第三级的信息系统应对进出网络的数据流实现基于应用协议和应用内容的访问控制。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "221",
        "title": "网络安全等级保护级别为第三级的信息系统，无线网络不允许接入内部网络。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "222",
        "title": "第三级信息系统应在关键网络节点处对垃圾邮件进行检测和防护。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "223",
        "title": "对于企业内部网络，无需设定终端接入方式或网络地址范围对通过网络进行管理的管理终端进行限制。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "224",
        "title": "在第三级系统中，对非授权外连控制的要求可理解为：限定相关设备仅能通过授权的访问路径访问授权的网络资源，并通过技术措施限制访问其他非授权网络资源。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "225",
        "title": "在第四级网络中，通过网闸设备实现对边界的隔离，网闸设备属于物理隔离。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "226",
        "title": "在第三级系统中，在访问控制措施配中置相关策略时，可以仅针对目的IP地址、目的端口进行访问控制。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "227",
        "title": "通过防火墙设备配置严格的访问控制策略，限制源IP地址、源端口、目的IP地址、目的端口，即实现了对应用协议和内容的管控。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "228",
        "title": "基准值都是事先进行采集的。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "基准值采集方式包括事先采集和即时采集两种。"
    },
    {
        "id": "229",
        "title": "第四级系统可以采用防病毒软件实现对恶意代码的防范。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "在基本要求中，对第四级系统明确要求“应采用主动免疫可信验证机制及时识别入侵和病毒行为，并将其有效阻断。”因此第四级系统必须采用主动免疫可信验证机制进行恶意代码防范。"
    },
    {
        "id": "230",
        "title": "为了防盗窃和防破坏，机房设置无人值守视频监控系统即可。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "规范中要求的是“设置有专人值守的视频监控系统”"
    },
    {
        "id": "231",
        "title": "管理员首次登录时要强制用户修改默认口令。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "232",
        "title": "第二级系统需要提供异地实时备份功能，利用通信网络将重要数据实时备份至备份场地。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "第三级才要求异地实施备份"
    },
    {
        "id": "233",
        "title": "登录失败的处理功能主要是为了防止口令暴力破解。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "234",
        "title": "应严格控制运维工具的使用，经过审批后才可接入进行操作，操作过程中应保留不可更改的审计日志，操作结束后应删除工具中的敏感数据。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "235",
        "title": "某物理机房所有布线均为上走线，但隔离铺设在不同的桥架中。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "236",
        "title": "安全管理制度不管通过什么方式只要发布到相关人员手中即可。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "237",
        "title": "确保系统中所使用的密码产品采用了密码算法即可。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "238",
        "title": "应严格控制远程运维的开通，经过审批后才可开通远程运维接口或通道，操作过程中应保留不可更改的审计日志，操作结束后立即关闭接口或通道。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "239",
        "title": "某集团公司每年上半年、下半年各开展一次应急预案演练，演练前对所有参与人员组织开展至少一次培训。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "240",
        "title": "系统管理员默认具有系统的最高权限，可以执行对系统的审计管理、安全管理操作。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "241",
        "title": "审计管理员可以对审计日志进行删除操作，因此对其操作进行审计的意义不大，可以不必对审计操作进行审计。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "242",
        "title": "安全管理员必须通过身份鉴别后，才能对系统执行安全管理操作。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "243",
        "title": "安全管理员负责系统用户账号的设置、密码策略的管理，也包括分配系统管理员、安全管理员和审计管理员的账号和权限。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "244",
        "title": "实现集中管控功能的设备必须集中放置在同一个机房，并单独划定管理区域。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "245",
        "title": "可以采用带外管理、加密的安全方式对安全设备或组件进行管理。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "246",
        "title": "如果设备自身具备运行状态监测和实时报警功能，则不必采取其他集中监测手段额外实施状态监测。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "247",
        "title": "对于自研的业务系统，如果本身自己带有日志审计功能，且日志格式标准化程度不够的，可以不必集中采集和分析该业务系统的日志。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "248",
        "title": "针对防火墙访问控制策略、入侵保护系统防护策略等安全策略，均应采取集中管理的手段。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "249",
        "title": "提供集中管控功能的系统对安全事件监测的范围应能够覆盖网络所有关键路径。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "250",
        "title": "第三级系统安全设计方案中应包含密码设计相关内容。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "251",
        "title": "在Linux操作系统中，/etc/login.defs文件中PASS_MAX_DAYS参数所显示的口令有效期指定了系统中所有普通账户的口令有效期。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "解析内容描述，在新建账户时，若不指定账户口令的有效期参数，则默认使用/etc/login．defs文件中PASS_MAX_DAYS参数的值。而改变PASS_MAX_DAYS参数的值并不影响已有账户的口令有效期设置，故题干中的说法不准确。"
    },
    {
        "id": "252",
        "title": "Telnet是一个远程传送协议，它将包括用户名和口令在内的所有数据都明文在链路上传送，具有一定的安全隐患。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "telnet协议不支持加密传输，在远程通信中存在信息被窃听的风险，故题干中的说法正确。"
    },
    {
        "id": "253",
        "title": "为符合等级保护2.0基本要求的双因素身份鉴别测评项，所采用的双因素解决方案中应至少有一种使用密码技术实现。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "由基本要求可知题干中的说法正确。"
    },
    {
        "id": "254",
        "title": "在Linux操作系统中，若一个账户的shell被设置为nologin,则禁止该账户登录操作系统。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "shell是Linux操作系统使用的命令解释壳，用户通过shell与操作系统内核交互，调用内核实现相关功能，当设置为nologin时，该用户将不允许登录操作系统，故正确。"
    },
    {
        "id": "255",
        "title": "从/var/log/secure中可以查看Linux操作系统用户登录行为的日志记录。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "解析内容描述，/var/log/secure主要用于记录包括登录在内的，涉及用户名和口令相关的事件，故正确。"
    },
    {
        "id": "256",
        "title": "Linux操作系统的/var/log/audit/audit.log日志记录，可以覆盖事件的日期和时间、用户、事件类型、事件是否成功及其他与审计相关的信息。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "解析内容描述，/var/log/audit/audit.log包含type\\msg\\date\\time\\pid\\uid\\auid\\ses\\ exe\\hostname\\addr\\res等，故正确。"
    },
    {
        "id": "257",
        "title": "在Windows操作系统的本地安全策略设置“密码最长使用期限”为90天，那么administrator账户将于90天后密码过期。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "解析内容描述，如果administrator勾选了“密码永不过期”，则本地安全策略中设置的90天有效期将不对administrator生效，故错误。"
    },
    {
        "id": "258",
        "title": "Windows日志支持记录远程登录用户的IP地址、用户名等信息。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "解析内容描述，在Windows日志->安全->详细信息中可查看用户登录的详细记录，包括IP地址、用户名等，故正确。"
    },
    {
        "id": "259",
        "title": "Windows系统日志记录的内容无法满足等级保护基本要求（第三级）对日志内容的要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "解析内容描述，在Windows日志->安全->详细信息中可查看用户登录的详细记录，覆盖事件类型、编号、级别、用户、时间、结果等内容，故题干说法不正确。"
    },
    {
        "id": "260",
        "title": "Windows系统中，administrator用户无法停止EventLog服务。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "解析内容描述，EventLog服务由系统控制，用户无法操作，故题干说法正确。"
    },
    {
        "id": "261",
        "title": "Oracle数据库不支持口令复杂度和有效期校验。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "解析内容描述，查阅Oracle手册可知，Oracle通过Password_verify_function、Password_life_time参数对用户设置的口令进行复杂度和有效期进行校验，故题干说法不正确。"
    },
    {
        "id": "262",
        "title": "Oracle支持主体为用户级，客体为数据库表级的访问控制粒度。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "解析内容描述，在Oracle数据库中，dba_role_privs记录用户角色具有的权限。dba_tab_privs记录用户表具有的权限，故题干说法正确。"
    },
    {
        "id": "263",
        "title": "若将Oracle数据库日志设置为归档模式，则LOGGING、FORCELOGGING、NOLOGGING三种日志记录模式均支持介质恢复。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "解析内容描述，查阅Oracle手册可知，归档模式中的LOGGING或FORCE LOGGING 支持介质恢复，而NOLOGGING 模式不支持介质恢复，故题干说法错误。"
    },
    {
        "id": "264",
        "title": "MySQL远程连接不支持SSL加密。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "解析内容描述，MySQL可以通过开启have_openssl和have_ssl等参数，来启用SSL加密支持，故题干说法错误。"
    },
    {
        "id": "265",
        "title": "MySQL允许用户将具有的权限授权给其他用户。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "解析内容描述，赋予用户权限的时候，加上With Grant Option，即该用户则拥有了将获得的权限再赋予其它人的权限（其实就是同时修改了grant_priv字段），故题干说法正确。"
    },
    {
        "id": "266",
        "title": "MySQL支持主体为用户级，客体为数据库表级的访问控制粒度。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "解析内容描述，在MySQL数据库中，mysql．tables_priv记录用户具有的表权限。mysql．columns_priv记录用户具有的列权限，故题干说法正确。"
    },
    {
        "id": "267",
        "title": "为避免无关用户修改MySQL数据库的日志策略，应限制仅允许审计管理员对记录日志的表或文件有操作权限。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "解析内容描述，仅授予审计管理员数据库日志的操作权限，可以避免审计记录未预期的删除或更改，故题干说法正确。"
    },
    {
        "id": "268",
        "title": "通过mysql．user表中的host字段，可以限制MySQL数据库用户允许登录的IP地址。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "解析内容描述，根据MySQL的登录验证机制，题干说法正确。"
    },
    {
        "id": "269",
        "title": "运维终端由运维人员使用，不运行业务服务，故可以不定期更新口令。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "解析内容描述，终端设备是访问服务器的入口，也应具备一定的安全措施，故题干说法不正确。"
    },
    {
        "id": "270",
        "title": "为便于使用，可以允许终端设备保留administrator账户而不进行重命名。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "解析内容描述，运维终端也需要重命名操作系统默认账户。"
    },
    {
        "id": "271",
        "title": "不确定终端操作系统中的445端口是否有用，可以允许保留该端口。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "解析内容描述，445端口与局域网共享文件夹和打印机相关，有被黑客恶意利用的记录，安全起见应予以关闭，故题干说法错误。"
    },
    {
        "id": "272",
        "title": "限制远程运维终端可以登录的地址范围，是一种降低无关用户恶意入侵服务器风险的措施。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "273",
        "title": "在Windows服务器中，如该服务器加入了域控，登录失败处理检查中，应登录该服务器查看本地安全策略。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "274",
        "title": "Windows操作系统不能重命名administrator。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "275",
        "title": "跨站脚本攻击分为存储型、反射型、DOM型三种（    ）。",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "276",
        "title": "主机房和辅助区避免布置在用水区域的直接下方，不选择与振动和电磁干扰源为邻。 （    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "277",
        "title": "接地系统是所有接地装置的分流点，为所有需要接地保护的设备、系统和人员操作安全等提供电荷释放途径。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "汇流点"
    },
    {
        "id": "278",
        "title": "机房及相关的工作房间和辅助房应采用具有耐火等级的建筑材料，比如，数据中心建筑物耐火等级不低于二级。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "279",
        "title": "数据中心与建筑内其它功能用房之间采用耐火极限不低于2.0h的防火隔墙和1.5h的楼板隔开，隔墙上开门采用甲级防火门。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "280",
        "title": "对于安全集中管控，应划分出特定的管理区域，对分布在网络中的安全设备或安全组件进行管控。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "281",
        "title": "某企业安全职能部门配备一个系统管理员和一个安全管理员，安全管理员兼任审计管理员。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "应配备专职安全管理员，不可兼任。"
    },
    {
        "id": "282",
        "title": "在运维过程中，执行安装系统组件或调整配置参数等操作，无需进行审批。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "283",
        "title": "单位在网络安全建设过程中应使用国家密码管理主管部门认证核准的密码技术和产品。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "284",
        "title": "连续性是工业生产的基本要求，生产设备和设备的控制系统都需要长期连续运行，很难做到及时更新补丁，对此类系统通常采用“白名单”方式进行安全保护。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "285",
        "title": "可编程逻辑控制器实质是一种专用于工业控制的计算机，其硬件结构基本上与微型计算机相同。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "286",
        "title": "工业企业应对重要工程师站、数据库、服务器等重要工业控制系统资产所在区域，采取访问控制、视频监控、专人值守等适当的物理安全防护措施。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "287",
        "title": "工业控制系统与企业其他系统之间应划分为两个区域，区域间应采用单向或双向的技术隔离手段。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "288",
        "title": "若工业控制系统使用了无线通信，其与企业其他系统之间需要采用技术隔离措施，技术隔离措施强度应与单向隔离强度相同。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "289",
        "title": "工业控制系统与企业其他系统之间应划分为不同区域，工业控制系统内部不用再划分安全域。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "290",
        "title": "涉及实时控制和数据传输的工业控制系统，可以与企业其他信息系统共用网络设备，只需采用单向技术隔离手段进行安全域的划分即可。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "291",
        "title": "工业控制系统控制设备的软盘驱动、光盘驱动、USB接口、串行口或多余网口等都应关闭或拆除。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "292",
        "title": "Windows系统可以通过net user查看账户的最后一次修改密码时间。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "293",
        "title": "如果采用第三方软件进行服务器远程管理，则应对第三方软件登录验证进行测评是否符合身份鉴别要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "294",
        "title": "使用自签名证书加密的SSL连接不提供强安全性，它们容易在传输中途受到攻击。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "295",
        "title": "在操作系统中，如果向某个用户组分配了权限，则该组成员的用户也具有这一权限。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "296",
        "title": "Windows共享服务在不需要的情况下应当关闭，而不仅仅是使用net share．．．/delete命令删除共享。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "net share ．．．/delete命令关闭掉的默认共享会在服务/服务器重启后重新开启，所以在不需要共享服务的情况下，应当关闭共享服务。"
    },
    {
        "id": "297",
        "title": "Login.defs中的配置项符合要求，现存用户的密码更换策略就符合要求。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "298",
        "title": "不可控网络环境指互联网、公共网络环境、内部办公环境等无管控措施，可能存在恶意攻击、数据窃听等安全隐患的网络环境。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "299",
        "title": "对于CentOS等Linux系统，可以通过直接修改pam_unix模块实现双因素认证。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "300",
        "title": "Linux系统中shadow文件不能被普通用户读取，只有超级用户才有权读取。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "301",
        "title": "如果对文件具有写w权限，就代表可以使用vim等命令修改和删除文件。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "302",
        "title": "针对安全管理中心类中，要求项“应通过审计管理员对审计记录进行分析，并根据分析结果进行处理，包括根据安全审计策略对审计记录进行存储、管理和查询等。”的测评中，需要测评人员在核查相关制度/策略文档的前提下做出判定。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": ""
    },
    {
        "id": "303",
        "title": "如果在人工检查时并未发现集中管理系统的安全管理员可绕过登录模块直接进入系统，但在渗透测试时发现该集中管理系统存在绕过登录的漏洞，那么该要求项在单元测评时仍可判符合。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "304",
        "title": "对于物联网系统，在对安全管理中心类进行测试时，仅需考虑网络传输层、处理应用层的安全设备或安全组件是否部署在特定的管理区域即可，无需考虑感知层（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "305",
        "title": "对于安全管理中心类中，集中管控控制点的要求项“应能够建立一条安全的信息传输路径，对网络中的安全设备或安全组件进行管理”，在测评过程中，测试人员核查发现系统中各安全设备或安全组件都是通过SSH、HTTPS、IPSec VPN等安全方式进行管理的，可以判定为符合。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "还需核查是否使用独立的带外管理网络对安全设备或安全组件进行管理。"
    },
    {
        "id": "306",
        "title": "集中审计系统中收集汇总来的各设备的审计记录就不需要再进行备份了。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "307",
        "title": "针对第三级系统安全管理中心类中，要求项“应对分散在各个设备上的审计数据进行收集汇总和集中分析，并保证审计记录的留存时间符合法律法规要求。”，测试人员进行了以下核查：1）各设备均已设置相关策略，将日志统一发送至了各集中审计系统；2）各集中审计系统已设置备份策略，将收集到的审计记录数据进行了定期备份，能够保证日志留存时间为6个月的要求。因此该项应为符合的结论。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "还需要关注有没有对收集汇总的的日志进行集中分析。"
    },
    {
        "id": "308",
        "title": "只要网络中部署了具备安全事件分析功能的系统或设备能够对各类安全事件进行识别、报警和分析，不用考虑该系统或设备部署位置是否能够覆盖所有关键网络路径的数据流（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": ""
    },
    {
        "id": "309",
        "title": "对于第四级系统的安全管理中心类中，要求项“应保证系统范围内的时间由唯一确定的时钟产生，以保证各种数据的管理和分析在时间上的一致性”，在测试时，测试人员查看了服务器相应配置文件中已经将服务器的IP地址设置为了时钟服务器的IP地址，于是判定该服务器使用了唯一确定时钟。请问这名测试人员的测试方法是对还是错？（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "还需要查看ntp服务是否已启用"
    },
    {
        "id": "310",
        "title": "云服务客户在对业务应用系统上云过程中，仅需关注云服务平台的系统资源、承载能力、硬件基础等，是否能保证业务应用的正常运行，无需关注云服务平台的定级备案情况。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "云服务客户在将业务应用系统部署到云上时，应保证云计算平台不承载高于其安全保护等级的业务应用系统，否则应选择比业务应用系统高的云计算平台。"
    },
    {
        "id": "311",
        "title": "在检查云服务商层面时，如网络设备中配置VXLAN 中的VNI标识。通常，云服务商配置一个VNI来表示一个租户。因此保证了不同租户（VNI）在二层网络中彼此逻辑隔离。应避免将不同租户的VNI错误地配置成为相同的号码，则会出现不同租户间主机彼此二层可达的情况（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "VXLAN技术中配置VNI标识类似VLAN ID。用于区分VXLAN段，不同VXLAN段的虚拟机在二层网络环境中无法相互通信。故需要将不同租户的VNI配置成为不同的号码，避免出现不同租户间主机彼此二层可达的情况。"
    },
    {
        "id": "312",
        "title": "某云服务商的云计算平台，服务模式为PaaS，云服务商直接负责基础网络的建设和运维，为云服务客户设置业务需要的安全策略，云服务客户无权进行自主设置，包括定义访问路径、选择安全组件、配置安全策略等。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "云计算扩展要求的网络架构中要求，应具有根据云服务客户业务需求自主设置安全策略的能力，包括定义访问路径、选择安全组件、配置安全策略。"
    },
    {
        "id": "313",
        "title": "云服务商只允许云服务客户通过云计算平台选择第三方安全服务，不允许云服务客户接入第三方安全产品。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "网络架构e测评项明确要求应提供开放接口或开放性安全服务，允许云服务客户接入第三方安全产品或在云计算平台选择第三方安全服务。"
    },
    {
        "id": "314",
        "title": "某云服务商的云计算平台，服务模式为PaaS，鉴于安全考虑，禁止一切开放接口或开放性安全服务，禁止云服务客户接入第三方安全产品或在云计算平台上选择第三方安全服务。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "B",
        "analysis": "云计算扩展要求的网络架构中要求，应提供开放接口或开放性安全服务，允许云服务客户接入第三方安全产品或在云计算平台选择第三方安全服务。"
    },
    {
        "id": "315",
        "title": "某云服务商的云平台具备基于安全标签的强访问控制功能，对系统管理员设置了访问许可等级5，对文件a.txt、文件b.bat、文件c.exe、文件的d.sql分别设置了标记等级1、6、4、3；系统管理员（级别为5）无法读取文件b.bat，只能读取文件a.txt、文件c.exe、文件d.sql。（    ）",
        "option": [
            "正确",
            "错误"
        ],
        "answer": "A",
        "analysis": "安全标记和强访问控制是对敏感及重要数据进行标记，当主体对象访问客体对象时，获取对象的安全标记并根据内核访问控制规则库判断是否具有访问权限并控制主体对象对客体对象的访问。"
    }
]
}
