[

  {
    "id": "1",
    "title": "安全物理环境（10个）->物理位置选择",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）机房场地应选择在具有防震、防风和防雨等能力的建筑内b）机房场地应避免设在建筑物的顶层或地下室，否则应加强防水和防潮措施"

  },
  {
    "id": "2",
    "title": "安全物理环境（10个）->物理访问控制",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "机房出入口应配置电子门禁系统，控制、鉴别和记录进入的人员"

  },
  {
    "id": "3",
    "title": "安全物理环境（10个）->防盗窃和防破坏",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应将机房设备或主要部件进行固定，并设置明显的不易除去的标记b）应将通信线缆铺设在隐蔽安全处c）应设置机房防盗报警系统或设置有专人值守的视频监控系统"

  },
  {
    "id": "4",
    "title": "安全物理环境（10个）->防雷击",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应将各类机柜、设施和设备等通过接地系统安全接地b）应采取措施防止感应雷，例如设置防雷保安器或过压保护装置等"

  },
  {
    "id": "5",
    "title": "安全物理环境（10个）->防火",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应设置火灾自动消防系统，能够自动检测火情、自动报警，并自动灭火b）机房及相关的工作房间和辅助房应采用具有耐火等级的建筑材料c）应对机房划分区域进行管理，区域和区域之间设置隔离防火措施"

  },
  {
    "id": "6",
    "title": "安全物理环境（10个）->防水和防潮",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应采取措施防止雨水通过机房窗户、屋顶和墙壁渗透b）应采取措施防止机房内水蒸气结露和地下积水的转移与渗透c）应安装对水敏感的检测仪表或元件，对机房进行防水检测和报警"

  },
  {
    "id": "7",
    "title": "安全物理环境（10个）->防静电",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应安装防静电地板并采用必要的接地防静电措施b）应采用措施防止静电的产生，例如采用静电消除器、佩戴防静电手环等"

  },
  {
    "id": "8",
    "title": "安全物理环境（10个）->温湿度控制",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "机房应设置温、湿度自动调节设施，使机房温、湿度的变化在设备运行所允许的范围之内"

  },
  {
    "id": "9",
    "title": "安全物理环境（10个）->电力供应",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应在机房供电线路上配置稳压器和过电压防护设备b）应提供短期的备用电力供应，至少满足设备在断电情况下的正常运行要求c）应设置冗余或并行的电力电缆线路为计算机系统供电"

  },
  {
    "id": "10",
    "title": "安全物理环境（10个）->电磁防护",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）电源线和通信线缆应隔离铺设，避免互相干扰b）应对关键设备实施电磁屏蔽"

  },
  {
    "id": "11",
    "title": "安全通信网络->网络架构",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应保证网络设备的业务处理能力满足业务高峰期需要b）应保证网络各个部分的带宽满足业务高峰期需要c）应划分不同的网络区域，并按照方便管理和控制的原则为各网络区域分配地址d）应避免将重要网络区域部署在边界处，重要网络区域与其他网络区域之间应采取可靠的技术隔离手段e）应提供通信线路、关键网络设备和关键设备的硬件冗余，保证系统的可用性"

  },
  {
    "id": "12",
    "title": "安全通信网络->通信传输",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应采用校验技术或密码技术保证通信过程中数据的完整性b）应采用密码技术保证通信过程数据的保密性"

  },
  {
    "id": "13",
    "title": "安全通信网络->可信验证",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "可基于可信根对通信设备的系统引导程序、系统程序、重要配置参数和通信应用程序等进行可信验证，并在应用程序的关键执行环节进行动态可信验证，在检测到其可信性受到破坏后进行报警，并将验证结果形成审计记录送至安全管理中心"

  },
  {
    "id": "14",
    "title": "安全区域边界(6个)->边界防护",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应保证跨越边界的访问和数据流通过边界防护设备提供的受控接口进行通信b）应能够对非授权设备私自联到内部网络的行为进行限制或检查c）应能够对内部用户非授权联到外部网络的行为进行限制或检查d）应限制无线网络的使用，确保无线网络通过受控的边界防护设备接入内部网络"

  },
  {
    "id": "15",
    "title": "安全区域边界(6个)->访问控制",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应在网络边界或区域之间根据访问控制策略设置访问控制规则，默认情况下除允许通信外受控接口拒绝所有通信b）应删除多余或无效的访问控制规则，优化访问控制列表，并保证访问控制规则数量最小化c）应对源地址、目的地址、源端口、目的端口和协议等进行检查，以允许/拒绝数据包进出d）应能根据会话状态信息为进出数据流提供明确的允许/拒绝访问的能力e）应对进出网络的数据流实现基于应用协议和应用内容的访问控制"

  },
  {
    "id": "16",
    "title": "安全区域边界(6个)->入侵防范",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应在关键网络节点处检测、防止或限制从外部发起的网络攻击行为b）应在关键网络节点处检测、防止或限制从内部发起的网络攻击行为c）应采取技术措施对网络行为进行分析，实现对网络攻击特别是新型网络攻击行为的分析d）当检测到攻击行为时，记录攻击源IP、攻击类型、攻击目的、攻击时间，在发生严重入侵事件时应提供报警   "

  },
  {
    "id": "17",
    "title": "安全区域边界(6个)->恶意代码和垃圾邮件防范",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应在关键网络节点处对恶意代码进行检测和清除，并维护恶意代码防护机制的升级和更新b）应在关键网络节点处对垃圾邮件进行检测和防护，并维护垃圾邮件防护机制的升级和更新"

  },
  {
    "id": "18",
    "title": "安全区域边界(6个)->安全审计",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应在网络边界、重要网络节点进行安全审计，审计覆盖到每个用户，对重要的用户行为和重要安全事件进行审计b）审计记录应包括事件的日期和时间、用户、事件类型、事件是否成功及其他与审计相关的信息c）应对审计记录进行保护，定期备份，避免受到未预期的删除、修改或覆盖等d）应能对远程访问的用户行为、访问互联网的用户行为等单独进行行为审计和数据分析"

  },
  {
    "id": "19",
    "title": "安全区域边界(6个)->可信验证",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "可基于可信根对边界设备的系统引导程序、系统程序、重要配置参数和边界防护应用程序等进行可信验证，并在应用程序的关键执行环节进行动态可信验证，在检测到其可信性受到破坏后进行报警，并将验证结果形成审计记录送至安全管理中心"

  },
  {
    "id": "20",
    "title": "安全计算环境->身份鉴别",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应对登录的用户进行身份标识和鉴别，身份标识具有唯一性，身份鉴别信息具有复杂度要求并定期更换b）应具有登录失败处理功能，应配置并启用结束会话、限制非法登录次数和当登录连接超时自动退出等相关措施c）当进行远程管理时，应采取必要措施，防止鉴别信息在网络传输过程中被窃听d）应采用口令、密码技术、生物技术等两种或两种以上组合的鉴别技术对用户进行身份鉴别，且其中一种鉴别技术至少应使用密码技术来实现"

  },
  {
    "id": "21",
    "title": "安全计算环境->访问控制",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应对登录的用户分配账号和权限b）应重命名或删除默认账户，修改默认账户的默认口令c）应及时删除或停用多余的、过期的账号，避免共享账号的存在d）应授予管理用户所需的最小权限，实现管理用户的权限分离e）应由授权主体配置访问控制策略，访问控制策略规定主体对客体的访问规则f）访问控制的粒度应达到主体为用户级或进程级，客体为文件、数据库表级g）应对重要主体和客体设置安全标记，并标记主体对有安全标记信息资源的访问"

  },
  {
    "id": "22",
    "title": "安全计算环境->安全审计",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应启用安全审计功能，审计覆盖到每个用户，对重要的用户行为和重要安全事件进行审计b）审计记录应包括事件的日期和时间、用户、事件类型、事件是否成功及其他与审计相关的信息c）应对审计记录进行保护，定期备份，避免受到未预期的删除、修改或覆盖等d）应对审计进程进行保护，防止未经授权的中断"

  },
  {
    "id": "23",
    "title": "安全计算环境->入侵防范",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应遵循最小安装原则，仅安装需要的组件和应用程序b）应关闭不需要的系统服务、默认共享和高危端口c）应通过设定终端接入方式或网络地址范围对通过网络进行管理的管理终端进行限制d）应提供数据有效性检验功能，保证通过人机接口输入或通过通信接口输入的内容符合系统设定要求e）应能发现可能存在的已知漏洞，并在经过充分测试评估后，及时修补漏洞f）应能够检测到对重要节点进行入侵的行为，并在发生严重入侵事件时提供报警"

  },
  {
    "id": "24",
    "title": "安全计算环境->恶意代码防范",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "应采用免受恶意代码攻击的技术措施或主动免疫可信验证机制及时识别入侵和病毒行为，并将其有效阻断"

  },
  {
    "id": "25",
    "title": "安全计算环境->可信验证",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "可基于可信根对计算设备的系统引导程序、系统程序、重要配置参数和应用程序等进行可信验证，并在应用程序的关键执行环节进行动态可信验证，在检测到其可信性受到破坏后进行报警，并将验证结果形成审计记录送至安全管理中心"

  },
  {
    "id": "26",
    "title": "安全计算环境->数据完整性",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应采用校验技术或密码技术保证通信过程中数据的完整性，包括但不限于鉴别数据、重要业务数据、重要审计数据、重要配置数据、重要视频数据和重要个人信息等b）应采用校验技术或密码技术保证重要数据在存储过程中的完整性，包括但不限于鉴别数据、重要业务数据、重要审计数据、重要配置数据、重要视频数据和重要个人信息等"

  },
  {
    "id": "27",
    "title": "安全计算环境->数据保密性",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应采用密码技术保证重要数据在传输过程中的保密性，包括但不限于鉴别数据、重要业务数据和重要个人信息等b）应采用密码技术保证重要数据在存储过程中的保密性，包括但不限于鉴别数据、重要业务数据和重要个人信息等"

  },
  {
    "id": "28",
    "title": "安全计算环境->数据备份恢复",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应提供重要数据的本地数据备份与恢复功能b）应提供异地实时备份功能，利用通信网络将重要数据实时备份至备份场地c）应提供重要数据处理系统的热冗余，保证系统的高可用性"

  },
  {
    "id": "29",
    "title": "安全计算环境->剩余信息保护",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应保证鉴别信息所在的存储空间被释放或重新分配前得到完全清除b）应保证存有敏感数据的存储空间被释放或重新分配前得到完全清除"

  },
  {
    "id": "30",
    "title": "安全计算环境->个人信息保护",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应仅采集和保存业务必需的用户个人信息b）应禁止未授权访问和非法使用用户个人信息"

  },
  {
    "id": "31",
    "title": "安全管理中心->系统管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应对系统管理员进行身份鉴别，只允许其通过特定的命令或操作界面进行系统管理操作，并对这些操作进行审计b）应通过系统管理员对系统的资源和运行进行配置、控制和管理，包括用户身份、系统资源配置、系统加载和启动、系统运行的异常处理、数据和设备的备份与恢复等"

  },
  {
    "id": "32",
    "title": "安全管理中心->审计管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应对审计管理员进行身份鉴别，只允许其通过特定的命令或操作界面进行安全审计操作，并对这些操作进行审计b）应通过审计管理员对审计记录进行分析，并根据分析结果 进行处理，包括根据安全审计策略对审计记录进行存储、管理和查询等            "

  },
  {
    "id": "33",
    "title": "安全管理中心->安全管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应对安全管理员进行身份鉴别，只允许其通过特定的命令或操作界面进行安全管理操作，并对这些操作进行审计b）应通过安全管理员对系统中的安全策略进行配置，包括安全参数的设置，主体、客体进行统一安全标记，对主体进行授权，配置可信验证策略等"

  },
  {
    "id": "34",
    "title": "安全管理中心->集中管控",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应划分出特定的管理区域，对分布在网络中的安全设备或安全组件进行管控b）应能够建立一条安全的信息传输路径，对网络中的安全设备或安全组件进行管理c）应对网络链路、安全设备、网络设备和服务器等的运行状况进行集中监测d）应对分散在各个设备上的审计数据进行收集汇总和集中分析，并保证审计记录的留存时间符合法律法规要求e）应对安全策略、恶意代码、补丁升级等安全相关事项进行集中管理f）应能对网络中发生的各类安全事件进行识别、报警和分析"

  },
  {
    "id": "35",
    "title": "安全管理制度->安全策略",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "应制定网络安全工作的总体方针和安全策略，阐明机构安全工作的总体目标、范围、原则和安全框架等 "

  },
  {
    "id": "36",
    "title": "安全管理制度->管理制度",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应对安全管理活动中的各类管理内容建立安全管理制度b）应对要求管理人员或操作人员执行的日常管理操作建立操作规程c）应形成由安全策略、管理制度、操作规程、记录表单等构成的全面的信息安全管理制度体系"

  },
  {
    "id": "37",
    "title": "安全管理制度->制定和发布",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应指定或授权专门的部门或人员负责安全管理制度的制定b）安全管理制度应通过正式、有效的方式发布，并进行版本控制"

  },
  {
    "id": "38",
    "title": "安全管理制度->评审和修订",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "应定期对安全管理制度的合理性和适用性进行论证和审定，对存在不足或需要改进的安全管理制度进行修订"

  },
  {
    "id": "39",
    "title": "安全管理机构->岗位设置",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应成立指导和管理信息安全工作的委员会或领导小组，其最高领导由单位主管领导委任或授权b）应设立信息安全管理工作的职能部门，设立安全主管、安全管理各个方面的负责人岗位，并定义各负责人的职责c）应设立系统管理员、网络管理员、安全管理员等岗位，并定义部门及各个工作岗位的职责"

  },
  {
    "id": "40",
    "title": "安全管理机构->人员配备",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应配备一定数量的系统管理员、网络管理员、安全管理员等b）应配备专职安全管理员，不可兼任"

  },
  {
    "id": "41",
    "title": "安全管理机构->授权和审批",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应根据各个部门和岗位的职责明确授权审批事项、审批部门和批准人等b）应针对系统变更、重要操作、物理访问和系统接入等事项建立审批程序，按照审批程序执行审批过程，对重要活动建立逐级审批制度c）应定期审查审批事项，及时更新需授权和审批的项目、审批部门和审批人等信息"

  },
  {
    "id": "42",
    "title": "安全管理机构->沟通和合作",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应加强各类管理人员之间、组织内部机构之间以及信息安全职能部门内部的合作与沟通，定期召开协调会议，共同协作处理信息安全问题b）应加强与兄弟单位、公安机关、各类供应商、业界专家及安全组织的合作与沟通c）应建立外联单位联系列表，包括外联单位名称、合作内容、联系人和联系方式等信息"

  },
  {
    "id": "43",
    "title": "安全管理机构->审核和检查",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应定期进行常规安全检查，检查内容包括系统日常运行、系统漏洞和数据备份等情况b）应定期进行全面安全检查，检查内容包括现有安全技术措施的有效性、安全配置与安全策略的一致性、安全管理制度的执行情况等c）应制定安全检查表格实施安全检查，汇总安全检查数据，形成安全检查报告，并对安全检查结果进行通报"

  },
  {
    "id": "44",
    "title": "安全管理人员->人员录用",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应指定或授权专门的部门或人员负责人员录用b）应对被录用人员的身份、安全背景、专业资格和资质等进行审查，对其所具有的技术技能进行考核c）应与被录用人员签署保密协议，与关键岗位人员签署岗位责任协议"

  },
  {
    "id": "45",
    "title": "安全管理人员->人员离岗",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应及时终止离岗员工的所有访问权限，取回各种身份证件、钥匙、徽章等以及机构提供的软硬件设备b）应办理严格的调离手续，并承诺调离后的保密义务后方可离开"

  },
  {
    "id": "46",
    "title": "安全管理人员->安全意识教育和培训",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应对各类人员进行安全意识教育和岗位技能培训，并告知相关的安全责任和惩戒措施b）应针对不同岗位制定不同的培训计划，对安全基础知识、岗位操作规程等进行培训"

  },
  {
    "id": "47",
    "title": "安全管理人员->外部人员访问管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应确保在外部人员物理访问受控区域前先提出书面申请，批准后由专人全程陪同，并登记备案b）应确保在外部人员接入网络访问系统前先提出书面申请，批准后由专人开设账号、分配权限，并登记备案c）外部人员离场后应及时清除其所有的访问权限d）获得系统访问授权的外部人员应签署保密协议，不得进行非授权操作，不得复制和泄露任何敏感信息"

  },
  {
    "id": "48",
    "title": "安全建设管理->定级和备案",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应以书面的形式说明保护对象的安全保护等级及确定等级的方法和理由b）应组织相关部门和有关安全技术专家对定级结果的合理性和正确性进行论证和审定c）应保证定级结果经过相关部门的批准d）应将备案材料报主管部门和相应公安机关备案"

  },
  {
    "id": "49",
    "title": "安全建设管理->安全方案设计",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应根据安全保护等级选择基本安全措施，依据风险分析的结果补充和调整安全措施b）应根据保护对象的安全保护等级及与其他级别保护对象的关系进行安全整体规划和安全方案设计，设计内容应包含密码技术相关内容，并形成配套文件c）应组织相关部门和有关安全专家对安全整体规划及其配套文件的合理性和正确性进行论证和审定，经过批准后才能正式实施"

  },
  {
    "id": "50",
    "title": "安全建设管理->产品采购和使用",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应确保网络安全产品采购和使用符合国家的有关规定b）应确保密码产品与服务的采购和使用符合国家密码管理主管部门的要求c）应预先对产品进行选型测试，确定产品的候选范围，并定期审定和更新候选产品名单"

  },
  {
    "id": "51",
    "title": "安全建设管理->自行软件开发",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应将开发环境与实际运行环境物理分开，测试数据和测试结果受到控制b）应制定软件开发管理制度，明确说明开发过程的控制方法和人员行为准则c）应制定代码编写安全规范，要求开发人员参照规范编写代码d）应具备软件设计的相关文档和使用指南，并对文档使用进行控制e）应保证在软件开发过程中对安全性进行测试，在软件安装前对可能存在的恶意代码进行检测f）应对程序资源库的修改、更新、发布进行授权和批准，并严格进行版本控制g）应保证开发人员为专职人员，开发人员的开发活动受到控制、监视和审查"

  },
  {
    "id": "52",
    "title": "安全建设管理->外包软件开发",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应在软件交付前检测其中可能存在的恶意代码b）应保证开发单元提供软件设计文档和使用指南c）应保证开发单位提供软件源代码，并审查软件中可能存在的后门和隐蔽信道"

  },
  {
    "id": "53",
    "title": "安全建设管理->工程实施",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应指定或授权专门的部门或人员负责工程实施过程的管理b）应制定工程实施方案控制安全工程实施过程c）应通过第三方工程监理控制项目的实施过程            "

  },
  {
    "id": "54",
    "title": "安全建设管理->测试验收",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）在制订测试验收方案，并依据测试验收方案实施测试验收，形成测试验收报告b）应进行上线前的安全性测试，并出具安全测试报告，安全测试报告应包含密码应用安全性测试相关内容"

  },
  {
    "id": "55",
    "title": "安全建设管理->系统交付",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应制定交付清单，并根据交付清单对所交接的设备、软件和文档等进行清点b）应对负责运行维护的技术人员进行相应的技能培训c）应提供建设过程文档和运行维护文档"

  },
  {
    "id": "56",
    "title": "安全建设管理->等级测评",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应定期进行等级测评，发现不符合相应等级保护标准要求的及时整改b）应在发生重大变更或级别发生变化时进行等级测评c）应确保测评机构的选择符合国家有关规定"

  },
  {
    "id": "57",
    "title": "安全建设管理->服务供应商选择",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应确保服务供应商的选择符合国家的有关规定b）应与选定的服务供应商签订相关协议，明确整个服务供应链各方需履行的信息安全相关义务c）应定期监督、评审和审核服务供应商提供的服务，并对其变更服务内容加以控制"

  },
  {
    "id": "58",
    "title": "安全运维管理->环境管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应指定专门的部门或人员负责机房安全，对机房出入进行管理，定期对机房供配电、空调、温湿度控制、消防等设施进行维护管理b）应建立机房安全管理制度，对有关物理访问，物品带进出和环境安全等方面的管理作出规定c）应不在重要区域接待来访人员，不随意放置含有敏感信息的纸质文件和移动介质等    "

  },
  {
    "id": "59",
    "title": "安全运维管理->资产管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应编制并保存与保护对象相关的资产清单，包括资产责任部门、重要程度和所处位置等内容b）应根据资产的重要程度对资产进行标识管理，根据资产的价值选择相应的管理措施c）应对信息分类与标识方法作出规定，并对信息的使用、传输和存储等进行规范化管理"

  },
  {
    "id": "60",
    "title": "安全运维管理->介质管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应将介质存放在安全的环境中，对各类介质进行控制和保护，实行存储环境专人管理，并根据存档介质的目录清单定期盘点b）应对介质在物理传输过程中的人员选择、打包、交付等情况进行控制，并对介质的归档和查询等进行登记记录"

  },
  {
    "id": "61",
    "title": "安全运维管理->设备维护管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应对各种设备（包括备份和冗余设备）、线路等指定专门的部门或人员定期进行维护管理b）应建立配套设施、软硬件维护方面的管理制度，对其维护进行有效的管理，包括明确维护人员的责任、涉外维修和服务的审批、维修过程的监督控制等c）应确保信息处理设备必须经过审批才能带离机房或办公地点，含有存储介质的设备带出工作环境时其中重要数据必须加密d）含有存储介质的设备在报废或重用前，应进行完全清除或被安全覆盖，确保该设备上的敏感数据和授权软件无法被恢复重用           "

  },
  {
    "id": "62",
    "title": "安全运维管理->漏洞和风险管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应采取必要的措施识别安全漏洞和隐患，对发现的安全漏洞和隐患及时进行修补或评估可能的影响后进行修补b）应定期开展安全测评，形成安全测评报告，采取措施应对发现的安全问题"

  },
  {
    "id": "63",
    "title": "安全运维管理->网络和系统安全管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应划分不同的管理员角色进行网络和系统的运维管理，明确各个角色的责任和权限b）应指定专门的部门或人员进行账号管理，对申请账号、建立账号、删除账号等进行控制\nc）应建立网络和系统安全管理制度，对安全策略、账号管理、配置管理、日志管理、日常操作、升级与打补丁、口令更新周期等方面作出规定d）应制定重要设备的配置和操作手册，依据手册对设备进行安全配置和优化配置等e）应详细记录运维操作日志，包括日常巡检工作、运行维护记录、参数的设置和修改等内容\nf）应指定专门的部门或人员对日志、监测和报警数据等进行分析、统计，及时发现可疑行为g）应严格控制变更性运维，经过审批后才可改变连接、安装系统组件或调整配置参数，操作过程中应保留不可更改的审计日志，操作结束后应同步更新配置信息库h）应严格控制运维工具的使用，经过审批后才可接入进行操作，操作过程中应保留不可更改的审计日志，操作结束后应删除工具中的敏感数据i）应严格控制远程运维的开通，经过审批后才可开通远程运维接口或通道，操作过程中应保留不可更改的审计日志，操作结束后立即关闭接口或通道j）应保证所有与外部的连接均得到授权和批准， 应定期检查违反规定无线上网及其他违反网络安全策略的行为"

  },
  {
    "id": "64",
    "title": "安全运维管理->恶意代码防范管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应提高所有用户的防恶意代码意识，对外来计算机或存储设备接入系统前进行恶意代码检查等b）应定期验证防范恶意代码攻击的技术措施的有效性"

  },
  {
    "id": "65",
    "title": "安全运维管理->配置管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应记录和保存基本配置信息，包括网络拓扑结构、各个设备安装的软件组件、软件组件的版本和补丁信息、各个设备或软件组件的配置参数等b）应将基本配置信息改变纳入变更范畴，实施对配置信息改变的控制，并及时更新基本配置信息库"

  },
  {
    "id": "66",
    "title": "安全运维管理->密码管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应遵循密码相关国家标准和行业标准b）应使用国家密码管理主管部门认证核准的密码技术和产品"

  },
  {
    "id": "67",
    "title": "安全运维管理->变更管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应明确变更需求，变更前根据变更需求制定变更方案，变更方案经过评审、审批后方可实施b）应建立变更的申报和审批控制程序，依据程序控制所有的变更，记录变更实施过程c）应建立中止变更并从失败变更中恢复的程序，明确过程控制方法和人员职责，必要时对恢复过程进行演练"

  },
  {
    "id": "68",
    "title": "安全运维管理->备份与恢复管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应识别需要定期备份的重要业务信息、系统数据及软件系统等b）应规定备份信息的备份方式、备份频度、存储介质、保存期等c）应根据数据的重要性和数据对系统运行的影响，制定数据的备份策略和恢复策略、备份程序和恢复程序等"

  },
  {
    "id": "69",
    "title": "【三级】安全运维管理->安全事件处置",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应及时向安全管理部门报告所发现的安全弱点和可疑事件b）应制定安全事件报告和处置管理制度，明确不同安全事件的报告、处置和响应流程，规定安全事件的现场处理、事件报告和后期恢复的管理职责等c）应在安全事件报告和响应处理过程中，分析和鉴定事件产生的原因，收集证据，记录处理过程，总结经验教训d）对造成系统中断和造成信息泄漏的重大安全事件应采用不同的处理程序和报告程序"

  },
  {
    "id": "70",
    "title": "【三级】安全运维管理->应急预案管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应规定统一的应急预案框架，包括启动预案的条件、应急组织构成、应急组织构成、应急资源保障、事后教育和培训等内容b）应指定重要事件的应急预案，包括应急处理流程、系统恢复流程等内容c）应定期对系统相关的人员进行应急预案培训，并进行应急预案的演练d）应定期对原有的应急预案重新评估，修订完善"

  },
  {
    "id": "71",
    "title": "【三级】安全运维管理->外包运维管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应确保外包运维服务商的选择符合国家的有关规定b）应与选定的外包运维服务商签订相关的协议，明确约定外包运维的范围、工作内容c）应确保选择的外包运维服务商在技术和管理方面均具有按照等级保护要求开展安全运维工作的能力，并将能力要求在签订的协议中明确d）应在与外包运维服务商签订的协议中明确所有相关的安全要求。如可能涉及对敏感信息的访问、处理、存储要求，对IT基础设施中断服务的应急保障要求等"

  },
  {
    "id": "72",
    "title": "云计算-安全物理环境-网络架构",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应保证云计算平台不承载高于其安全保护等级的业务应用系统b）应实现不同云服务客户虚拟网络之间的隔离c）应具有根据云服务客户业务需求提供通信传输、边界的防护、入侵防范等安全机制的能力d）应具有根据云服务客户业务需求自主设置安全策略的能力，包括定义访问路径、选择安全组件、配置安全策略e）应提供开放端口或开放性安全服务，允许云服务克服服务客户接入第三方安全产品或在云计算平台选择第三方安全服务"

  },
  {
    "id": "73",
    "title": "云计算-安全区域边界-访问控制",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应在虚拟化网络边界部署访问控制机制，并设置访问控制规则b）应在不同等级的网络边界区域边界部署访问控制机制，设置访问控制规则"

  },
  {
    "id": "74",
    "title": "云计算-安全区域边界-入侵检测",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应能检测到云服务客户发起的网络攻击行为，并能记录攻击类型、攻击时间、攻击流量等b）应能检测到对虚拟网络节点的网络攻击行为，并能记录攻击类型、攻击时间、攻击流量等c）应能检测到虚拟主机与宿主机、虚拟机与虚拟机之间的异常流量d）应在监测到网络攻击行为、异常流量情况时进行告警"

  },
  {
    "id": "75",
    "title": "云计算-安全区域边界-安全审计",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应对云服务商和云服务客户在远程管理时执行的特权命令进行审计，至少包括虚拟机删除、虚拟机重启b）应保证云服务商对云服务客户系统和数据的操作可被云服务客户审计"

  },
  {
    "id": "76",
    "title": "云计算-安全计算环境-身份鉴别",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "当远程管理云平台中设备时，管理终端和云计算平台之间建立双向身份验证机制"

  },
  {
    "id": "77",
    "title": "云计算-安全计算环境-访问控制",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应保证当虚拟机迁移时，访问控制策略随其迁移b）应允许云服务客户设置不同虚拟机之间的访问控制策略"

  },
  {
    "id": "78",
    "title": "云计算-安全计算环境-入侵防范",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应能检测到虚拟机之间的资源隔离失效，并进行告警b）应能检测到非授权新建虚拟机或重启启用虚拟机，并进行告警c）应能够检测到恶意代码感染及在虚拟机见蔓延的情况，并进行告警 "

  },
  {
    "id": "79",
    "title": "云计算-安全计算环境-镜像和快照保护",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应针对重要业务系统提供加固的操作系统镜像或操作系统安全加固服务b）应提供虚拟机镜像、快照完整性检验功能，防止虚拟机镜像被恶意篡改c）应采取密码技术或其他技术手段防止虚拟机镜像、快照中可能存在的敏感资源被非法访问"

  },
  {
    "id": "80",
    "title": "云计算-安全计算环境-数据完整性和保密性",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应确保云服务客户数据、用户个人信息等存储于中国境内，如需出境应遵循国家相关规定b）应确保只有在云服务客户授权下，云服务商或第三方才具有云服务客户数据的管理权限c）应使用检验码或密码技术确保悉尼及迁移过程中重要数据的完整性，并在检测到完整性受到破坏时采取必要的恢复措施d）应支持服务客户部署密钥管理解决方案，保证云服务客户自行实现数据的加解密过程"

  },
  {
    "id": "81",
    "title": "云计算-安全计算环境-数据备份恢复",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）云服务客户应在本地保存其业务数据的备份b）应提供查询云服务客户数据及备份存储位置的能力c）云服务商的云存储服务应保证云服务客户数据存在若干个可用的副本，各副本之间的内容应保持一致d）应为云服务客户将业务系统及数据迁移到其他云计算平台和本地系统提供技术手段，并协助完成迁移过程"

  },
  {
    "id": "82",
    "title": "云计算-安全计算环境-剩余信息保护",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应保证虚拟机所使用的内存和存储空间回收时得到完全清除b）云服务客户删除业务应用数据时，云计算平台应将云存储中所有副本删除"

  },
  {
    "id": "83",
    "title": "云计算-安全管理中心-集中管控",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应能对物理资源和虚拟资源按照策略做统一管理调度与分配b）应保证云计算平台管理流量与云服务客户流量分离c）应根据云服务商和云服务客户的职责划分，手机各自控制部分的审计数据并实现各自的集中审计d）应根据云服务商和云服务客户的职责划分，实现各自控制部分，包括虚拟化网络、虚拟机、虚拟化安全设备等的运行状况的集中监测"

  },
  {
    "id": "84",
    "title": "云计算-安全建设服务-云服务商选择",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应选择安全合规的云服务商，其所提供的云计算平台应为其所承载的业务应用系统提供相应等级的安全保护能力b）应在服务水平协议中规定云服务的各项服务内容和具体技术指标c）应在服务水平协议中规定云服务商的权限与责任，包括管理范围、职责划分、访问授权、隐私保护、行为准则、违约责任等d）应在服务水平协议中规定服务合约到期时，完整提供云服务客户数据，并承诺相关数据在云计算平台上清除e）应在选择的云服务商签署保密协议，要求其不得泄露云服务客户数据"

  },
  {
    "id": "85",
    "title": "云计算-安全建设服务-供应链管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应确保供应商的选择符合国家有关规定b）应将供应链安全事件信息或安全威胁信息及时传达到云服务客户c）应将供应商的重要变更及时传达到云服务客户，并评估变更带来的安全风险，采取措施对风险进行控制"

  },
  {
    "id": "86",
    "title": "云计算-安全运维管理-云计算环境管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "云计算平台的运维地点应位于中国境内，境外对境内云计算平台实施运维操作应遵循国家相关规定               "

  },
  {
    "id": "87",
    "title": "物联网-安全物理环境-感知节点设备物理防护",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）感知节点设备所处的物理环境应不对感知节点设备造成物理破坏，如挤压、强振动b）感知节点设备在工作状态所物理环境应能正确反映环境状态（如温湿度传感器不能安装在阳关直射区域）c）感知节点设备在工作状态所处物理环境应不对感知节点设备的正常工作造成影响，如强干扰、阻挡屏蔽等d）关键感知节点应具有可供长时间工作的电力供应（关键网关节点设备应具有持久稳定的电力供应能力）"

  },
  {
    "id": "88",
    "title": "物联网-安全区域边界-接入控制",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "应保证只有授权的感知节点可以接入"

  },
  {
    "id": "89",
    "title": "物联网-安全区域边界-入侵防范",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应能够限制于感知节点通过的目标地址，以避免对陌生地址的攻击行为b）应能够限制于网关节点通过的目标地址，以避免对陌生地址的攻击行为"

  },
  {
    "id": "90",
    "title": "物联网-安全计算环境-感知节点设备安全",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应保证只有授权的用户可以对感知节点设备上的软件应用记性配置或并更b）应具有对其连接的网关节点设备（包括读卡器）进行身份标识和鉴别的能力c）应具有对其连接的其他感知节点设备（包括路由节点）进行身份标识和鉴别的能力"

  },
  {
    "id": "91",
    "title": "物联网-安全计算环境-网关节点设备安全",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应具备对合法连接设备（包括终端节点、路由节点、数据处理中心）进行标识和鉴别的能力b）应具备过滤非法节点和伪造节点所发送的数据的能力c）授权用户应能够在设备使用过程中对关键密钥进行在线更新d）授权用户应能够在设备使用过程中对关键配置参数进行在线更新          "

  },
  {
    "id": "92",
    "title": "物联网-安全计算环境-抗数据重放",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应能够鉴别数据的新鲜性，避免历史数据的重放攻击b）应能够鉴别历史数据的非法修改，避免数据的修改重放攻击"

  },
  {
    "id": "93",
    "title": "物联网-安全计算环境-数据融合处理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "应对来自传感我的数据进行数据融合处理，使不同种类的数据可以在同一个平台被使用"

  },
  {
    "id": "94",
    "title": "物联网-安全运维管理-感知节点管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应指定人员定期巡视感知节点设备、网关节点设备的部署环境，对可能影响感知节点设备、网关节点设备正常工作的环境异常进行记录和维护b）应对感知节点设备、网关节点设备入库、存储、部署、携带、维修、丢失和报废等过程作出明确规定，并进行全程管理c）应加强对感知节点设备、网关节点设备部署环境的保密性管理，包括负责检查和维护的人员调离工作岗位应立即交换相关检查工具和检查维护记录等"

  },
  {
    "id": "95",
    "title": "工控-安全通信网络-网络架构",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）工业控制系统与企业其他系统之间应划分为两个区域，区域间应采用单向的技术隔离手段b）工业控制系统内部应根据业务特点划分为不同的安全域，安全域之间应采用技术隔离手段c）涉及实时控制和数据传输的工业控制系统，应使用独立的网络设备组网，在物理层面上实现与其他数据及外部公共信息网的安全隔离     "

  },
  {
    "id": "96",
    "title": "工控-安全通信网络-通信传输",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "在工业控制系统内使用广域网进行控制指令或相关数据交换的应采用加密认证技术手段实现身份认证、访问控制和数据加密传输"

  },
  {
    "id": "97",
    "title": "工控-安全区域边界-访问控制",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应在工业控制系统与企业其他系统之间部署访问控制设备，配置访问控制策略，禁止任何穿越区域边界的E-mail、Web、Telnet、Rlogin、、FTP等通用网络服务b）应在工业控制系统内安全域和安全域至今的边界防护机制失效时，及时进行报警"

  },
  {
    "id": "98",
    "title": "工控-安全区域边界-拨号使用控制",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）工业控制系统确需使用拨号访问服务的，应限制具有拨号访问权限的用户数量，并采取用户身份鉴别和访问控制等措施b）拨号服务器和客户端均应使用经安全加固的操作系统，并采取数字证书认证、传输加密和访问控制等措施"

  },
  {
    "id": "99",
    "title": "工控-安全区域边界-无线使用控制",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应对所有参与无线通信的用户（人员、软件进程或者设备）提供唯一性标识和鉴别b）应对所有参与无线通信的用户（人员、软件进程或者设备）进行授权以及执行使用进行限制c）应对无线通信采取传输加密的安全措施，实现传输报文的机密性保护d）对采用无线通信技术进行控制的工业控制系统，应能识别器物理环境中发射的未经授权的无线设备，报告未经授权试图接入或干扰控制系统的行为"

  },
  {
    "id": "100",
    "title": "工控-安全计算环境-控制设备安全",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）控制设备自身实现相应级别安全通用要求提出的身份鉴别、访问控制和安全审计等安全要求，如受条件限制控制设备无法实现上述要求，应由其上位控制或管理设备实现同等功能或通过管理手段控制b）应在经过充分测试评估后，在不影响系统安全稳定运行的情况下对控制设备进行补丁更新、固件更新等工作"

  },
  {
    "id": "101",
    "title": "工控-安全建设管理-产品采购和使用",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "工业控制系统重要设备应通过专业机构的安全性检测后方可采购使用"

  },
  {
    "id": "102",
    "title": "工控-安全建设管理-外包软件开发",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "应在外包开发合同中规定针对开发单位、供应商的约束条款，包括设备及系统在生命周期内有关保密、禁止关键技术扩散和设备行业专用等方面的内容"

  },
  {
    "id": "103",
    "title": "移动互联-安全物理环境-无线接入点的物理位置",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "应为无线接入设备的安全选择合理位置，避免过度覆盖和电磁干扰"

  },
  {
    "id": "104",
    "title": "移动互联-安全区域边界-边界防护",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "应保证有限网络与无线网络边界之间的访问和数据流通过无线接入网关设备 "

  },
  {
    "id": "105",
    "title": "移动互联-安全区域边界-访问控制",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "无线接入设备应开启接入认证功能，并支持采用认证服务器认证或国家密码管理机构批准的密码模块进行认证"

  },
  {
    "id": "106",
    "title": "移动互联-安全区域边界-入侵防范",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应能够检测到非授权无线接入设备和非授权移动端口的接入行为b）应能够检测到针对无线接入设备的网络扫描、Ddos攻击、密钥管理、中间人攻击和欺骗攻击等行为c）应能够检测到无线接入设备的SSID广播、WPS等高风险功能的开启状态d）应禁用无线接入设备和无线接入网关存在的风险的功能，如：SSID广播、WEP认证等e）应禁止多个AP使用同一个认证密钥f）应能够阻断非授权无线接入设备或非授权移动终端"

  },
  {
    "id": "107",
    "title": "移动互联-安全计算环境-移动终端管控",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应保证移动终端安装、注册并运行终端管路客户端软件b）移动终端应接受移动终端管理服务端的设备声明周期管理、设备远程控制。如：远程锁定、远程擦除等"

  },
  {
    "id": "108",
    "title": "移动互联-安全计算环境-移动应用管控",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应具有选择应用软件安装、运行的功能b）应只允许制定证书签名的应用软件安装和运行c）应具有软件白名单功能，应能根据白名单控制应用软件安装、运行"

  },
  {
    "id": "109",
    "title": "移动互联-安全建设管理-移动应用软件采购",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应保证移动终端安装、运行的应用软件来自可靠分发渠道或使用可靠证书签名b）应保证移动终端安装、运行的应用软件由指定的开发者开发"

  },
  {
    "id": "110",
    "title": "移动互联-安全建设管理-移动应用软件开发",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "a）应对移动业务应用软件开发者进行资格审查b）应保证开发移动业务应用软件的签名证书合法性"

  },
  {
    "id": "111",
    "title": "移动互联-安全运维管理-配置管理",
    "option": [
      "会",
      "不会"
    ],
    "answer": "A",
    "analysis": "硬件路合法无线接入设备和合法移动终端配置库，用于对非法无线接入设备和非法移动终端的识别"

  }
]

