const questions = {
  "questions": [
    {
      "id": "68",
      "title": "《区域全面经济伙伴关系协定》（ RCEP） 于 2022年1月1日正式对中国生效，以下关于RCEP的说法正确的是（   ）。",
      "option": [
        "重申密码技术作为主要应用场景的电子签名的法律效力",
        "各缔约国应就网络安全相关的事项开展合作",
        "各缔约国对于计算设施的使用或位置可能有各自的措 施，包括寻求保证通信安全和保密的要求",
        "不得将强制要求数据本地化作为其他缔约国在一国领土内进行商业行为的条件"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "69",
      "title": "根据《国民经济和社会发展第十四个五年规划和 2035年远景目标纲要》，以下（  ）方面中涉及密码技术和应用。",
      "option": [
        "数据安全",
        "数字货币",
        "数据标准",
        "网络基础设施"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "71",
      "title": "根据国家发展改革委、商务部联合发布的《市场准入负面清单（2022 年版）》，以下需国家密码局许可的事项有（  ）。",
      "option": [
        "商用密码科研成果审查鉴定",
        "商用密码产品质量检测机构资质认定",
        "电子认证服务许可",
        "电子认证服务使用密码许可"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "74",
      "title": "《“十四五”数字经济发展规划》的五大保障措施明确强化监测评估，其中包括商用密码应用安全性评估。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "86",
      "title": "根据目前我国法律规范，有关商用密码的说法正确的是（  ）。",
      "option": [
        "互联网企业可以依法使用商用密码保护重要数据",
        "商用密码不能用来保护国家秘密级信息",
        "国家对商用密码实行严格统一管理",
        "国家对商用密码实行分类分级管理"
      ],
      "answer": "B",
      "analysis": "商用密码用来保护不属于国家秘密的信息"
    },
    {
      "id": "123",
      "title": "根据《密码法》和《商用密码管理条例》，关于商用密码检测机构违法开展商用密码检测的行政处罚，下列说法正确的是（  ）。",
      "option": [
        "由密码管理部门进行",
        "由市场监督管理部门进行",
        "由市场监督管理部门会同密码管理部门进行",
        "由市场监督管理部门或者密码管理部门进行"
      ],
      "answer": "A",
      "analysis": "密码法原文：第三十九条　违反本法第二十九条规定，未经认定从事电子政务电子认证服务的，由密码管理部门责令改正或者停止违法行为，给予警告，没收违法产品和违法所得；违法所得三十万元以上的，可以并处违法所得一倍以上三倍以下罚款；没有违法所得或者违法所得不足三十万元的，可以并处十万元以上三十万元以下罚款。"
    },
    {
      "id": "131",
      "title": "（  ）不属于《密码法》中规定的国家机关和涉及密码工作的单位。",
      "option": [
        "某市公安局",
        "承担密码管理职责的企业",
        "承担密码管理职责的事业单位",
        "某市密码管理局"
      ],
      "answer": "B",
      "analysis": "根据《密码法》的规定，国家机关和涉及密码工作的单位主要包括国家机关（如公安局）和履行密码管理职责的事业单位（如密码管理局）。而企业一般不属于法定的国家机关或事业单位，即使承担密码相关工作，也不能归入这类范畴。"
    },
    {
      "id": "145",
      "title": "根据《商用密码知识与政策干部读本》，办理《电子认证服务使用密码许可证》，应首先通过安全性审查，对拟开展电子认证服务的机构建设运营的证书认证系统的（  ）进行审查。",
      "option": [
        "功能性能和互联互通情况",
        "功能性能和安全措施",
        "安全措施和互联互通情况",
        "安全措施"
      ],
      "answer": "B",
      "analysis": "商用密码应用安全性评估工作由国家密码管理部门认定的密码测评机构承担。"
    },
    {
      "id": "153",
      "title": "根据《商用密码应用安全性评估管理办法（试行）》，有关商用密码应用安全性评估程序的说法，以下错误的是（  ）。",
      "option": [
        "评估工作应遵循独立、客观、公正的原则",
        "责任单位应当在系统规划、建设和运行阶段，组织开展商用密码应用安全性评估工作",
        "测评机构完成商用密码应用安全性评估工作后，应在30个工作日内将评估结果报国家密码管理部门备案",
        "责任单位完成规划、建设、运行和应急评估后，应在30个工作日内将评估结果报国家密码管理部门备案。"
      ],
      "answer": "D",
      "analysis": "综合考察《商用密码应用安全性测评机构管理办法（试行）》"
    },
    {
      "id": "162",
      "title": "根据《商用密码应用安全性测评机构管理办法（试行）》，对申请成为商用密码应用安全性测评机构的单位在测评人员方面的要求，下列说法正确的是（  ）。",
      "option": [
        "具有本科以上学历和密码相关经验",
        "测评人员的审核以通过培训的测评人员名单为依据",
        "测评人员可以为申请单位的第三方长期外包人员",
        "具有硕士以上学历和密码相关经验"
      ],
      "answer": "A",
      "analysis": "从事与商用密码相关工作情况的说明"
    },
    {
      "id": "239",
      "title": "根据《密码法》，国家密码管理部门依据职责制定的商用密码标准不属于（   ）。",
      "option": [
        "国家标准",
        "行业标准",
        "团体标准",
        "企业标准"
      ],
      "answer": "ACD",
      "analysis": ""
    },
    {
      "id": "241",
      "title": "根据《密码法》，以下关于商用密码国家标准的说法正确的是（   ）。",
      "option": [
        "分为强制性标准、推荐性标准",
        "目前尚无商用密码的强制性国家标准",
        "企业标准应高于国家标准、行业标准相关技术要求",
        "强制性国家标准必须执行"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "242",
      "title": "根据《密码法》，以下关于商用密码国际标准的说法正确的是（   ）。",
      "option": [
        "国家推动参与商用密码国际标准化活动",
        "国外的密码标准可以直接适用于国内",
        "国家可以结合国情采用国际标准",
        "企业可以参与国际标准化活动"
      ],
      "answer": "ACD",
      "analysis": ""
    },
    {
      "id": "253",
      "title": "根据《密码法》，保护密码科学技术研究和应用的知识产权机制有（   ）。",
      "option": [
        "专利",
        "著作权",
        "工业产权",
        "商标"
      ],
      "answer": "ABD",
      "analysis": "第三十五条　商用密码检测、认证机构违反本法第二十五条第二款、第三款规定开展商用密码检测认证的，由市场监督管理部门会同密码管理部门责令改正或者停止违法行为，给予警告，没收违法所得；违法所得三十万元以上的，可以并处违法所得一倍以上三倍以下罚款；没有违法所得或者违法所得不足三十万元的，可以并处十万元以上三十万元以下罚款；情节严重的，依法吊销相关资质。"
    },
    {
      "id": "264",
      "title": "根据《密码法》，以下属于商用密码检测认证的法律依据的是（   ）。",
      "option": [
        "《密码法》",
        "《认证认可条例》",
        "《产品质量法》",
        "《标准化法》"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "266",
      "title": "根据《商用密码产品认证规则》，以下对商用密码认证证书的说法正确的是（   ）。",
      "option": [
        "商用密码产品认证证书的有效期为五年",
        "认证机构定期监督认定不符合证书保持条件的，可以撤销认证证书",
        "认证证书覆盖产品变更的，认证证书有效期不变",
        "认证证书覆盖产品扩展的，认证证书有效期自动终止"
      ],
      "answer": "ABC",
      "analysis": ""
    },
    {
      "id": "268",
      "title": "国务院标准化行政主管部门和国家密码管理部门有权制定商用密码国家标准和行业标准。根据《密码法》 《标准化法》，制定标准应当在科学技术研究成果和社会实践经验的基础上，深入调查论证，广泛征求意见，需要实现标准的要求有（）。",
      "option": [
        "先进性",
        "科学性",
        "规范性",
        "时效性"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "278",
      "title": "某关键信息基础设施运营者未按照要求要求开展商用密码应用安全性评估，导致因商用密码产品存在安全漏洞而产生大规模的用户数据泄露，根据《密码法》，针对该行为，下列正确的表述有（  ）。",
      "option": [
        "对其进行警告",
        "吊销相关资质",
        "对关键信息基础设施的运营者处以罚款",
        "对直接负责的主管人员处以罚款"
      ],
      "answer": "CD",
      "analysis": ""
    },
    {
      "id": "315",
      "title": "根据《法律、行政法规、国务院决定设定的行政许可事项清单（2023年版）》的规定，下列属于行政许可事项的是（ ）。",
      "option": [
        "商用密码科研成果审查鉴定",
        "商用密码产品质量检测机构审批",
        "电子认证服务使用密码许可",
        "电子政务电子认证服务机构资质认定"
      ],
      "answer": "ABCD",
      "analysis": "确保个人隐私、商业秘密和政府敏感数据的安全"
    },
    {
      "id": "323",
      "title": "根据《商用密码管理条例》，以下有关电子认证的表述，正确的是（  ）。",
      "option": [
        "电子认证服务机构应当按照法律、行政法规和电子认证服务密码使用技术规范、规则，使用密码提供电子认证服务",
        "电子认证服务密码使用技术规范、规则由国家密码管理部门制定并公布",
        "采用商用密码技术从事电子政务电子认证服务的机构，应当经国家密码管理部门认定，依法取得电子政务电子认证服务机构资质",
        "外商投资电子政务电子认证服务，影响或者可能影响国家安全的，应当依法进行网络安全审查。"
      ],
      "answer": "ABC",
      "analysis": "第二十一条"
    },
    {
      "id": "329",
      "title": "按照《密码法》的三级管理架构要求，省、自治区、直辖市的国家密码管理部门负责相应的商用密码管理工作。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "351",
      "title": "根据《密码法》，商用密码产品检测认证适用《中华人民共和国数据安全法》的有关规定，避免重复检测认证。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "第四十一条 违反本法规定，构成犯罪的，依法追究刑事责任；给他人造成损害的，依法承担民事责任"
    },
    {
      "id": "377",
      "title": "根据《密码法》，国家对商用密码产品的科研、生产、销售和使用实行专控管理。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "旧版条例，新版本无此条例"
    },
    {
      "id": "389",
      "title": "根据《商用密码应用安全性评估管理办法（试行）》，涉及国家安全和社会公共利益的重要领域网络和信息系统的建设单位应对评估工作承担管理责任，并接受密码管理部门的监督、检查和指导。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "417",
      "title": "使用商用密码检测机构出具的检测数据的单位，应对检测数据的真实性、准确性负责。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "第三十八条　关键信息基础设施的运营者应当自行或者委托网络安全服务机构对其网络的安全性和可能存在的风险每年至少进行一次检测评估，并将检测评估情况和改进措施报送相关负责关键信息基础设施安全保护工作的部门。"
    },
    {
      "id": "421",
      "title": "采用商用密码技术从事电子政务电子认证服务的机构，应当经国务院市场监督管理部门认定，依法取得电子政务电子认证服务机构资质。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "有前款规定的违法行为，情节严重的，由省级以上履行个人信息保护职责的部门责令改正，没收违法所得，并处五千万元以下或者上一年度营业额百分之五以下罚款，并可以责令暂停相关业务或者停业整顿、通报有关主管部门吊销相关业务许可或者吊销营业执照；"
    },
    {
      "id": "422",
      "title": "取得电子政务电子认证服务机构资质，应当具有为政务活动提供年度电子政务电子认证服务的能力。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "428",
      "title": "根据《标准化法》，关于商用密码标准体系，下列说法错误的是（  ）。",
      "option": [
        "商用密码国家标准可能有强制性标准和推荐性标准",
        "商用密码行业标准可能有强制性标准和推荐性标准",
        "商用密码团体标准由社会团体制定，只能是推荐性标准",
        "商用密码企业标准由商用密码企业制定或企业联合制定"
      ],
      "answer": "B",
      "analysis": "对拟确定为第四级以上信息系统的，运营、使用单位或者主管部门应当请国家信息安全等级保护专家评审委员会评审。"
    },
    {
      "id": "447",
      "title": "某市所属企业为国家政务系统提供运维服务，对其服务过程中产生的大量政务数据不采取加密措施，根据《数据安全法》，可对其实施的处置及处罚措施不包括（  ）。",
      "option": [
        "当地公安机关责令其限期整改",
        "当地公安机关对其给予警告的处罚",
        "若该单位拒不改正则当地公安机关可对其进行五百万元罚款",
        "当地公安机关对其处以三十万元罚款"
      ],
      "answer": "C",
      "analysis": "第十条 网络安全审查重点评估相关对象或者情形的以下国家安全风险因素：（一）产品和服务使用后带来的关键信息基础设施被非法控制、遭受干扰或者破坏的风险；（二）产品和服务供应中断对关键信息基础设施业务连续性的危害；（三）产品和服务的安全性、开放性、透明性、来源的多样性，供应渠道的可靠性以及因为政治、外交、贸易等因素导致供应中断的风险；（四）产品和服务提供者遵守中国法律、行政法规、部门规章情况；"
    },
    {
      "id": "476",
      "title": "按照《网络安全审查办法》的内容，某国家机关系被认定的关键信息基础设施运营者，其欲采购某款境外设计的商用密码产品，下列表述正确的是（  ）。",
      "option": [
        "该国家机关应当首先自行预判该商用密码产品是否可能产生国家安全风险",
        "如果该国家机关认为使用该商用密码产品可能产生国家安全风险，应当申报网络安全审查",
        "如果国家密码管理局认为使用该商用密码产品可能产生国家安全风险，网络安全审查办公室可以依职权对该国家机关启动网络安全审查",
        "由于该国家机关采购的是境外设计的商用密码产品，故只能通过国家机关申请来启动网络安全审查，网络安全审查办公室无权自行启动网络安全审查"
      ],
      "answer": "ABC",
      "analysis": "《国家政务信息化项目建设管理办法》第三十条"
    },
    {
      "id": "478",
      "title": "国家密码管理局在日常检查中发现，某市一军工科研单位的系统已被列入关键信息基础设施，其在2022年采购了一批境外A公司生产的商用密码产品，但并未申报网络安全审查。国家密码管理局发现A公司具有从事网络间谍的前科，则下列表述正确的是（  ）。",
      "option": [
        "国家密码管理局应当立即启动网络安全审查",
        "国家密码管理局应当告知该军工科研单位自行申报网络安全审查",
        "应当由网络安全审查办公室启动网络安全审查，国家密码管理局无权自行启动网络安全审查",
        "网络安全审查办公室应当报请中央网络安全和信息化委员会批准，才能够启动网络安全审查"
      ],
      "answer": "CD",
      "analysis": "《全球数据安全倡议》"
    },
    {
      "id": "481",
      "title": "对于在安全研究中发现的密码安全漏洞，在确定是否与境外安全社区共享时，应符合的法律法规和规定包括（   ）。",
      "option": [
        "《密码法》",
        "《出口管制法》",
        "《网络产品安全漏洞管理规定》",
        "《数据安全法》"
      ],
      "answer": "ABCD/AC",
      "analysis": ""
    },
    {
      "id": "486",
      "title": "按照《电子签名法》，下列关于电子签名的表述正确的是（   ）。",
      "option": [
        "可靠的电子签名其法律效力仅次于手写签名或者盖章",
        "电子签名人知悉电子签名制作数据可能已经失密时，应当终止使用该电子签名制作数据",
        "只要符合双方约 定，当事人也可自行选择使用电子签名",
        "境外电子认证服务提供者在境外签发的电子签名认证证书与依据本法认证的电子签名认证证书具有同等法律效力"
      ],
      "answer": "BC",
      "analysis": "《信息安全等级保护管理办法》第三十六、三十七、三十八条"
    },
    {
      "id": "495",
      "title": "甲系一名商用密码产品的设计人员，受Wannacry事件启发，甲认为加密勒索是一项“来钱快”的生财之道，但自己又没有直接实施勒索的勇气，遂在网上兜售自己开发的加密勒索软件工具。针对这一事实，下列表述正确的是（   ）。",
      "option": [
        "甲没有直接实施勒索活动，故不构成网络违法犯罪行为",
        "甲如果违法情节轻微，仅受到治安管理处罚，则五年内不得从事网络安全管理和网络运营关键岗位的工作",
        "甲如果违法情节严重，受到刑事处 罚，则终身不得从事网络安全管理和网络运营关键岗位的工作",
        "甲如果违法情节轻微，尚不构成犯罪的，公安机关可以没收违法所得，处以拘留，可以并处罚款"
      ],
      "answer": "BCD",
      "analysis": "《刑法》第二百八十六条"
    },
    {
      "id": "497",
      "title": "《个人信息保护法》规定的个人信息处理者应当进行个人信息保护影响评估的情形包括（   ）。",
      "option": [
        "向境外提供个人信息",
        "利用个人信息进行自动化决策",
        "委托第三方通过联邦计算等方式进行数据处理",
        "借助差分隐私方法进行敏感个人信息处理"
      ],
      "answer": "ABCD",
      "analysis": "《中国禁止出口限制出口技术目录》禁止出口部分"
    },
    {
      "id": "498",
      "title": "按照《个人信息保护法》，以下关于个人信息处理者在发生数据泄露时应履行通知义务的说法正确的是（   ）。",
      "option": [
        "发生个人信息泄露的，应通知履行个人信息保护职责的部门和个人",
        "通知应包括事件发生的原因和可能造成的后果",
        "个人信息处理者如采取了有效的加密措施，能够有效避免信息泄露、篡改、丢失造成危害 的，可以不通知个人",
        "通知应包括个人信息处理者的联系方式和采取的补救措施"
      ],
      "answer": "ABCD",
      "analysis": "《中国禁止出口限制出口技术目录》限制出口部分"
    },
    {
      "id": "505",
      "title": "按照《个人信息保护法》，在个人信息出境前，应考虑的安全保护机制有（   ）。",
      "option": [
        "制定出境计划",
        "开展出境评估",
        "进行加密或采取去标识化措施",
        "签订出境合同"
      ],
      "answer": "BCD",
      "analysis": "《关键信息基础设施安全保护条例》第四十二条　运营者对保护工作部门开展的关键信息基础设施网络安全检查检测工作，以及公安、国家安全、保密行政管 理、密码管理等有关部门依法开展的关键信息基础设施网络安全检查工作不予配合的，由有关主管部门责令改正；拒不改正 的，处5万元以上50万元以下罚款，对直接负责的主管人员和其他直接责任人员处1万元以上10万元以下罚款；情节严重的，依 法追究相应法律责任。"
    },
    {
      "id": "524",
      "title": "按照《关键信息基础设施安全保护条例》，关于关键信息基础设施中的密码管理，以下说法错误的是（   ）。",
      "option": [
        "关键信息基础设施中使用的密码属于普通密码",
        "关键信息基础设施中使用密码产品或服务，一律先行经国家安全审查",
        "国家密码管理局可以依法开展关键信息基础设施网络安全检查",
        "对国家密码管理局依法开展的关键信息基础设施网络安全检查工作不予配合的，可以处以10万元以下罚款"
      ],
      "answer": "ABD",
      "analysis": "《个人信息保护法》第五十一条"
    },
    {
      "id": "526",
      "title": "按照《关键信息基础设施安全保护条例》，在开展关键信息基础设施网络安全检查工作中，保护工作部门和其他有关检查部门不应当（   ）。",
      "option": [
        "收取费用",
        "要求购买指定密码产品",
        "指定对检查风险进行整改的服务机构",
        "将获取的信息用于非检查工作的其他用途"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "533",
      "title": "实施加密勒索攻击行为可能触犯的刑事罪名有（）。",
      "option": [
        "非法侵入计算机信息系统罪",
        "非法控制计算机信息系统罪",
        "拒不履行信息网络安全管理义务罪",
        "提供侵入、非法控制计算机信息系统程序、工具罪"
      ],
      "answer": "AB",
      "analysis": "目前48家"
    },
    {
      "id": "568",
      "title": "商用密码从业单位开展商用密码活动，应当符合该从业单位公开标准的技术要求，对此下列说法正确的是（  ）。",
      "option": [
        "企业生产的商用密码产品如果执行团体标准，则不需要公开相应标准编号",
        "企业生产的商用密码产品如果执行的标准是本企业制定的企业标准，只需要公开标准名称",
        "公开指标的类别和内容由企业根据自身特点自主确定，可以不公开私钥",
        "企业应当公开其提供的密码产品的设计细节"
      ],
      "answer": "C",
      "analysis": "中华人民共和国保守国家秘密法第二十三条：存储、处理国家秘密的计算机信息系统（以下简称涉密信息系统）按照涉密程度实行分级保护。"
    },
    {
      "id": "577",
      "title": "《政务信息系统密码应用与安全性评估工作指南》（2020版）的适用对象是（  ）。",
      "option": [
        "非涉密的国家政务信息系统建设单位和使用单位",
        "政务信息系统集成单位",
        "商用密码应用安全性评估机构",
        "以上都是"
      ],
      "answer": "D",
      "analysis": ""
    },
    {
      "id": "619",
      "title": "设杂凑函数的输出长度为 n bit，则安全的杂凑函数寻找碰撞的复杂度应该为（ ）。",
      "option": [
        "O(P(n))",
        "O(2^n)",
        "O(2^{n/2})",
        "O(n)"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "626",
      "title": "密码技术能提供的安全服务有（ ）。",
      "option": [
        "加密",
        "机密性",
        "完整性",
        "可靠性"
      ],
      "answer": "BC",
      "analysis": ""
    },
    {
      "id": "634",
      "title": "古典密码主要包括（ ）等形式。",
      "option": [
        "置换密码",
        "分组密码",
        "转轮密码",
        "代换密码"
      ],
      "answer": "ACD",
      "analysis": ""
    },
    {
      "id": "657",
      "title": "基于格理论密码是重要的后量子密码技术之一。下述属于格理论困难问题的是（ ）。",
      "option": [
        "最短向量问题 (Shortest Vector Problem, SVP)",
        "最近向量问题,Closest Vector Problem",
        "容错学习(Learning With Errors, LWE)",
        "最小整数解(Small Interger Solution)"
      ],
      "answer": "ABCD",
      "analysis": "对于分组密码，Kaliski和Robshaw提出了多线性逼近方法"
    },
    {
      "id": "670",
      "title": "以下关于完整性保护实现机制描述正确的是（）。",
      "option": [
        "开发人员使用SM4- CBC算法对不定长消息计算MAC值。",
        "开发人员使用SM3- HMAC对消息计算 MAC值，HMAC计算过程中使用了3次杂凑计算。",
        "基于对称密码或者杂凑算法的MAC机制能够确保接收者接收消息之前的消息完整性，但是不能防止接收者对消息的伪造。",
        "当采用数字签名方式时，验证方仅使用签名值和签名私钥相应的公钥证书即可完成签名验证。"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "690",
      "title": "以下关于置换（permutation）密码说法正确的是（）。",
      "option": [
        "置换密码又称为换位密码",
        "置换密码分为列置换密码、行置换密码",
        "周期置换密码是将明文串按固定长度分组，然后对每组中的子串按某个置换重新排列位置从而得到密文",
        "著名的古典凯撒密码是置换密码"
      ],
      "answer": "AC",
      "analysis": ""
    },
    {
      "id": "695",
      "title": "置换（permutation）密码采用线性变换对明文进行处理。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "非对称算法"
    },
    {
      "id": "711",
      "title": "下列哪些参数决定了穷举攻击所消耗的时间（）。",
      "option": [
        "密钥空间",
        "密钥长度",
        "主机运算速度",
        "主机显存容量"
      ],
      "answer": "ABC",
      "analysis": "生日攻击方法没有利用Hash函数的结构和任何代数弱性质，它只依赖于消息摘要的长度，即Hash值的长度。"
    },
    {
      "id": "713",
      "title": "下列密码分析方法属于已知明文攻击的是（ ）。",
      "option": [
        "最佳放射逼近分析方法",
        "线性密码分析方法",
        "分别征服分析方法",
        "时间-存储权衡攻击"
      ],
      "answer": "ABD",
      "analysis": "时间－存储权衡攻击是一种选择明文的攻击方法"
    },
    {
      "id": "716",
      "title": "以下说法正确的是（ ）。",
      "option": [
        "SM4的密钥长度为 128比特，那么用暴力破解找到正确密钥需要平均尝试约2的127次方",
        "通过PBKDF（口令为16位随机数字）生成的128比特密钥的密钥空间等同于 SM4算法密钥空间",
        "MQV密钥交换协议无法抵抗中间人攻击，但SM2密钥交换协议可以抵抗该攻击",
        "AES-256-CBC加密模式的IV值要求是随机值且保密"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "722",
      "title": "非线性密码的目的是为了降低线性密码分析的复杂度。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "724",
      "title": "以下属于密码学的分析方法的是（ ）。",
      "option": [
        "差分分析",
        "线性分析",
        "序列分析",
        "结构分析"
      ],
      "answer": "AB",
      "analysis": ""
    },
    {
      "id": "728",
      "title": "重合指数密码分析法对以下古典密码算法有效的是（ ）。",
      "option": [
        "置换密码",
        "单表代换密码",
        "多表代换密码",
        "序列密码"
      ],
      "answer": "BC",
      "analysis": ""
    },
    {
      "id": "734",
      "title": "密码设备的各组成部件既可以在多个不同芯片上实现，也可以在单芯片上实现。而模块中常见的属于单芯片构成的密码设备包括以下哪些（ ）。",
      "option": [
        "智能卡",
        "USB Key",
        "密码加速卡",
        "安全芯片"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "737",
      "title": "密码算法主要分为三类：对称密码算法、 非对称密码算法、密码杂凑算法。以下哪两种密码算法属于同一类密码体制（ ） 。",
      "option": [
        "RC4和RC5",
        "RSA和DSA",
        "SM4和AES",
        "SM2和SM9"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "739",
      "title": "杂凑函数是一种将任意长度的消息压缩到某一固定长度的消息摘要的函数。以下关于杂凑函数的说法正确的是（ ）。",
      "option": [
        "输入x可以为任意长度；输出数据串长度固定",
        "给定任何x，容易算出H（x）=h；而给出一个杂凑值h，很难找到一特定输入 x，使h=H（x）",
        "给出一个消息x，找出另一个消息y使H（x）=H（y）是计算上不可行的",
        "可以找到两个消息x、y，使得H（x）=H（y）"
      ],
      "answer": "ABC",
      "analysis": ""
    },
    {
      "id": "741",
      "title": "密码杂凑函数是指对不同的输入值，通过密码杂凑函数进行计算，得到固定长度的输出值。对密码杂凑函数的攻击方法有（ ）。",
      "option": [
        "字典攻击",
        "生日攻击",
        "彩虹表攻击",
        "穷举攻击"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "746",
      "title": "现代密码阶段大约是指20世纪50年代以来的时期。现代密码技术的特点是（ ）。",
      "option": [
        "基于密钥安全",
        "加解密算法公开",
        "加密算法保密",
        "基于置换算法"
      ],
      "answer": "AB",
      "analysis": ""
    },
    {
      "id": "747",
      "title": "下列密码体制为计算安全的是（ ）。",
      "option": [
        "RSA",
        "ECC",
        "AES",
        "一次一密系统"
      ],
      "answer": "ABC",
      "analysis": "在分组密码算法中，根据分组数据块链接的组合模式不同，可以分为以下七种工作模式：电码本 ( ElectronicCodeBook，ECB) 模式、密文分组链接( CipherBlockChaining，CBC) 模式、密文反馈 ( CipherFeedback，CFB) 模式、输出反馈\n( OutputFeedback，OFB) 模式、计数器 ( Counter，CTR) 模式、分组链接 ( BlockChaining，BC)\n模式、带非线性函数的输出反馈 ( OutputFeedbackwithaNonlinearFunction，OFBNLF) 模式"
    },
    {
      "id": "748",
      "title": "如果密文中有某一比特始终为常数，则该密文不具备伪随机性。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "分组密码算法的设计起源于1949年ClaudeShannon在Bell System Technical Journal 上发表的论文《Communication Theory of Secrecy System》，文章中提出了“混淆”和“扩散”，成为了分组密码算法设计的原则"
    },
    {
      "id": "762",
      "title": "GM/Z 4001《密码术语》中，一种利用大量互相对应的明文和密文进行分析的密码攻击方法称为（ ）。",
      "option": [
        "线性密码分析",
        "选择明文攻击",
        "选择密文攻击",
        "已知明文攻击"
      ],
      "answer": "D",
      "analysis": "SM4为32轮"
    },
    {
      "id": "768",
      "title": "GM/T 0006《密码应用标识规范》定义了C和Java等语言实现密码算法时的密钥结构体等具体数据结构。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "SM4 算法是一种分组密码算法。其分组长度为 128bit，密钥长度也为 128bit，明文长度也为128bit。"
    },
    {
      "id": "772",
      "title": "时间-存储权衡攻击是一种唯密文攻击。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "778",
      "title": "根据有限域的描述，下列（ ）是有限域。",
      "option": [
        "模素数n的剩余类集",
        "GF(2的8次方）",
        "整数集",
        "有理数集"
      ],
      "answer": "AB",
      "analysis": "SM4 分组密码算法是一个迭代分组密码算法，数据分组长度为 128 比特，密钥长度为 128比特。加密算法与密钥扩展算法都采用 32 轮非线性迭代结构（非平衡 Feistel 结构）。Feistel结构的特色是加密和解密的算法结构完全一致，在硬件实现上加密和解密使用完全相同的电路。解密过程只需要把加密过程中产生的轮密钥逆序排列就能从密文分组中恢复出明文分组。"
    },
    {
      "id": "779",
      "title": "GB/T 33560-2017《信息安全技术 密码应用标识规范》定义的标识中，包括（ ）。",
      "option": [
        "算法标识",
        "密钥标识",
        "设备标识",
        "协议标识"
      ],
      "answer": "AD",
      "analysis": "3DES使用三个密钥，密钥总长度为168比特，是DES的三倍，为同一数据块进行了两次加密和一次解密计算。3DES是最为推荐的DES加密环境的替代品。\n三重 DES 并不是进行三次 DES 加密(加密一加密一加密)，而是加密一解密一加密的过程"
    },
    {
      "id": "780",
      "title": "GB/T 33560-2017《信息安全技术 密码应用标识规范》中，包括（ ）的公钥密码算法的标识。",
      "option": [
        "RSA",
        "SM2",
        "ECDSA",
        "SM9"
      ],
      "answer": "ABD",
      "analysis": "解密，轮密钥逆序"
    },
    {
      "id": "785",
      "title": "以下关于密钥的描述，正确的是（ ）。",
      "option": [
        "在消息认证码中，发送者和接收者使用共享的密钥来进行认证",
        "在数字签名中，签名的生成和验证使用不同的密钥",
        "消息认证码所使用的密钥，是用于认证的密钥",
        "对称密码和非对称加密的密钥都可以用于机密性保护"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "786",
      "title": "以下关于完整性保护的说法错误的有（）。",
      "option": [
        "在特殊应用中，在确保杂凑值无法被修改时，也可以单纯采用杂凑算法保护数据的完整性",
        "基于公钥密码技术的数字签名可以防止敌手对消息进行篡改，但不能防止接收者对消息进行伪造",
        "基于对称密码或者杂凑算法的完整性保护机制既能确保接收者接收消息之前的消息完整性，也能防止接收者对消息的伪造",
        "HMAC可以避免单独使用杂凑算法可能会遭受中间人攻击的弊端"
      ],
      "answer": "BC",
      "analysis": ""
    },
    {
      "id": "792",
      "title": "以下场景利用了密码的不可否认功能的是（）。",
      "option": [
        "网银用户对交易信息进行签名",
        "电子证照",
        "服务端对挑战值进行签名",
        "SSL协议中对会话计算MAC"
      ],
      "answer": "AB",
      "analysis": "加密算法与密钥扩展算法都采用 32 轮非线性迭代结构"
    },
    {
      "id": "798",
      "title": "公开密钥加密（public-key cryptography）也称为非对称密钥加密（asymmetric cryptography），是一种密码学算法类型。下列算法属于公钥密码算法的是（）。",
      "option": [
        "RSA算法",
        "ElGamal算法",
        "AES算法",
        "ECC（椭圆曲线密码）算法"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "799",
      "title": "多表代换密码是以一系列代换表一次对明文消息的字母序列进行代换的加密方法。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "832",
      "title": "AES加密算法中字节代换ByteSub（）是由（ ）运算组合而成。",
      "option": [
        "列混淆",
        "轮密钥加",
        "有限域 GF(2^8)上元素的乘法逆元",
        "对字节仿射变换"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "856",
      "title": "类似于AES算法的S盒，SM4算法的S盒也是基于有限域逆运算构造。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "SM4分组密码算法是一个迭代分组密码算法，数据分组长度为128比特，密钥长度为128比特。加密算法与密钥扩展算法都采用32轮非线性迭代结构（非平衡Feistel结构）"
    },
    {
      "id": "857",
      "title": "SM4算法采用的8比特S盒与AES算法的S盒满足仿射等价关系。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "864",
      "title": "SM4算法采用32轮非线性迭代结构，以32比特字为单位进行加密运算，一次迭代为一轮变换。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "CBC加密后的密文是上下文相关的，但明文的错误不会传递到后续分组，但如果一个分组丢失，后面的分组将全部作废(同步错误)。\nCFB模式下，明文的一个错误会影响后面的密文(错误扩散)。\nOFB用的是前一个n位密文输出分组反馈回移位寄存器，OFB没有错误扩散问题。\nCTR下，上下文不相关，不会出现错误扩散"
    },
    {
      "id": "866",
      "title": "SM4算法中，其反序变换与算法的安全强度相关。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "《GMT 0002-2012 SM4分组密码算法》P3"
    },
    {
      "id": "890",
      "title": "磁盘加密要求密文和初始向量等的总长度不会超过原有的明文长度，以下分组工作模式适合用于磁盘加密的是（ ）。",
      "option": [
        "XTS",
        "HCTR",
        "CTR",
        "ECB"
      ],
      "answer": "ABC",
      "analysis": "Feistel密码是一种对称密码，其基本结构包括一个包含固定数量轮次的循环结构，每轮中包括一个固定的混淆函数和一个可变数量的扩散函数。Feistel密码的加密和解密过程是可逆的，即可以通过相同的密钥和相同的算法实现加密和解密操作。\n\nSponge密码是一种分组密码，其基本结构包括一个吸收阶段、一个混淆阶段和一个扩散阶段。Sponge密码的吸收阶段和混淆阶段是可逆的，即可以通过相同的密钥和相同的算法实现加密和解密操作。"
    },
    {
      "id": "891",
      "title": "以下操作方式，可能出现安全问题的是（ ）。",
      "option": [
        "使用ECB对于RGB图片进行加密",
        "使用固定IV的CBC模式进行性别的加密",
        "明文传递CTR模式的计数器值",
        "未采用可靠方式传递根CA的自签名证书"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "892",
      "title": "以下（ ） 算法可以安全地为变长的数据生成MAC。",
      "option": [
        "CBC-MAC",
        "HMAC",
        "GCM",
        "CMAC"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "895",
      "title": "以下分组密码算法的工作模式IV要求每个消息必须唯一，不能重用，且不可预测的是（ ）。",
      "option": [
        "OFB",
        "CFB",
        "CBC",
        "GCM"
      ],
      "answer": "ABCD",
      "analysis": "CMAC是串行的，PMAC、ECB（不建议使用）OCB和CTR均支持并行计算，CBC、CFB仅支持解密并行计算。"
    },
    {
      "id": "909",
      "title": "SM4算法的轮密钥由加密密钥生成，每个轮密钥为（ ）比特字。",
      "option": [
        "8",
        "32",
        "64",
        "128"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "914",
      "title": "下列关于分组密码算法的设计的说法正确的是（）。",
      "option": [
        "分组长度应足够大，以防止明文被穷举攻击",
        "密钥空间应足够 大，尽可能消除弱密钥",
        "密钥越长，安全性越强，因此，设计的密钥长度应该很长",
        "由密钥确定的算法要足够复杂，要能抵抗各种已知的攻击"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "922",
      "title": "消息鉴别码生成的标签必须随同消息一起加密发送给对方。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "927",
      "title": "CFB加密模式在解密过程中需要执行分组密码的解密操作。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "932",
      "title": "分组密码认证模式的构造可以抽象为使用PRP构造PRF。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "941",
      "title": "SM4加密轮函数中的线性变换由输入及其循环左移若干比特共（ ）项异或而成。",
      "option": [
        "4",
        "5",
        "8",
        "32"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "942",
      "title": "SM4密钥扩展算法中的线性变换由输入及其循环左移若干比特共（ ）项异或而成。",
      "option": [
        "3",
        "4",
        "5",
        "32"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "945",
      "title": "下述关于SM4算法和AES算法采用的S盒之间的关系叙述错误的是（ ）。",
      "option": [
        "都是8比特输入8比特输出的非线性置换",
        "都是基于有限域逆运算构造",
        "两者之间线性等价",
        "两者之间仿射等价"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "953",
      "title": "下列分组密码工作模式，（ ）是可鉴别的加密模式。",
      "option": [
        "CBC-MAC",
        "PMAC",
        "EtM",
        "ECB"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "962",
      "title": "SM4算法中采用了下述（ ）基本运算。",
      "option": [
        "异或运算",
        "模幂运算",
        "移位运算",
        "循环移位运算"
      ],
      "answer": "AD",
      "analysis": ""
    },
    {
      "id": "966",
      "title": "SM4 算法在电子密码本(ECB ， Electronic  Code Book)模式下容易受到下述哪些攻击（ ）。",
      "option": [
        "统计分析攻击",
        "分组重放攻击",
        "代换攻击",
        "差分攻击"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "967",
      "title": "下述（ ）算法的S盒与SM4算法的S盒是仿射等价。",
      "option": [
        "DES",
        "AES",
        "Camellia",
        "MISTY"
      ],
      "answer": "BC",
      "analysis": ""
    },
    {
      "id": "979",
      "title": "分组密码的认证加密模式与公钥体制下的数字签名相比，（ ）不是共有的。",
      "option": [
        "保护数据机密性",
        "保护数据完整性",
        "不可否认性",
        "运行速度快"
      ],
      "answer": "ACD",
      "analysis": ""
    },
    {
      "id": "986",
      "title": "下列分组密码可鉴别的加密模式，解密过程中一定不需要调用分组密码解密算法的是（ ）。",
      "option": [
        "GCM",
        "OCB",
        "CCM",
        "EAX"
      ],
      "answer": "ACD",
      "analysis": ""
    },
    {
      "id": "988",
      "title": "下列分组密码可鉴别的加密模式，使用串行结构的包括（ ）。",
      "option": [
        "OMAC",
        "XCBC",
        "PMAC",
        "EMAC"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "992",
      "title": "分组密码的认证加密模式在应用过程中，可以输出的信息有（ ）。",
      "option": [
        "Nonce",
        "密文",
        "标签",
        "密钥"
      ],
      "answer": "BC",
      "analysis": ""
    },
    {
      "id": "993",
      "title": "分组密码认证模式的特点包括（ ）。",
      "option": [
        "机密性保护",
        "完整性保护",
        "数据起源认证",
        "速度快"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "998",
      "title": "非线性密码分析的目的是为了降低线性密码分析的复杂度。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "999",
      "title": "下列分组密码认证加密模式中，（）只需对明文处理一遍。",
      "option": [
        "Enc-then-MAC",
        "OCB",
        "GCM",
        "CCM"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "1022",
      "title": "CCM是CTR工作模式和CBC-MAC消息鉴别码以（ ）的形式进行结合。",
      "option": [
        "MAC-then-Encrypt",
        "Encrypt-then-MAC",
        "Encrypt-and-MAC",
        "Hash-then-Encrypt"
      ],
      "answer": "C",
      "analysis": "Encrypt-then-MAC: 先用对称密码将明文加密，然后计算密文的MAC值。(可防止发送伪造密文的选择密文攻击)\nEncrypt-and-MAC: 将明文用对称密码加密，并对明文计算MAC值"
    },
    {
      "id": "1024",
      "title": "DES 算法的主要缺点有（ ）。",
      "option": [
        "密钥比较短",
        "存在弱密钥",
        "算法为对称运算",
        "存在互补对称性"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "1028",
      "title": "以下分组密码的工作模式类似于流密码的是（）。",
      "option": [
        "CFB",
        "CBC",
        "CTR",
        "OFB"
      ],
      "answer": "ACD",
      "analysis": "IDEA、Blowfish和RC5属于分组加密算法。IDEA（International Data Encryption Algorithm）：它是一种使用128位密钥和64位数据块的对称分组密码算法。Blowfish：Blowfish是一种对称密钥分组密码算法，支持可变长度的密钥和可变大小的数据块。它可采用32位到448位不等的密钥，并将数据块分为8字节进行加密。RC5（Rivest Cipher 5）：RC5是一种对称分组密码算法，它使用可变长度的密钥和可变大小的数据块。RC5通过基于轮函数的迭代操作来加密数据。而RC4并不是一种分组加密算法，它是一种流密码算法。"
    },
    {
      "id": "1030",
      "title": "计数器可以被认为是一种Nonce生成方法。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1036",
      "title": "初始状态为(00...0)的线性反馈移位寄存器输出序列的周期是(  ) 。",
      "option": [
        "不能确定",
        "1",
        "0",
        "无穷大"
      ],
      "answer": "B",
      "analysis": "初始状态全为0，LFSR输出也全为0"
    },
    {
      "id": "1047",
      "title": "ZUC算法是一个自同步序列密码算法。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1058",
      "title": "ZUC算法LFSR部分使用环上LFSR，因而实现代价较高。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "ZUC的LFSR是基于素域的"
    },
    {
      "id": "1074",
      "title": "ZUC算法是中国国家密码管理局发布的一种流密码算法，是中国的国家密码标准之一。ZUC算法的驱动部分采用了带进位的线性反馈移位寄存器。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "LFSR（线性反馈移位寄存器）不带进位；在LFSR的结果中，多项式中的\"+\"都是模2加，就是异或运算，所以是没有进位的概念；"
    },
    {
      "id": "1093",
      "title": "ZUC算法初始化过程中非线性函数F的输出需要（ ）参与到LFSR的反馈运算中。",
      "option": [
        "左移一位",
        "右移一位",
        "循环左移一位",
        "循环右移一位"
      ],
      "answer": "B",
      "analysis": "F的输出值W是右移一位之后参与LFSR的反馈计算中"
    },
    {
      "id": "1095",
      "title": "ZUC算法非线性函数F部分共使用（ ）个8比特S-盒。",
      "option": [
        "2",
        "4",
        "6",
        "8"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1102",
      "title": "ZUC算法比特重组BR层主要使用了软件实现友好的（ ）操作。",
      "option": [
        "比特级异或",
        "字符串连接",
        "比特级AND",
        "比特级OR"
      ],
      "answer": "A",
      "analysis": "不确定\nB解答：BR是从LFSR的寄存器中选择部分数据进行重组拼接，所以选字符串连接\nA解答：算法里是拼接，题目里说的是软件实现友好的XX，软件实现一般异或比较方便，所以选A也是有道理的"
    },
    {
      "id": "1129",
      "title": "基于祖冲之算法的完整性算法工作流程中的步骤有（ ）。",
      "option": [
        "初始化",
        "函数扩展",
        "产生密钥流",
        "计算MAC"
      ],
      "answer": "ACD",
      "analysis": "见标准GM/T 0001.3一2012 5.2算法工作流程，没有函数扩展"
    },
    {
      "id": "1130",
      "title": "下列属于序列密码算法的是（ ）。",
      "option": [
        "RC4",
        "A5",
        "SEAL",
        "SNOW2.0"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "1184",
      "title": "SM3密码杂凑算法最少填充（）比特。",
      "option": [
        "1",
        "32",
        "64",
        "65"
      ],
      "answer": "D",
      "analysis": "消息长度为448bit（mod 512）时填充最多，填充576bit"
    },
    {
      "id": "1185",
      "title": "SM3密码杂凑算法最多填充（）比特。",
      "option": [
        "64",
        "256",
        "512",
        "576"
      ],
      "answer": "D",
      "analysis": "L+65=512，只需要补充一个分组的最大L是447，这时没有0。448~512，都需要再补一组，可以理解成（L-477）+若干个0=512。L=448时，填充的0最多511，再加上65，最大576"
    },
    {
      "id": "1192",
      "title": "SM3密码杂凑算法的布尔函数的输入有（）个消息字。",
      "option": [
        "2",
        "3",
        "4",
        "5"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1197",
      "title": "SM3密码杂凑算法的P置换中有1比特输入差分，输出差分至少有（ ）比特。",
      "option": [
        "1",
        "2",
        "3",
        "9"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "1199",
      "title": "SM3密码杂凑算法的输入消息为“abcd”，填充后的消息中，一共有（ ）个非“0”32比特字。",
      "option": [
        "1",
        "2",
        "3",
        "4"
      ],
      "answer": "C",
      "analysis": "（32+32+32）/32=3"
    },
    {
      "id": "1201",
      "title": "以下关于SM3密码杂凑算法和SHA-256的描述正确的是（ ）。",
      "option": [
        "消息字的介入方式相同",
        "消息扩展过程生成的总消息字个数相同",
        "杂凑值的长度相同",
        "压缩函数的轮数"
      ],
      "answer": "CD",
      "analysis": "M3与SHA-256消息字介入方式不同,SM3的消息字是先扩展再进入压缩函数，SHA-256是直接进入压缩函数"
    },
    {
      "id": "1204",
      "title": "SM3密码杂凑算法的运算中（ ）起到混淆的作用。",
      "option": [
        "循环移位",
        "P置换",
        "模加",
        "布尔函数"
      ],
      "answer": "CD",
      "analysis": ""
    },
    {
      "id": "1205",
      "title": "以下关于SM3密码杂凑算法的描述正确的是（ ）。",
      "option": [
        "SM3密码杂凑算法是我国密码行业标准算法",
        "SM3密码杂凑算法是双管道杂凑函数",
        "SM3密码杂凑算法是 MD结构的杂凑函数",
        "SM3密码杂凑算法的杂凑值长度和链接变量长度相同"
      ],
      "answer": "ACD?",
      "analysis": "不确定"
    },
    {
      "id": "1234",
      "title": "MD5、SHA-1、SHA-256这3个算法所输出的杂凑值长度是不同的，而它们的分组长度也不同。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1262",
      "title": "单向杂凑函数可以用于以下哪些方面（ ）。",
      "option": [
        "数字签名",
        "密钥共享",
        "消息完整性检测",
        "操作系统中账号口令的安全存储"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "1269",
      "title": "SM3密码杂凑算法的初始值长度和杂凑值长度不相同。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1293",
      "title": "SM2的安全特性主要体现在（ ）方面。",
      "option": [
        "算法具备单向性",
        "密文不可区分性",
        "密文具有抗碰撞性",
        "密文具有不可延展性"
      ],
      "answer": "ABD",
      "analysis": "3)SM2算法的安全性和效率\n以SM2公钥加密算法为例，它的安全性主要体现在三个方面：\n①算法具备单向性，即未授权的第三方在未得到私钥的情况下，从密文计算出明文在计算上是不可行的；②算法产生的\n明文和密文具备不可区分性，即恶意第三方对于给定的密文无法区分出其是由给定的两个明文中的哪一个加密而来；③密文具备不可延展性，即第三方无法在不解密密文的前提下，通过简单扩展密文来构造出新的合法密文。\n"
    },
    {
      "id": "1313",
      "title": "SM9密码算法的用户私钥由KGC通过随机数发生器产生。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "密钥生成中心（Key Generation Center, KGC）执行以下步骤生成系统参数和主私钥： KGC生成随机数sk做为主私钥，这里0<sk<q-1 KGC计算系统公钥Ppub=sk ∙ P2"
    },
    {
      "id": "1336",
      "title": "下列属于后量子公钥密码研究方向的是（ ）。",
      "option": [
        "多变量公钥密码",
        "基于格的公钥密码",
        "基于纠错码的公钥密码",
        "基于椭圆曲线离散对数困难问题的公钥密码"
      ],
      "answer": "ABC",
      "analysis": "基于格的公钥密码体制、基于编码（线性纠错码）的公钥密码体制、基于多变量多项式方程组的公钥密码体制及基于哈希函数的数字签名等"
    },
    {
      "id": "1348",
      "title": "SM9密钥封装机制封装的秘密密钥是根据解封装用户的标识生成的。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "SM9 密码密钥封装机制和加密算法。密钥封装机制使得封装者可以产生和加密一个秘密密钥给目标用户，而唯有目标用户可以解封装该秘密密钥，并把它作为进一步的会话密钥。用椭圆曲线对实现基于标识的密钥封装机制，封装者利用解封装用户的标识产生并加密一个秘密密钥给对方，解封装用户则用相应的私钥解封装该秘密密钥。用椭圆曲线对实现的基于标识的加密与解密算法，使消息发送者可以利用接收者的标识对消息进行加密，唯有接收者可以用相应的私钥对该密文进行解密，从而获取消息。"
    },
    {
      "id": "1349",
      "title": "SM9密码算法系统参数由KGC选择。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "A：标准原文 KGC负责选择系统参数、生成签名主密钥并产生用户签名私钥的可信机构"
    },
    {
      "id": "1363",
      "title": "SM2算法中的公钥加密算法的公钥是（ ）。",
      "option": [
        "基域的元素",
        "椭圆曲线上的随机点",
        "椭圆曲线的0点",
        "椭圆曲线的基点"
      ],
      "answer": "B",
      "analysis": "公钥是曲线上的点"
    },
    {
      "id": "1376",
      "title": "用SM2算法实现一个对1024比特明文的加密，需要（ ）次点乘运算。",
      "option": [
        "1",
        "2",
        "4",
        "8"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1384",
      "title": "关于RSA的参数选择，正确的是（ ）。",
      "option": [
        "选取两个秘密素数p和q",
        "选取两个公开素数p和q",
        "（p-1）和（q-1）都必须至少具有一个很大的素因数",
        "p和q二者之差不宜过小"
      ],
      "answer": "ACD",
      "analysis": "不确定"
    },
    {
      "id": "1388",
      "title": "SM2公钥加密算法可以抵抗的攻击包括（ ）。",
      "option": [
        "唯密文攻击",
        "选择明文攻击",
        "选择密文攻击",
        "密钥恢复攻击"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "1399",
      "title": "有关SM9标识密码算法描述错误的是（ ）。",
      "option": [
        "用户的公钥由用户标识唯一确定，用户需要通过第三方保证其公钥的真实性",
        "SM9密钥交换协议可以使通信双方通过对方的标识和自身的私钥经2次或可选 3次信息传递过程，计算获取一个由双方共同决定的共享秘密密钥",
        "SM9密码算法的用户公钥长度一定为512比特，算法的应用与管理不需要数字证书",
        "在基于标识的加密算法中，解密用户持有一个标识和一个相应的私钥，该私钥由密钥生成中心通过主私钥和解密用户的标识结合产生。加密用户用解密用户的标识加密数据，解密用户用自身私钥解密数据"
      ],
      "answer": "AC",
      "analysis": ""
    },
    {
      "id": "1408",
      "title": "公钥密码的安全性理论基础是计算复杂性理论，其产生的最主要原因是（ ）。",
      "option": [
        "简化密钥管理",
        "加密算法简短",
        "模运算",
        "更安全"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "1429",
      "title": "SM9数字签名的生成会用到（ ）。",
      "option": [
        "主公钥",
        "主私钥",
        "标识",
        "数字证书"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "1430",
      "title": "SM9密码算法主公钥由（ ）产生。",
      "option": [
        "KGC通过随机数发生器",
        "KGC通过主私钥结合系统参数",
        "用户通过随机数发生器",
        "用户通过主私钥结合系统参数"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1441",
      "title": "SM9密码算法KGC是负责（ ）的可信机构。",
      "option": [
        "选择系统参数",
        "生成主密钥",
        "生成用户标识",
        "生成用户私钥"
      ],
      "answer": "ABD",
      "analysis": "同1349"
    },
    {
      "id": "1450",
      "title": "密钥派生函数是（ ）算法的辅助函数。",
      "option": [
        "SM9数字签名",
        "SM9密钥交换",
        "SM9密钥封装",
        "SM9公钥加密"
      ],
      "answer": "BCD?",
      "analysis": "不确定，《GMT 0044.3-2016 SM9 标识密码算法 第3部分：密钥交换协议.pdf》6.2 密钥交换协议流程，中体现了KDF（密钥派生函数）《GMT 0044.4-2016 SM9 标识密码算法 第4部分：密钥封装机制和公钥加密算法.pdf》6 密钥封装 中6.1.2和6.2.2 流程图中体现了 KDF（密钥派生函数）7 公钥加密算法及流程 7.1.2和7.2.2 流程图中体现了 KDF（密钥派生函数）《GMT 0044.2-2016 SM9 标识密码算法 第2部分：数字签名算法.pdf》 6 数字签名生成算法及流程 7 数字签名验证算法及流程  6.2和7.2流程图中未体现KDF"
    },
    {
      "id": "1455",
      "title": "（ ）算法需要密钥派生函数作为辅助函数。",
      "option": [
        "SM9数字签名",
        "SM9密钥交换",
        "SM9密钥封装",
        "SM9公钥加密"
      ],
      "answer": "BCD?",
      "analysis": "不确定，签名算法中没有密钥派生函数参与，数字签名的辅助函数只有密码杂凑函数与随机数发生器。见标准5.4.1概述说明"
    },
    {
      "id": "1470",
      "title": "GM/T 0010《SM2密码算法加密签名消息语法规范》中规范了使用SM2密码算法时相关的（ ）。",
      "option": [
        "加密和签名消息语法",
        "加密和签名操作结果的标准化封装",
        "对象标识符",
        "椭圆曲线参数语法"
      ],
      "answer": "ABCD",
      "analysis": "0010的范围1确定AB，表1确定C，附录A.1确定D"
    },
    {
      "id": "1477",
      "title": "SM2算法的安全级别是（ ）。",
      "option": [
        "256比特",
        "192比特",
        "128比特",
        "512比特"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "1485",
      "title": "公钥密码体制的基本思想包括（ ）。",
      "option": [
        "将传统分组密码的密钥一分为二，分为加密密钥和解密密钥",
        "加密密钥公开，解密密钥保密",
        "由加密密钥推出解密密钥，在计算上是不可行的",
        "以上都不对"
      ],
      "answer": "BC",
      "analysis": ""
    },
    {
      "id": "1494",
      "title": "SM2数字签名算法可以抵抗的攻击有（ ）。",
      "option": [
        "私钥恢复攻击",
        "存在性伪造攻击",
        "量子计算攻击",
        "强不可伪造攻击"
      ],
      "answer": "ABD?",
      "analysis": "ABD,C不确定"
    },
    {
      "id": "1495",
      "title": "SM2数字签名算法涉及到的运算有（ ）。",
      "option": [
        "随机数生成",
        "椭圆曲线点乘",
        "素性检测",
        "杂凑值计算"
      ],
      "answer": "ABD",
      "analysis": "素性检测是rsa的"
    },
    {
      "id": "1503",
      "title": "GM/T 0034《基于SM2密码算法的证书认证系统密码及其相关安全技术规范》中规定，密钥恢复操作应由密钥管理中心业务操作员和司法取证人员同时在场。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1524",
      "title": "RSA密码体制中用到了（ ）等数论知识。",
      "option": [
        "Euclidean算法",
        "中国剩余定理",
        "费马小定理",
        "欧拉函数"
      ],
      "answer": "ABCD",
      "analysis": "中国剩余定理在进行模拟运算中可以得到"
    },
    {
      "id": "1548",
      "title": "在GM/T 0019《通用密码服务接口规范》中，可用于信息机密性保护的函数有（ ）。",
      "option": [
        "计算会话密钥",
        "单块加密运算",
        "结束解密运算",
        "多组数据消息鉴别码运算"
      ],
      "answer": "AB?",
      "analysis": "不确定"
    },
    {
      "id": "1549",
      "title": "基于口令（PASSWORD）的密钥派生函数需要调用密码杂凑函数。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1554",
      "title": "由于传统的密码体制只有一个密钥，加密密钥等于解密密钥，所以密钥分配过程中必须保证（）。",
      "option": [
        "机密性",
        "可用性",
        "真实性",
        "完整性"
      ],
      "answer": "ACD",
      "analysis": ""
    },
    {
      "id": "1556",
      "title": "下列哪种密钥交换协议提供认证性和前向安全性（ ）。",
      "option": [
        "SM2 密钥交换协议",
        "Diffie-Hellman 密钥交换协议",
        "基于椭圆曲线的 Diffie-Hellman 密钥交换协议（ECDH）",
        "MQV 密钥交换协议"
      ],
      "answer": "AD",
      "analysis": ""
    },
    {
      "id": "1559",
      "title": "GM/T 0042-2015《三元对等密码安全协议测试规范》中测试平台需要使用信号采集器等设备主动捕采集测试数据。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1581",
      "title": "参照GM/T 0024标准实现的SSL协议，以下说法正确的是（ ）。",
      "option": [
        "Hello消息中，双方交换的随机数用于派生出主密钥",
        "对服务端进行身份鉴别时采用数字签名方式，若密钥交换方式为ECDHE，则签名数据中包含有服务端密钥交换参数",
        "IBC_SM4_SM3密码套件中采用SM9算法实现身份鉴别",
        "生成密钥的PRF算法可用SM3实现"
      ],
      "answer": "ABCD",
      "analysis": "a项：6.5.1主密钥由48字节组成,由预主密钥、客户端随机数、服务端随植机数、常量字符串,经PRF计算生成。b项：ServerKeyExchange当密钥交换方式为ECDHE、IBSDH和IBC时signed_params是服务端对双方随机数和服务端密钥交换参数的签名;当密钥交换方式为ECC和RSA时signed_params是服务端对双方随机数和服务端加密证书的签名。c项：5.1.5伪随机函数PRF计算方法PRF(secret,label,seed)=P_SM3(secret,label+seed)d项：表2在本标准中实现ECC和ECDHE的算法为SM2;实现IBC和IBSDH的算法为SM9"
    },
    {
      "id": "1582",
      "title": "参照GM/T 0022标准实现的IPSec协议，以下说法错误的是（ ）。",
      "option": [
        "用于通信隧道传输保护的会话密钥是在IKE阶段快速模式中生成的",
        "ESP封装模式下，可对整个IP报文提供加密保护",
        "传输模式下，AH子协议对原有IP报文和新加IP头提供完整性、数据源鉴别安全功能",
        "IKE阶段主模式中，密钥协商时的密钥素材是直接采用对方加密公钥实现机密性传输保护的"
      ],
      "answer": "BCD?",
      "analysis": "不确定，A项：第一阶段是主模式，通信双方建立一个ISAKMPSA,并实现双方的身份鉴别和密钥交换，得到工作密钥，该工作密钥用于保护第二阶段的协商过程；第二阶段是快速模式，使用已建立的ISAKMPSA提供保护，实现通信双方IPSecSA的协商，确定通信双方IPSec安全策略和会话密钥B项：单独使用ESP封装方式时，不会对数据报文的IP头进行认证，因此这种情况支持网络地址转换(NAT)穿越C项：传输模式：一般用于端到端的应用场景，只有IP载荷部分被保护，对IP头不做改动D项：信息使用用于加密的工作密钥进行对称加密保护。对称密码算法由消息1和2确定。(《商用密码应用与安全性评估》P77图1-24）"
    },
    {
      "id": "1585",
      "title": "在测评时，发现在SSL协议的Client Hello报文中出现了{0xe0,0x13}属性值，那么意味着该链路正在使用ECC_SM4_SM3套件。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1587",
      "title": "经 抓 包 发 现 通 信 双 方 协 商 的 密 码 套 件 为 ECC_SM4_SM3和ECDHE_SM4_SM3，前者无法提供前向安全性，而后者可以提供。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "1590",
      "title": "TLS 1.0 版本协议中CBC模式的IV没有使用不可预测的随机数，而是使用了上一次 CBC 模式加密时的最后一个分组，从而导致被攻击。因此，为了防御此类攻击，TLS 1.1以上的版本中要求必须隐式地传送IV。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "初始化问重(IV)必须使用不可预测的随机数。然而在SSL/TLS的TLS 1.0版本协议中，IV并没有使用不可预测的随机数，而是使用上一次CBC模式加密时的最后一个分组。为了防御攻击者对此进行攻击，TLS1.1以上的版本中改为了必须显示传送IV。"
    },
    {
      "id": "1597",
      "title": "S-HTTP （ 安全超文本传输协议） 是一种结合HTTP 而设计的安全通信协议，它工作（ ）层。",
      "option": [
        "传输层",
        "链路层",
        "网络层",
        "应用层"
      ],
      "answer": "D",
      "analysis": ""
    },
    {
      "id": "1603",
      "title": "在随机数发生器后处理方法中，并非冯·诺依曼后处理方法特点的是（ ）。",
      "option": [
        "输入序列是统计独立的",
        "输出速率是稳定的",
        "输入序列会被压缩输出",
        "输入序列是不均衡的"
      ],
      "answer": "B",
      "analysis": "对随机数生成模央输出的数字化噪声序列分组,每相邻的两位为一组,对每个分组进行判断,如果是\"00’和\"11’则丢弃,如果是\"01’则输出\"1’,如果是“10’则输出“0’.冯诺依曼校正器适用于 1出现概率固定，且输出的随机数序列是不相关的随机数生成模块。采用这种后处理方法需要保证随机数生成的速率。"
    },
    {
      "id": "1608",
      "title": "GM/T 0005《随机性检测规范》中，“离散傅立叶检测”用于检测待检序列进行傅立叶变换后得到不正常的峰值个数是否超过了允许值。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "1614",
      "title": "软件密码模块（或混合密码模块的软件部件）中的随机数发生器部件，可以单独作为软件密码模块，也可以作为软件密码模块（或混合密码模块的软件部分）的一部分。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "1620",
      "title": "以下哪些密码系统的参数应该与密钥一样进行保护（）。",
      "option": [
        "SM4加密过程中的轮密钥",
        "密码算法中随机数发生器的内部状态",
        "椭圆曲线密码体制所使用的域的参数",
        "SM2密钥交换临时产生的随机数"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "1630",
      "title": "以下关于密钥派生的说法正确的有（ ）。",
      "option": [
        "从口令派生密钥可用于加密存储设备",
        "从口令派生密钥可用于网络通信数据保护",
        "可以基于HMAC算法实现",
        "可以基于CMAC算法实现"
      ],
      "answer": "AC?",
      "analysis": "不确定，口令派生一般多个人参与，一般作为根密钥或者区域密钥存在，不会做会话密钥。常见的用HMAC算法派生。CMAC算法一般用于消息认证码，对于密钥派生未查询到相关论文。口令派生这种密钥派生方式不推荐使用,尤其不能用于网络通信数据的保护,仅在某些特定环境(如加密存储设备)中使用，排除B密钥派生算法简单分为两种：。从一个密钥派生出一个或多个新的密钥:HKDF(HMAC-basedkeyderivation),基于HMAC的密钥派生算法；。从一个密码派生出一个或多个密钥:PBKDF2、Bcrypt、Scrypt、Argjon2"
    },
    {
      "id": "1634",
      "title": "信息系统中的密钥在其生命周期内涉及到生成、存储、导入和导出、分发、使用、备份和恢复、公开、销毁等环节。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1643",
      "title": "数字签名使用密码杂凑函数预先处理消息，可以（  ）。",
      "option": [
        "防范伪造攻击",
        "提高签名的计算速度",
        "缩小待签名消息的长度",
        "提高签名验证的速度"
      ],
      "answer": "ABCD",
      "analysis": "数字签名是使用私钥对签名数据进行加密，所以签名数据越短签名速度越快"
    },
    {
      "id": "1653",
      "title": "关于消息认证，以下说法正确的是（ ）。",
      "option": [
        "可以验证消息来源",
        "可以验证消息的完整性",
        "可以验证消息的真实性",
        "可以加密消息"
      ],
      "answer": "ABC",
      "analysis": ""
    },
    {
      "id": "1665",
      "title": "下列方法可用于消息认证是（ ）。",
      "option": [
        "消息认证码（MAC）",
        "数字签名",
        "杂凑函数",
        "信息隐藏"
      ],
      "answer": "AB",
      "analysis": "单纯的杂凑函数无法实现认证功能。"
    },
    {
      "id": "1670",
      "title": "以下哪些是数字证书的构成要素（  ）。",
      "option": [
        "证书颁发者",
        "密钥用法",
        "签发时间",
        "私钥"
      ],
      "answer": "AB",
      "analysis": ""
    },
    {
      "id": "1671",
      "title": "我国双证书体系中包括签名证书和加密证书，依据GM/T0015《基于SM2密码算法的数字证书格式规范》，其中加密证书可用于（  ）。",
      "option": [
        "数据加密",
        "密钥加密",
        "数字签名",
        "密钥协商"
      ],
      "answer": "ABD",
      "analysis": "加密证书不能用于签名。"
    },
    {
      "id": "1672",
      "title": "下列关于数字证书和公钥基础设施PKI的说法正确的是（  ）。",
      "option": [
        "证书是CA机构将用户的公钥进行加密之后的产物",
        "要确认证书中所包含的公钥是否合 法，需要得到CA机构的公钥",
        "世界上颁发的所有证书，沿着CA机构的层级关系都能够找到唯一的根CA",
        "用户发现自己的私钥泄露之后，需要联系CA机构申请证书撤销"
      ],
      "answer": "BD",
      "analysis": ""
    },
    {
      "id": "1675",
      "title": "证书的生命周期包括以下哪些（）。",
      "option": [
        "证书申请",
        "证书生成",
        "证书存储",
        "证书撤销"
      ],
      "answer": "BD",
      "analysis": ""
    },
    {
      "id": "1806",
      "title": "智能密码钥匙的“设备认证”是指智能密码钥匙对应用程序的认证。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "GM/T 0048标准原文，P2"
    },
    {
      "id": "1835",
      "title": "在GM/T 0063《智能密码钥匙应用接口检测规范》中，导入数字证书接口测试过程中需要插拔设备。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "1876",
      "title": "在《PCI密码卡技术规范》中，PCI密码卡宿主端驱动程序应实现的功能包括（）。",
      "option": [
        "驱动程序的安装与卸载",
        "PCI设备的打开与关闭",
        "设备的读写操作和控制操作",
        "应用数据的解析"
      ],
      "answer": "ABC",
      "analysis": ""
    },
    {
      "id": "1887",
      "title": "在《PCI密码卡技术规范》中，PCI密码卡通过API接口完成的功能检测包含哪些项目（）。",
      "option": [
        "密码算法功能检测",
        "密钥管理检测",
        "程序升级接口功能检测",
        "密码卡内敏感数据的安全保护检测"
      ],
      "answer": "AB",
      "analysis": ""
    },
    {
      "id": "1888",
      "title": "根据《PCI密码卡技术规范》，PCI密码卡性能测试描述正确的有哪些（）。",
      "option": [
        "每次测试应具有足够数据的数据量，防止性能波动",
        "所有的算法性能指标都以bps为单位进行标示",
        "对称运算性能测试时应取不同长度的数据分别进行测试",
        "算法正确性测试时必须测试ECB、CBC、CFB、OFB等工作模式"
      ],
      "answer": "AC",
      "analysis": ""
    },
    {
      "id": "1895",
      "title": "根据《PCI密码卡技术规范》，PCI 密码卡可以不支持扩展密码算法。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "因规范原文“6.1.5 扩展密码算法 PCI密码卡只在需要时才选择支持扩展密码算法。”"
    },
    {
      "id": "1919",
      "title": "根据GM/T 0018《密码设备应用接口规范》，以下哪些属于密码设备的基本功能（）。",
      "option": [
        "密钥管理",
        "数据加密",
        "应用管理",
        "随机数生成"
      ],
      "answer": "ABD",
      "analysis": "B项数据加密好像是也是，６．５．１　对称加密中 描述了数据加解密，但标准中未找到基本功能相关的描述，B项存疑"
    },
    {
      "id": "1929",
      "title": "GM/T 0018《密码设备应用接口规范》标准是为密码设备服务层定义的接口规范。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "=DISPIMG(\"ID_3BA5B87B79DB4685A430B8110EAB6128\",1)"
    },
    {
      "id": "1931",
      "title": "在GM/T 0018《密码设备应用接口规范》中，产生随机数的接口支持产生自定义长度的随机数。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "1938",
      "title": "在GM/T 0018《密码设备应用接口规范》中，密码设备内部加密的会话密钥可以通过外部公钥进行加密转换，导出加密的会话密钥，用于数字信封转换。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "1943",
      "title": "在GM/T 0121《密码卡检测规范》中，密码卡出厂后，应支持使用（）生成会话密钥。",
      "option": [
        "调试接口",
        "管理接口",
        "测试接口",
        "服务接口"
      ],
      "answer": "D",
      "analysis": ""
    },
    {
      "id": "1954",
      "title": "在GM/T 0121《密码卡检测规范》中，在就绪状态下，密码卡不能执行（）操作。",
      "option": [
        "满足权限时，能够提供用户密钥管理和密码运算等功能",
        "通过删除操作员操作使密码卡进入初始状态",
        "生成设备密钥对和保护密钥的生成操作",
        "恢复设备密钥对和保护密钥的操作"
      ],
      "answer": "BCD",
      "analysis": "删除操作员不应该可以恢复初始状态"
    },
    {
      "id": "1974",
      "title": "根据GM/T 0022《IPSec VPN技术规范》， 关于 VPN产品密钥的配置，以下说法错误的是（）。",
      "option": [
        "VPN产品所使用的设备密钥是非对称密钥，包括签名密钥对和加密密钥对",
        "VPN产品所使用的签名密钥对由IPSec VPN产品自身产 生，其公钥证书由 CA认证机构签发，并导入到VPN产品中",
        "VPN产品所使用的加密密钥对可以由 CA的密钥管理系统产生，也可以由设备自身产生",
        "VPN产品所使用的加密密钥对对应的公钥加密证书应由第三方CA认证机构签发，并导入到 VPN产品中"
      ],
      "answer": "C",
      "analysis": "加密密钥需要有外部密钥管理机构生成导入\n详见 GMT 0022 6.3.1.1 设备密钥"
    },
    {
      "id": "1985",
      "title": "根据GM/T 0022《IPSec VPN技术规范》，密钥交换协议的协议报文应使用UDP协议500或4500端口进行传输。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "5.1.密钥交换协议定义了协商、建立、修改、删除安全联盟的过程和报文格式。 协议报文使用 UDP 协 议 500 端口进行传输；密钥交换消息是基于UDP传输的，使用UDP500端口或者4500端口。"
    },
    {
      "id": "2061",
      "title": "根据GM/T  0024  《SSL  VPN 技术规范》， SSL VPN中记录层可以将数据分成2^16字节长度。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "记录层将数据分成2~14字节或者更小的片段。"
    },
    {
      "id": "2077",
      "title": "根据GM/T 0025-2014 《SSL VPN 网关产品规范》，SSL VPN 网关产品硬件应符合（）对硬件模块物理安全的规定。",
      "option": [
        "GM/T 0028《密码模块安全技术要求》",
        "GM/T 0023《IPSecVPN 网关产品规范》",
        "GM/T 0005《随机性检测规范》",
        "GM/T 0026《安全认证网关产品规范》"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "2091",
      "title": "根据GM/T 0025-2014 《SSL VPN 网关产品规范》，SSL VPN 网关产品硬件应符合 GM/T 0028《密码模块安全技术要求》对硬件模块物理安全的规定。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "2107",
      "title": "根据GM/T 0026-2014 《安全认证网关产品规范》，安全认证网关应确保设备密钥得到安全保护，工作密钥和会话密钥不存放在（）中。",
      "option": [
        "硬盘",
        "内存",
        "易失性存储介质",
        "非易失性存储介质"
      ],
      "answer": "AD",
      "analysis": "7．3．1．2工作密钥安全安全认证网关产品的工作密钥在密钥交换的第一阶段产生，工作密钥产生后应保存在易失性存储器中，达到其更新条件后应立即更换，在连接断开、设备断电时应销毁。7．3．1．3会话密钥安全安全认证网关产品的会话密钥在密钥交换的第二阶段产生，产生后应保存在易失性存储器中，达到其更新条件后应立即更换，在连接断开、设备断电时应销毁。"
    },
    {
      "id": "2148",
      "title": "在GM/T 0049《密码键盘密码检测规范》周期自检检测中，检测人员通过文档和源代码的审查，确认源代码实现的周期自检测试和文档描述是否一致。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "2151",
      "title": "在GM/T 0049《密码键盘密码检测规范》MAC算法检测中，密码键盘利用送检单位提供的MAC参数对接收到的数据进行加密运算。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "2285",
      "title": "根据GM/T 0059《服务器密码机检测规范》，管理应支持哪几个主要功能（）。",
      "option": [
        "应支持密钥管理功能，密钥管理功能应包括密钥产生、密钥存储、密钥备份、密钥恢复和密钥销毁等子功能；",
        "应支持设备唯一标识符查询",
        "应支持设备状态管理功能，设备状态管理应包括设备状态查询功能，宜包括硬件部件状态、软件状态和版本状态等状态管理功能",
        "宜支持日志管理，日志管理功能应包含日志记录、日志查询和日志导出等功能"
      ],
      "answer": "ABCD",
      "analysis": 6.3
    },
    {
      "id": "2339",
      "title": "根据GM/T 0033《时间戳接口规范》，时间戳响应中必须包含有（）。",
      "option": [
        "TimeStampReq",
        "TimeStampToken",
        "TimeStampRes",
        "TSTInfo"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "2355",
      "title": "在GM/T 0123 《时间戳服务器密码检测规范》中，SM3杂凑算法使用的对象标识符为",
      "option": [
        "SM3密码杂凑算法，无密钥使用 1.2.156.10197.1.401.1",
        "SM3密码杂凑算法 1.2.156.10197.1.401",
        "基于SM2算法和SM3算法的签名 1.2.156.10197.1.501",
        "《SM3密码杂凑算法》1.2.156.10197.6.1.1.4"
      ],
      "answer": "C?",
      "analysis": "在25018-2018里面，1.2.156.10197.1.501，SM3WithSM2Encryption"
    },
    {
      "id": "2442",
      "title": "GM/T 0021《动态口令密码应用技术规范》动态口令的生成使用到的有（）。",
      "option": [
        "算法函数",
        "截位函数",
        "数据组装",
        "求余运算"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "2464",
      "title": "GM/T 0031《安全电子签章密码技术规范》中规定（）原因导致的签章人证书有效性验证失败，可直接退出验证流程。",
      "option": [
        "证书有效期过期错误",
        "密钥用法不正确",
        "证书信任链验证失败",
        "证书状态已吊销"
      ],
      "answer": "BC",
      "analysis": "验证签章人数字证书有效性：\n从电子签章数据获得签章人数字证书，验证签章人证书有效性，验证项至少包括：证书信任链\n验证、证书有效期验证、证书是否被吊销、密钥用法是否正确。\n如果是由于证书信任链验证或密钥用法不正确导致的签章人证书有效性验证失败，则返回失\n败原因并退出验证流程。\n如果是由于证书有效期或证书状态已吊销导致的签章人证书有效性验证失败，则还需要进一\n步结合签章时间进行综合判定。\n"
    },
    {
      "id": "2510",
      "title": "GM/T 0047《安全电子签章密码检测规范》签章原文杂凑验证检测步骤，不包含的操作是（）。",
      "option": [
        "用正确的签章原文去验证",
        "用修改后的签章原文去验证",
        "用修改了杂凑值的电子签章原文去验证",
        "验证签章者证书"
      ],
      "answer": "D",
      "analysis": "6.5.7签章原文杂凑验证检测\n检测步骤如下：\na)输入正确的电子签章及对应的签章原文，使用电子印章系统验证签章原文杂凑值，如果验证通过，则本步测试通过，否则，测试失败。\nb)输入正确的电子签章及修改后的签章原文，使用电子印章系统验证签章原文杂凑值，如果验证失败，则本步测试通过，否则，测试失败。\nc)输入修改了杂凑值的电子签章及对应的签章原文，使用电子印章系统验证签章原文杂凑值，如果验证失败，则本步测试通过，否则，测试失败。\n上面3步都通过，则本项测试通过；否则，测试失败。"
    },
    {
      "id": "2523",
      "title": "GM/T 0055《电子文件密码应用技术规范》规定使用公钥密码算法的密钥对有（）。",
      "option": [
        "加密密钥对",
        "签名密钥对",
        "加密密钥对或签名密钥对",
        "加密密钥对和签名密钥对"
      ],
      "answer": "D",
      "analysis": "0055-6.2表1\n公钥密码\n算法的密钥为两对，即加密密钥对和签名密钥对，"
    },
    {
      "id": "2524",
      "title": "GM/T 0055《电子文件密码应用技术规范》规定标签头中的签名值计算内容叙述正确的是（）。",
      "option": [
        "标签的所有内容",
        "标签体的所有内容",
        "除标签头签名以外的所有标签内容",
        "除签名以外的所有标签内容"
      ],
      "answer": "C",
      "analysis": "5.6.2 使用操作者签名私钥，对标签中除标签完整性签名以外的所有内容计算摘要并签名，将此签名值作为标签完整性签名置于标签头中。"
    },
    {
      "id": "2530",
      "title": "关于GM/T  0055 《电子文件密码应用技术规范》，下列关于安全电子文件的叙述不正确的是（）。",
      "option": [
        "安全电子文件存储形式支持内联式和外联式",
        "标签是安全电子文件的组成部分",
        "标签只能由中间件进行处理",
        "标签通过用户身份标识与实体文件进行唯一绑定"
      ],
      "answer": "D",
      "analysis": "在基于标签的安全机制中，安全电子文件由文件和标签两部分组成。文件是指原始文件或对原始文件经过密码处理后的结果，标签是指原始标签或对原始标签经过密码处理后的结果。在安全电子文件全生命周期中|文件和标签存在唯一绑定关系。标签只能由中间件进行处理。标签由标签头和标签体组成,标签体可加密。"
    },
    {
      "id": "2533",
      "title": "GM/T 0055《电子文件密码应用技术规范》关于标签安全保护体系相关叙述正确的是（）。",
      "option": [
        "标签体存放保护文件的相关属性",
        "标签头存放标签体的相关属性",
        "标签应加密保护",
        "标签应签名保护"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "2539",
      "title": "GM/T 0055《电子文件密码应用技术规范》规定标签中的标签体可加密，也可以不加密。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "2592",
      "title": "在GM/T 0011 《可信计算 可信密码支撑平台功能与接口规范》中，密码模块密钥可以由厂商（代理商）或者用户生成。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "2652",
      "title": "在GM/T 0034《基于SM2密码算法的证书认证系统密码及其相关安全技术规范》中，密钥管理系统的密钥生成模块应具有（）功能。",
      "option": [
        "非对称密钥对的生成",
        "对称密钥的生成",
        "随机数的生成",
        "备用库密钥不足时自动补充"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "2685",
      "title": "在GM/T 0014《数字证书认证系统密码协议规范》中，封装结构应遵循GM/T 0009《SM2密码算法使用规范》。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "SM2加密签名消息语法规范封装结构遵循0010"
    },
    {
      "id": "2701",
      "title": "GM/T 0037《证书认证系统检测规范》中，证书注册系统对申请信息的录入需要检测的内容包括（）。",
      "option": [
        "应能提供录入和修改证书申请信息的界面",
        "应能选择所申请数字证书的密钥类型及长度",
        "应支持批量证书申请信息的导入",
        "应能自动使操作员对其操作行为进行签名"
      ],
      "answer": "ABD",
      "analysis": "可支持批量证书申请信息的导入，不是应"
    },
    {
      "id": "2704",
      "title": "GM/T 0037《证书认证系统检测规范》中，证书认证服务运营系统中，对于设备的摆放以下正确的是（）。",
      "option": [
        "CRL的存储与发布服务器放在服务区",
        "LDAP查询服务器放在管理区",
        "CRL的生成与签发服务器放在核心区",
        "在各区域间放置防火墙"
      ],
      "answer": "ACD",
      "analysis": ""
    },
    {
      "id": "2713",
      "title": "GM/T 0037《证书认证系统检测规范》中，证书状态查询服务可以采用CRL查询或在线证书状态查询。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "2715",
      "title": "GM/T 0037《证书认证系统检测规范》中，对证书认证系统的产品检测，入根检测不合格即判定为不合格。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "在GM/T0037《证书认证系统检测规范》中，对证书认证系统的产品检测，入根检测不合格并不一定即判定为不合格。入根检测是对CA根证书的验证，如果入根检测不合格，可以进行排查和修复。只有在经过排查和修复后，经复检合格才能判定为合格。因此，入根检测不合格并不直接导致产品被判定为不合格。"
    },
    {
      "id": "2724",
      "title": "以下选项不属于GM/T 0051《密码设备管理 对称密钥管理技术规范》中密钥管理中心的功能的是（）。",
      "option": [
        "主控模块",
        "密钥生成及管理模块",
        "密钥封装及分发模块",
        "密钥管理代理模块"
      ],
      "answer": "D",
      "analysis": "6.6.2主控管理模块密钥生成模块密钥封装模块密钥分发模块密钥库存储管理模块密码服务模块密钥恢复模块审计模块"
    },
    {
      "id": "2725",
      "title": "关于原子密钥的描述，以下选项不正确的是（）。",
      "option": [
        "原子密钥可以是通用密钥产生装置生成的随机密钥",
        "原子密钥可以是专用密钥产生装饰生成的专用格式密钥",
        "原子密钥可以是临时密钥",
        "原子密钥需经过标准封装后进行分发"
      ],
      "answer": "C",
      "analysis": "原子密钥经过密管密码设备与密钥生成装置协商的临时会话密钥加密后导入密管密码机"
    },
    {
      "id": "2730",
      "title": "以下密码设备可被GM/T 0051《密码设备管理 对称密钥管理技术规范》管理的是（）。",
      "option": [
        "密码机",
        "密码卡",
        "智能IC卡",
        "智能密码钥匙"
      ],
      "answer": "AB",
      "analysis": ""
    },
    {
      "id": "2733",
      "title": "在GM/T 0051《密码设备管理 对称密钥管理技术规范》中，密钥生成模块的设计要求包括（）。",
      "option": [
        "为多个系统提供业务密钥",
        "密钥生成装置为硬件设备，随机数质量满足国家标准 GB/T 32915《信息安全技术 二元序列随机性检测方法》",
        "支持外部密钥的导入",
        "支持密钥以密文方式导出，明文密钥不可出硬件设备"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "2734",
      "title": "在GM/T 0051《密码设备管理 对称密钥管理技术规范》中，被管密码设备的技术要求包括（）。",
      "option": [
        "由设备管理代理接收密钥管理指令，由密钥管理代理处理密钥管理操作",
        "与设备管理结合，根据密钥状态支持密钥申请主动上报",
        "支持标准密钥管理协议，将标准密钥封装解析为密码设备可识别的原子密钥",
        "对于存量密码设 备，支持将标准密钥管理协议适配转换为存量设备专用密钥管理指令"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "2738",
      "title": "在GM/T 0051《密码设备管理 对称密钥管理技术规范》中，以下选项属于密钥管理审计内容的是（）。",
      "option": [
        "对密钥生成、存储、分发等密钥管理事件，以及策略管理、身份认证等系统管理事件进行审计",
        "对用户主动操作的管理事件进行审计",
        "记录服务器状态",
        "对服务器状态进行审计"
      ],
      "answer": "ABC",
      "analysis": "_对密钥生成、密钥存储、密钥分发、主控管理模块、身份认证、密码服务等模块进行事件审计、统计和分析;___记录用户主动运行事件,包括用户名称、内容、时间、结果等;___记录模块中间运行事件,包括触发事件名称、内容、时间、结果等;___记录服务器状态;___记录系统策略设置;__审计记录不能进行修改;__审计记录支持导出备份;___必须保障审计记录的完整性。"
    },
    {
      "id": "2754",
      "title": "GM/T 0008《安全芯片密码检测准则》中，安全等级1的安全芯片要求至少（）个相互独立的物理噪声源。",
      "option": [
        "2个",
        "4个",
        "8个",
        "1个"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "2781",
      "title": "GM/T 0008 《安全芯片密码检测准则》中，下列内容属于安全等级2对故障攻击的要求的是（）。",
      "option": [
        "当安全芯片工作条件中的电压、频率、温度等可导致故障的工作参数的改变使安全芯片处于易受攻击状态时，安全芯片应能够发现这些工作条件的改变，并采取相应的防护措施保护密钥和敏感信息不泄露",
        "送检单位必须通过文档或其他方式对相应的防护措施及其有效性进行描述和说明",
        "防护措施的有效性必须通过检测",
        "安全芯片须具有对光攻击的抵抗能 力，并能够采取相应的防护措施保护密钥和敏感信息不泄露。"
      ],
      "answer": "ABC",
      "analysis": "GMT0008有关于防护措施须经过检测的规定。网上有个检测准则，可能是旧版本或非官方文件"
    },
    {
      "id": "2801",
      "title": "根据GM/T 0035.5《射频识别系统密码应用技术要求第5部分：密钥管理技术要求》，射频识别系统中的密钥体制包括（ ）类。",
      "option": [
        "2",
        "3",
        "4",
        "5"
      ],
      "answer": "A",
      "analysis": "包括对称密钥体制和非对称密钥体制。"
    },
    {
      "id": "2867",
      "title": "GM/T 0088 《云服务器密码机管理接口规范》中规定云服务器密码机管理接口API可以使用下列通信协议中的（）。",
      "option": [
        "HTTP",
        "TCP",
        "UDP",
        "TLCP协议"
      ],
      "answer": "AD",
      "analysis": ""
    },
    {
      "id": "2871",
      "title": "根据GM/T 0088《云服务器密码机管理接口规范》，云服务器密码机管理接口API中，每个接口的输出中都返回的参数包括下列选项中的（）。",
      "option": [
        "requestId请求ID",
        "status状态码",
        "message状态描述",
        "timestamp服务器响应时间"
      ],
      "answer": "ABCD",
      "analysis": "6.6回调数据"
    },
    {
      "id": "2909",
      "title": "关于GM/T 0105《软件随机数发生器设计指南》中熵估计的说法，不正确的是（）。",
      "option": [
        "为保证随机数实时产出的质量，熵估计模块需要嵌入软件随机数发生器内部",
        "熵估计采用的是数学算法来计算的",
        "熵估计是对最小熵的评估",
        "熵估计的对象是熵源的输出，而非软件随机数发生器最终的输出"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "2916",
      "title": "根据GM/T  0105 《软件随机数发生器设计指南》，针对GB/T 37092《信息安全技术 密码模块安全要求》安全等级二级，以下哪些情况需要对 DRNG执行重播种操作（）。",
      "option": [
        "距离上一次DRNG重播种时间超过了600秒",
        "输出函数已被调用2^20次",
        "距离上一次DRNG重播种时间超过了60秒",
        "输出函数已被调用2^10次"
      ],
      "answer": "CD",
      "analysis": ""
    },
    {
      "id": "2917",
      "title": "GM/T 0105《软件随机数发生器设计指南》中建议，除熵输入外，DRNG输入还可以包括（）",
      "option": [
        "个性化字符串",
        "额外输入",
        "nonce",
        "设备序列号"
      ],
      "answer": "ABC",
      "analysis": ""
    },
    {
      "id": "2923",
      "title": "GM/T 0105《软件随机数发生器设计指南》对于安全二级和安全一级的密码模块中的软件随机数发生器只在重播种时机上有区别，其他方面的要求是一致的。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "2953",
      "title": "根据GM/T 0078《密码随机数生成模块设计指南》，基于相位抖原理的物理随机源的输出的随机比特序列质量受（）的影响。",
      "option": [
        "采样时钟的频率",
        "振荡源输出信号的抖动的标准差",
        "振荡源的振荡时钟频率",
        "采样时钟信号的抖动的标准差"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "2989",
      "title": "在GM/T 0012《可信计算 可信密码模块接口规范》中,非对称算法引擎的是（ ）的单元。",
      "option": [
        "产生非对称密钥",
        "执行非对称加/解密",
        "执行签名运算",
        "执行验签运算"
      ],
      "answer": "ABCD",
      "analysis": 6.13
    },
    {
      "id": "2999",
      "title": "在GM/T 0082《可信密码模块保护轮廓》中，强制性原发证明依赖于（）。",
      "option": [
        "选择性原发证明",
        "标识定时",
        "安全属性",
        "无"
      ],
      "answer": "A",
      "analysis": "8.2.1"
    },
    {
      "id": "3048",
      "title": "根据GM/T 0122《区块链密码检测规范》，区块链中在需要进行实名交易时，应使用数字签名技术鉴别用户身份的合法性及有效性。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "7.1.2"
    },
    {
      "id": "3053",
      "title": "GM/T 0087《浏览器密码应用接口规范 》定义的方法不能完成浏览器中的（）密码功能",
      "option": [
        "用户的认证",
        "文档的签名",
        "文档的加密",
        "通信SSL信道的建立"
      ],
      "answer": "D",
      "analysis": "（P1） 1 范围  （第二段）"
    },
    {
      "id": "3091",
      "title": "依照GM/T 0118 《浏览器数字证书应用接口规范》的定义，在调用SSF_AddCert将用户证书添加到证书存储区的SSF_CERT_USER_STORE区（证书存储区为用户存储区）时，如果该证书已经被吊销，则下列哪个说法正确的是（）。",
      "option": [
        "SSF_AddCert应报错，不能添加已被吊销的用户证书",
        "SSF_AddCert执行成功",
        "SSF_AddCert弹出警告框，在手动确认后，仍然能被吊销的用户证书添加到证书存储区",
        "各个接口实现厂商自定义该行为"
      ],
      "answer": "A?",
      "analysis": "不确定"
    },
    {
      "id": "3094",
      "title": "在GM/T 0118 《浏览器数字证书应用接口规范》定义的证书存储区中，可以存储以下选项中的（）。",
      "option": [
        "用户证书",
        "根证书",
        "CA中间证书",
        "CRL"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "3096",
      "title": "在GM/T 0118 《浏览器数字证书应用接口规范》中，检查证书状态的方式有（）。",
      "option": [
        "LDAP",
        "CRL",
        "OCSP",
        "未定义获取证书状态的接口"
      ],
      "answer": "ABC",
      "analysis": ""
    },
    {
      "id": "3097",
      "title": "在GM/T 0118 《浏览器数字证书应用接口规范》中， 关于智能密码钥匙的SKF 库（ GM/T  0016- 2012《智能密码钥匙密码应用接口规范》定义的接口库）管理，下列说法正确的是（）。",
      "option": [
        "对于浏览器，只有在智能密码钥匙插入终端设备时，才能将该智能密码钥匙对应的SKF库注册到该浏览器定义的系统环境中",
        "对于浏览器，任何时候都可以将任意一个SKF库注册到该浏览器定义的系统环境中",
        "对于浏览器，最多只能有一个SKF库被注册到该浏览器定义的系统环境中",
        "对于浏览器，可以有任意多个SKF库被注册到该浏览器定义的系统环境中"
      ],
      "answer": "BD",
      "analysis": ""
    },
    {
      "id": "3098",
      "title": "依照GM/T 0118 《浏览器数字证书应用接口规范》的定义，在证书存储区中查找证书时，支持的方式有（）。",
      "option": [
        "按证书序列号查找证书",
        "按用户自定义数据查找证书",
        "可按证书算法类型查找RSA算法证书",
        "可按证书存储区类型、证书用途、颁发者等标志组合查找"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "3116",
      "title": "根据GM/T 0039《密码模块安全检测要求》，关于非入侵式安全，以下属于安全三级密码模块要求的是（）。",
      "option": [
        "如果有相应措施，文档应当包括可以证明每个缓解技术有效性的证据",
        "密码模块应当实现用于保护CSP免受 GM/T 0028附录F中的所有非入侵式攻击的缓解技术",
        "密码模块应当接受测试以满足核准的非入侵式攻击缓解测试指标的要求",
        "文档应当包括可以证明每个环节技术有效性的证据，并提供测试方法"
      ],
      "answer": "ABD",
      "analysis": "（P58）6.8非侵入式安全\nA选项： AY08.5：（安全级别1,2,3,4）\nB选项： AY08.2：（安全级别1,2,3,4）\nC选项： AY08.8：（安全级别4）\nD选项： AY08.7：（安全级别3）"
    },
    {
      "id": "3128",
      "title": "根据GM/T 0039 《密码模块安全检测要求》，关于密码模块物理安全描述正确的是（）。",
      "option": [
        "安全二级增加了拆卸存迹机制的要 求，以及确保无法对模块关键区域的内部操作收集信息的要求",
        "安全三级增加了使用坚固或硬质的保形或不保形外壳的要求，要求外壳的封盖和门具有拆卸检测和响应机制，并且要求抵抗通过开口或入口的直接探测",
        "安全四级要求具备环境失效保护（EFP），以防止错误注入攻击",
        "当密码模块被设计成允许物理访问 时，需要为维护访问接口规定安全要求。拆卸检测和拆卸响应可以代替显式的拆卸证据"
      ],
      "answer": "ABC",
      "analysis": ""
    },
    {
      "id": "3186",
      "title": "GM/T 0084《密码模块物理攻击缓解技术指南》中，以下哪些属于加工技术（）。",
      "option": [
        "手工材料移除",
        "聚能切割",
        "水刀加工",
        "喷砂处理"
      ],
      "answer": "ACD",
      "analysis": ""
    },
    {
      "id": "3194",
      "title": "根据GM/T 0028《密码模块安全技术要求》的要求，以下哪个不属于安全三级的“物理安全”通用要求（）。",
      "option": [
        "产品级部件",
        "拆卸检测和响应封套",
        "防止通过孔和缝进行探测",
        "针对温度和电压的EFP或EFT"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "3262",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》网络和通信安全层面的要求，以下说法不正确的是（）。",
      "option": [
        "网络和通信安全层面主要是针对跨网络访问的通信信 道，这里的跨网络访问包括从不受保护的网络区域访问被测系统",
        "网络和通信安全层面的密码应用要求主要指利用密码技术保护网络通信链路的安全，不涉及其他层次的相关概念",
        "在网络边界部署符合要求的 IPSec VPN或 SSL VPN 设备，是满足网络和通信安全层面要求的通用实现方法",
        "网络和通信安全层面要求对通信过程中的数据，进行区分语义的机密性和完整性保护"
      ],
      "answer": "D",
      "analysis": "网络和通信安全层面不区分语义，是对信道进行加密"
    },
    {
      "id": "3276",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》，对于密码应用第三级信息系统的应急处置，以下说法正确的是（）。",
      "option": [
        "密码应用安全事件发生后，不强制要求向信息系统主管部门或属地密码管理部门进行报告",
        "密码应用安全事件发生后，应及时向信息系统主管部门进行报告",
        "密码应用安全事件发生后，应及时向信息系统主管部门及归属的密码管理部门进行报告",
        "以上都不对"
      ],
      "answer": "B",
      "analysis": "GB/T 39786《信息安全技术 信息系统密码应用基本要求》8.8  应急处置 c)  事件处置完成后，应及时向信息系统主管部门及归属的密码管理部门报告事件发生情况及处置情况。"
    },
    {
      "id": "3298",
      "title": "GB/T 39786《信息安全技术 信息系统密码应用基本要求》中，在应用和数据安全层面的“重要数据传输完整性”一般无法通过部署（）密码设备来实现。",
      "option": [
        "IPSec VPN设备",
        "智能密码钥匙",
        "签名验签服务器",
        "服务器密码机"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "3312",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》，密钥安全管理策略应涵盖（）。",
      "option": [
        "所有密钥的明文数值",
        "密钥种类",
        "各密钥生命周期环节",
        "每个密钥在各生命周期环节的保护策略"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "3315",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》，对于公钥证书的撤销，以下说法正确的是（）。",
      "option": [
        "撤销后的密钥不再具备使用效力",
        "公钥证书撤销后，还需要再对其所含公钥执行撤销",
        "公钥证书到期后，其公钥自然撤销",
        "公钥证书在CRL中出现，即视为已撤销"
      ],
      "answer": "AD",
      "analysis": "密钥撤销\n密钥撤销一般针对公钥证书所对应的密钥。当证书到期后，密钥自然撤销；也可以按需进行密钥撤销，撤销后的密钥不再具备使用效力。\n证书到期自然撤销的是公钥证书对应的密钥，不是公钥自然撤销。"
    },
    {
      "id": "3328",
      "title": "GB/T 39786《信息安全技术 信息系统密码应用基本要求》要求信息系统的相关人员应了解并遵守密码相关法律法规、密码应用安全管理制度，包括（）。",
      "option": [
        "密码法",
        "电子签名法",
        "密码产品操作规程",
        "密码设备配置说明"
      ],
      "answer": "AB",
      "analysis": "密码产品安全管理制度中不包括操作规程和配置说明"
    },
    {
      "id": "3337",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》，可以提供基于非对称密码算法的数字签名功能的密码产品有（）。",
      "option": [
        "密码键盘",
        "签名验签服务器",
        "服务器密码机",
        "智能密码钥匙"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "3338",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》，使用的密码产品需要具备商用密码产品认证证书的信息系统级别是（）。",
      "option": [
        "第一级",
        "第二级",
        "第三级",
        "第四级"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "3342",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》，关于密码服务以下说法错误的是（）。",
      "option": [
        "所有密码应用等级的信息系统，其采用的密码服务均应符合法律法规的相关要求，需依法接受检测认证的，应经商用密码认证机构认证合格",
        "只有三级及以上信息系统，采用的密码服务才应符合法律法规的相关要 求，需依法接受检测认证的，应经商用密码认证机构认证合格。其他密码应用级别的信息系统可以自由选择",
        "只要密码服务所使用的密码产品是具有商密产品认证证书的，则肯定是合规的密码服务",
        "GB/T 39786对信息系统使用的密码服务提任何要求"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "3347",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》，以下属于网络和通信安全层面的安全措施包括（）。",
      "option": [
        "在网络边界部署符合要求的IPSec VPN设备",
        "在网络边界部署符合要求的SSL VPN设备",
        "采用密码产品对边界防护设备的访问控制信息计算 MAC或签名后保存，以保证信息的完整性",
        "采用HTTPS与信息系统建立安全通信通道"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "3388",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》，下列属于采用密码技术实现对用户进行身份鉴别的是（）。",
      "option": [
        "智能密码钥匙",
        "短信验证码",
        "动态令牌",
        "ID卡"
      ],
      "answer": "AC",
      "analysis": ""
    },
    {
      "id": "3392",
      "title": "根据GB/T 39786《信息安全技术信息系统密码应用基本要求》，以下属于应用和数据安全层面安全措施的是（）。",
      "option": [
        "在移动终端上使用协同签名密码模块登录APP后台信息系统",
        "通过安全认证网关对登录用户的身份进行鉴别",
        "在PC客户端上调用智能密码钥匙对数据签名后传输",
        "采用密码产品对边界防护设备的访问控制信息计算 MAC或签名后保存，以保证其完整性"
      ],
      "answer": "ABC",
      "analysis": ""
    },
    {
      "id": "3397",
      "title": "根据GB/T 39786《信息安全技术信息系统密码应用基本要求》，关于应用和数据安全层面保证重要数据传输机密性的说法，不正确的有（）。",
      "option": [
        "若网络和通信安全层面对数据进行加密保护之后，应用和数据安全层面无需再次加密保护",
        "责任单位如果声明信息系统没有重要数据，则密评机构在测评时，直接将相关指标标记为不适用",
        "在网络边界部署符合要求的IPSec VPN/SSL VPN设备，能为数据提供全链路的机密性保护",
        "重要数据传输机密性必须使用非对称加密来实现"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "3404",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》，重要数据传输时在以下（）链路不会在网络和通信安全层面、应用和数据安全层面发生重叠。",
      "option": [
        "发送方客户端到其网络出口IPSec VPN之前",
        "发送方IPSec VPN与接收方IPSec VPN之间",
        "重要数据在ESP协议保护下传输时",
        "接收方网络出口 IPSec VPN到应用服务器"
      ],
      "answer": "AD",
      "analysis": ""
    },
    {
      "id": "3439",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》，由于防火墙是一类网络安全产品，所以对于登录防火墙的管理员用户，不必使用基于密码技术的身份鉴别。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "GB/T39786《信息安全技术信息系统密码应用基本要求》8.8应急处置\n交换机、网闸、防火墙、WAF等未使用密码功能的网络设备、安全设备一般不作设\n备和计算安全层面的测评对象。需要注意若存在管理通道跨越边界的情况，需网络和通信安全层面梳理一条远程管理数据传输通道作为测评对象。\n若具有密码功能则需作为测评对象"
    },
    {
      "id": "3453",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》，在网络边界部署的IPSec VPN或 SSL VPN设备，正确配置后，可以同时保证网络通信过程中数据的完整性和机密性。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "3468",
      "title": "根据GB/T 39786《信息安全技术 信息系统密码应用基本要求》，对于密码应用第三级信息系统，当密码应用安全事件发生后，应及时向信息系统主管部门及归属的密码管理部门进行报告。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "三级要求应急处置后进行报告"
    },
    {
      "id": "3487",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，经核实后发现，某信息系统确实不涉及某项测评指标对应的安全需求，那么这种情形对于以下哪类条款可视为“不适用”（）。",
      "option": [
        "对于“可”的条款",
        "对于“宜”的条款",
        "对于“应”的条款",
        "以上均正确"
      ],
      "answer": "D",
      "analysis": "信息系统确实不涉及某项测评指标对应的安全需求，应、宜、可三类指标应该都可以视为不适用"
    },
    {
      "id": "3493",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，在测评网络和通信安全层面时，如果通信过程采用SSL协议提供保护，经实际抓包后，通常查看握手协议的（）消息，来获取密码套件属性值，进而判定具体使用的密码算法。",
      "option": [
        "Client Hello",
        "Server Hello",
        "Server Hello Done",
        "Server Key Exchange"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "3494",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，在人员管理测评中发现，被测单位设置了密钥管理员、密码安全审计员、密码操作员岗位并定义岗位职责；并对关键岗位采用AB角机制，其中密钥管理员与密码安全审计员互为AB角，这种情况针对“建立密码应用岗位责任制度”测评指标最合适的判定结果是（）。",
      "option": [
        "符合",
        "部分符合",
        "基本符合",
        "不符合"
      ],
      "answer": "B",
      "analysis": "对于第三级系统,核查安全管理制度类文档是否根据密码应用的实际情况,设置密钥管理\n员、密码安全审计员、密码操作员等关键安全岗位并定义岗位职责;核查是否对关键岗位\n建立多人共管机制,并确认密码安全审计员岗位人员是否不兼任密钥管理员、密码操作员\n等关键安全岗位;核查相关设备与系统的管理和使用账号是否有多人共用情况。"
    },
    {
      "id": "3516",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，密评机构在测评某信息系统时，发现移动端用户采用协同签名技术（由经检测认证的密码产品实现）完成应用系统的登录认证。但密评人员查阅密码相关标准后发现，该技术并未以密码相关国家标准或行业标准发布。针对此情形，“密码技术合规性”的判定较为合理的是（）。",
      "option": [
        "部分符合",
        "符合",
        "不符合",
        "不适用"
      ],
      "answer": "B",
      "analysis": "核查系统所使用的密码技术是否以国家标准或行业标准形式发布，或取得国家密码管理部门 同意使用的证明文件。"
    },
    {
      "id": "3518",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，某信息系统涉及2个物理机房。根据密码应用方案和现场测评结果，其中1个物理机房的物理和环境安全层面“身份鉴别”项测评结果为不适用，另1个物理机房符合要求。那么，该系统物理和环境安全层面“身份鉴别”测评单元，最终判定结果为（）。",
      "option": [
        "符合",
        "部分符合",
        "不符合",
        "不适用"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "3521",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，在测评“网络和通信安全层面”时，如果通信过程采用IPSec协议提供保护，经实际抓包后，测评人员通常查看IPSec协议中（  ）阶段的报文数据，来获取密码算法属性值，进而确定具体使用的密码算法并进行结果判定。",
      "option": [
        "IKE",
        "AH",
        "ESP",
        "以上均可"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "3525",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，某信息系统管理员在互联网通过合规的SSL VPN接入系统内网，管理员使用合规的智能密码钥匙登录SSL VPN，并正确启用国密算法，数字证书由合规的CA机构颁发，则网络和通信安全层面的“身份鉴别”指标应判定为（ ）。",
      "option": [
        "符合",
        "部分符合",
        "不符合",
        "无法判定"
      ],
      "answer": "D",
      "analysis": "在确认密码产品具有合格的商用密码产品认证证书，且可以确定实际部署的密码产品与获认证产品一致的情况下，考虑到密码产品功能确定且自身安全防护能力较高，针对整机类密码产品的“系统资源访问控制信息完整性”“日志记录完整性”“重要可执行程序完整性、重要可执行程序来源真实性”这三个设备和计算安全层面的指标，可判定为符合。\n但是，针对整机类密码产品的“身份鉴别”指标不能直接判定为符合，还需要进一步实地查看密码产品是否采用了密码技术（如智能IC卡、智能密码钥匙、动态口令等）对登录设备的用户等进行身份鉴别，从而保证用户身份的真实性。"
    },
    {
      "id": "3526",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，某信息系统基于GMSSL协议使用安全浏览器访 问 堡 垒 机 ， GMSSL 协 议 使 用 了 基 于 SM3WithSM2算法的数字证书，且数字证书由合规的CA机构颁发，则堡垒机的“身份鉴别”指标应判定为（ ）。",
      "option": [
        "符合",
        "部分符合",
        "不符合",
        "无法判定"
      ],
      "answer": "D",
      "analysis": ""
    },
    {
      "id": "3532",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，被测应用系统面向业务用户提供WEB端和 APP端2种访问方式，用户通过WEB端注册后，可使用相同账户名口令登录APP； 当用户使用 WEB浏览器登录应用系统时，通过智能密码钥匙对口令信息进行SM4加密后传输；用户登录手机端APP时，口令明文传输。则在进行应用和数据安全层面“重要数据传输机密性”测评时，口令信息测评结果为（）。",
      "option": [
        "符合",
        "部分符合",
        "不符合",
        "无法判定"
      ],
      "answer": "C",
      "analysis": "针对单个测评对象，如果以上测评实施内容均为是，则该测评对象符合本单元的测评指标要 求；如果c）的3）为否，则不符合本单元的测评指标要求:否则，部分符合本单元的测评指标要 求。针对本测评单元•对该单元涉及的所有测评对象的判定结果进行汇总•如果判定结果均 为符合，则本单元的测评结果为符合；如果判定结果均为不符合，则本单元的测评结果为不符 合；否则，本单元的测评结果为部分符合。"
    },
    {
      "id": "3535",
      "title": "根据GM/T  0115 《信息系统密码应用测评要求》，关于整体测评要求的描述错误的是（ ）。",
      "option": [
        "整体测评是在单元测评结束后执行的环节",
        "存在“等效弥补”",
        "整体测评环节可能涉及测评单元的分数调整",
        "可能涉及单元间、层面间弥补的情形"
      ],
      "answer": "B",
      "analysis": "还有单元间层面间"
    },
    {
      "id": "3536",
      "title": "在测评某信息系统机房时，发现该机房有A和B两个门，其中机房管理员、设备维护和管理等人员通常从A门（使用经检测认证的电子门禁系统）刷门禁卡进入；B门（刷Mifare门禁卡进入）平时几乎不用。按照GM/T 0115《信息系统密码应用测评要求》，物理和环境安全层面“身份鉴别”指标的判定结果，最合适的是（ ）。",
      "option": [
        "符合",
        "部分符合",
        "不符合",
        "不适用"
      ],
      "answer": "C",
      "analysis": "取最低 不符合"
    },
    {
      "id": "3540",
      "title": "某网上银行信息系统，网银用户持有银行配发的智能密码钥匙，在交易时，用户使用智能密码钥匙对交易信息进行SM9数字签名，网银服务端收到后调用签名验签服务器完成验签。上述密码运算均在密码产品中完成，密码产品均经过检测认证。依据GM/T 0115《信息系统密码应用测评要求》，则“不可否认性”最合适的判定结果是（）。",
      "option": [
        "符合",
        "部分符合",
        "不符合",
        "不确定"
      ],
      "answer": "C",
      "analysis": "1） 核查是否符合5.1和5.2的要求。\n2） 核查是否符合5.2,5.3和5.4的要求。\n3） 核查应用系统是否采用基于公钥密码算法的数字签名机制等密码技术对数据原发行为和 接收行为实现不可否认性，并验证不可否认性实现机制是否正确和有效。"
    },
    {
      "id": "3545",
      "title": "密评人员在测评时发现被测系统调用服务器密码机，对堡垒机的访问控制信息进行完整性保护，并获取了堡垒机访问控制信息的完整性校验值为：0x1073f2a58ae7e43550bc1c11f4cd2899，其长度为128比特，以下说法错误的是（ ）。",
      "option": [
        "一定未采用HMAC- SM3算法对堡垒机访问控制信息进行完整性保护",
        "可能采用了HMAC- SM3算法对堡垒机访问控制信息进行完整性保护",
        "可能采用了HMAC- MD5算法对堡垒机访问控制信息进行完整性保护",
        "可能采用了基于SM4-CBC的MAC算法对堡垒机访问控制信息进行完整性保护"
      ],
      "answer": "A",
      "analysis": "SM3  256"
    },
    {
      "id": "3551",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，某应用系统面向业务用户提供WEB端和APP端2种访问方式，在WEB端，用户浏览器与应用系统服务端采用国密SSL协议（ 国密浏览器实现）保障通信数据机密性，APP客户端与应用系统服务端之间采用HTTP协议传输，经核查发现应用系统用户鉴别数据均以明文方式传输，经整体测评后，鉴别数据在应用和数据安全层面“重要数据传输机密性”指标的测评结果最可能为（）。",
      "option": [
        "符合",
        "部分符合",
        "不符合",
        "无法判定"
      ],
      "answer": "C",
      "analysis": "应用层的传输数据为不符合，虽然WEB端网络层可以弥补应用层，但是在单独的应用层结果判定中为不符合，赋分的时候是弥补后的分数"
    },
    {
      "id": "3552",
      "title": "在对应用和数据安全层面中的“重要数据存储机密性”指标测评时，采用以下（ ）密码技术可能被判定为“部分符合”。",
      "option": [
        "采用SM3算法对业务数据计算杂凑值后存储",
        "采用DES算法对重要业务数据加密后存储",
        "采用SM4-ECB模式对所有用户性别信息项进行加密后存储",
        "使用RSA算法对个人敏感信息加密后存储"
      ],
      "answer": "D",
      "analysis": "核查应用系统是否采用密码技术的加解密功能对重要数据在存储过程中进行机密性保 护，并验证存储数据机密性保护机制是否正确和有效A:不符合（杂凑算法无加解密功能，未满足业务需求）B:不符合（不安全，且不是国密算法）C：符合D:部分符合（未使用国密算法）"
    },
    {
      "id": "3553",
      "title": "应用和数据安全层面测评时，发现被测应用系统采用SM3算法对口令计算杂凑值后传输和存储，且客户端调用了经商用密码认证机构认证合格的智能密码钥匙生成MAC，则“身份鉴别”指标判定结果为（）。",
      "option": [
        "符合",
        "部分符合",
        "不符合",
        "无法判定"
      ],
      "answer": "C",
      "analysis": "算法有效性不满足"
    },
    {
      "id": "3558",
      "title": "在对应急处置层面“应急策略”指标测评时发现，某第三级信息系统制定了符合网络安全等级保护基本要求的应急预案，预案中明确了网络安全事件发生时的应急处理流程、系统恢复流程及其他管理措施，具有事件处置记录模板，但应急预案未涵盖密码应用安全相关事件且信息系统尚未发生密码应用安全事件。依据GM/T 0115《信息系统密码应用测评要求》,本指标判定结果最合适的是（  ）。",
      "option": [
        "符合",
        "部分符合",
        "不符合",
        "无法判定"
      ],
      "answer": "B",
      "analysis": "1）对于第一级系统，核查用户是否根据密码产品提供的安全策略处置密码应用安全事件。\n2） 对于第二级系统，核查是否根据密码应用安全事件等级制定了相应的密码应用应急策略 并对应急策略进行评审，应急策略中是否明确了密码应用安全事件发生时的应急处理流 程及其他管理措施，并遵照执行;若发生过密码应用安全事件，核查是否具有相应的处置 记录。\n3） 对于第三级到第四级系统，核查是否根据密码应用安全事件等级制定了相应的密码应用 应急策略并对应急策略进行评审，应急策略中是否明确了密码应用安全事件发生时的应 急处理流程及其他管理措施，并遵照执行；若发生过密码应用安全事件，核查是否立即启 动应急处置措施并具有相应的处置记录。"
    },
    {
      "id": "3567",
      "title": "GM/T 0115《信息系统密码应用测评要求》中，不单独判定符合性的测评单元有以下哪些（）。",
      "option": [
        "密码算法合规性",
        "密码产品合规性",
        "身份鉴别",
        "密钥管理有效性"
      ],
      "answer": "AB",
      "analysis": "本单元测评指标不单独判定符合性。"
    },
    {
      "id": "3575",
      "title": "根据GM/T  0115 《信息系统密码应用测评要求》，采用下列哪些鉴别技术，物理机房电子门禁系统的“身份鉴别”指标可以判定为“符合”（）。",
      "option": [
        "动态口令",
        "基于对称密码算法或密码杂凑算法的消息鉴别码（MAC）机制",
        "基于公钥密码算法的数字签名机制",
        "指纹识别"
      ],
      "answer": "ABC",
      "analysis": "核查电子门禁系统是否采用动态口令机制、基于对称密码算法或密码杂凑算法的消息鉴 别码（MAC）机制、基于公钥密码算法的数字签名机制等密码技术对重要区域进入人员进 行身份鉴别，并验证进入人员身份真实性实现机制是否正确和有效。"
    },
    {
      "id": "3580",
      "title": "根据GM/T  0115 《信息系统密码应用测评要求》，下列关于网络和通信安全层面“身份鉴别”测评指标的测评过程描述哪些是正确的（）。",
      "option": [
        "通过访谈，了解采用了哪种通信实体身份鉴别实现机制",
        "核查并验证身份鉴别机制是否正确有效",
        "核查采用的密码算法和密码技术是否合规",
        "核查采用的密钥管理措施是否安全"
      ],
      "answer": "ABCD",
      "analysis": "1） 核查是否符合5.1和5.2的要求。\n2） 核查是否符合5.2,5.3和5.4的要求。\n3） 核查是否采用基于对称密码算法或密码杂凑算法的消息鉴别码（MAC）机制、基于公钥密 码算法的数字签名机制等密码技术对通信实体进行身份鉴别（第一级到第三级）/双向身 份鉴别（第四级），并验证通信实体身份真实性实现机制是否正确和有效。"
    },
    {
      "id": "3589",
      "title": "某信息系统部署于两个自建机房，机房之间通过光纤连接，启用防火墙的IPSec VPN对机房之间的业务流量进行保护，通过服务器密码机对应用服务器的日志记录进行完整性保护。根据GM/T 0115《信息系统密码应用测评要求》，以下作为设备和计算安全层面测评对象的是（）。",
      "option": [
        "应用服务器",
        "服务器密码机",
        "光纤连接器",
        "防火墙"
      ],
      "answer": "ABD",
      "analysis": "AB没问题，C光纤连接器没有密码功能，D的防火墙不清楚IPSecVPN属不属于防火墙，根据题意\"防火墙的IPSec VPN对....\"，那防火墙是有IPSec VPN功能的，那其就有密码功能，就应该算账设备中"
    },
    {
      "id": "3598",
      "title": "根据GM/T  0115 《信息系统密码应用测评要求》，关于设备和计算安全层面“日志记录完整性”测评指标，以下属于该项密钥管理核查内容的是（）。",
      "option": [
        "若密钥管理使用的密码产品符合密码模块相关标准，则核查相关密码产品是否满足密码模块相应安全等级及以上安全要求",
        "核查密钥管理安全性实现技术是否正确有效",
        "核查日志记录是否进行备份以及备份机制是否合理",
        "核查相关密码产品是否按照产品配套的安全策略文档进行部署和使用"
      ],
      "answer": "ABD",
      "analysis": "密钥管理参照章节5.3,5.4,5.5无需考虑日志备份"
    },
    {
      "id": "3606",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，下列可能作为应用和数据安全层面“重要数据存储完整性”测评指标具体测评对象的是（）。",
      "option": [
        "鉴别数据",
        "访问控制信息",
        "重要业务数据",
        "用户操作日志"
      ],
      "answer": "ACD",
      "analysis": "白皮书P480"
    },
    {
      "id": "3617",
      "title": "根据GM/T 0115《信息系统密码应用测评要求》附录B，在密评中对动态口令系统可采用以下哪些测评技术（）。",
      "option": [
        "尝试对动态口令进行重放，以确认重放后的口令无法通过认证系统的验证",
        "条件允许情况下，确认种子密钥以密文形式导入至认证系统中",
        "条件允许情况下，在动态口令计算完成后，确认明文种子密钥不会留存在认证系统中",
        "判断动态令牌的PIN码保护机制是否符合相关密码产品技术标准要求，例如 PIN码长度、输入错误次数限制"
      ],
      "answer": "ABCD",
      "analysis": "原文没看见C选项"
    },
    {
      "id": "3621",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，对网上银行系统进行测评时，客户端与其后台系统进行通信过程中，使用下列哪些密码套件可以判定“密码算法合规性”“密码技术合规性”这两项为“符合”（）。（假定通信两端所采用的密码产品均经过检测认证）",
      "option": [
        "ECC_SM4_SM3",
        "RSA_SM4_SM3",
        "ECDHE_SM4_SM3",
        "RSA_AES256_SHA3 84"
      ],
      "answer": "AC",
      "analysis": "B、D使用RSA算法作为通信实体身份鉴别的算法，算法合规性存在问题"
    },
    {
      "id": "3622",
      "title": "某应用系统部署在单位内网服务器区，内部办公区用户通过局域网访问应用系统，外部用户通过互联网访问应用系统，运维管理员可以从互联网先登录运维SSL VPN网关后，再通过SSL VPN网关堡垒机对服务器、密码产品等设备进行运维，也可以从机房内的运维终端直接通过管理网对设备进行运维。依据GM/T 0115《信息系统密码应用测评要求》，下面哪些通信信道可作为网络和通信安全的测评对象（）。",
      "option": [
        "内部办公区用户终端与应用系统之间的通信信道",
        "外部互联网用户终端与应用系统之间的通信信道",
        "机房内的运维终端与被管理设备之间的通信信道",
        "互联网运维管理员终端与SSL VPN之间的通信信道"
      ],
      "answer": "ABD",
      "analysis": "BD跨越了网络边界"
    },
    {
      "id": "3627",
      "title": "某信息系统部署了同一生产厂商的4台应用服务器，其中，2台型号为A，操作系统版本分别为 C，2台型号为D，操作系统版本分别为E、F；2台服务器密码机（商用密码产品认证证书编号分别为GMxxx、GMyyy）；以下关于设备和计算安全层面测评对象选取的做法中，错误的是（）。",
      "option": [
        "从4台应用服务器抽选1台作为测评对 象，从2台服务器密码机抽选1台作为测评对象",
        "从不同型号的应用服务器分别抽选1台作为测评对象，2台服务器密码机分别作为测评对象",
        "4台应用服务器分别作为测评对象，2台服务器密码机也分别作为测评对象",
        "从不同操作系统版本的应用服务器抽选1台作为测评对 象，2台服务器密码机分别作为测评对象"
      ],
      "answer": "ABD",
      "analysis": "同型号、同版本、同证书"
    },
    {
      "id": "3632",
      "title": "根据GM/T  0115 《信息系统密码应用测评要求》，在对应用和数据安全层面中的“身份鉴别”指标测评时，应用系统采用以下（）密码技术可能被判定为“符合”或“部分符合”。",
      "option": [
        "采用SM4算法生成动态口令",
        "基于MD5的RSA- 2048数字签名",
        "SM3-HMAC",
        "基于SHA-256的SM2数字签名"
      ],
      "answer": "ABCD",
      "analysis": "SHA1 MD5不安全，为不符合。"
    },
    {
      "id": "3636",
      "title": "根据GM/T  0115 《信息系统密码应用测评要求》，应用和数据安全层面“重要数据传输机密性”的测评实施要点描述正确的是（）。",
      "option": [
        "依据GM/T 0115《信息系统密码应用测评要求》，还会进行通用测评要求的核查",
        "利用协议分析工 具，分析传输的重要数据是否为密 文，数据格式（如分组长度等）是否符合预期",
        "使用密码算法合规性验证工具对抓取的密文数据进行验签，并与明文进行对比，以验证密码算法是否与声称的一致",
        "如采用IPSec协议保障数据传输安全，利用协议分析工具捕获并分析握手阶段Server hello消息数据包"
      ],
      "answer": "AB",
      "analysis": "C是完整性。D选项IPSec协议无Server hello消息"
    },
    {
      "id": "3640",
      "title": "根据GM/T  0115 《信息系统密码应用测评要求》，应用和数据安全层面“重要数据传输完整性”的测评实施要点包括（）。",
      "option": [
        "该测评单元的实施项中第一条和第二条涉及通用测评要求的密码算法合规性、密码技术合规性、密码产品合规性和密码服务合规性四个方面",
        "利用协议分析工 具，分析受完整性保护的数据在传输时的数据格式（如签名长度、MAC长度）是否符合预期",
        "如果使用数字签名技术进行完整性保护，可使用公钥对抓取的签名结果进行验证",
        "如果以外接服务器密码机等密码产品的形式实现，需要核实密码产品是否如实被调用"
      ],
      "answer": "BCD",
      "analysis": "0115原文第一一条和第二条分别对应5.1-5.4的要求，BCD都是附录原文。"
    },
    {
      "id": "3642",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，在云平台测评中，下列哪些资产有可能作为应用和数据安全层面的测评对象（）。",
      "option": [
        "云资源管理系统",
        "密码服务平台",
        "云上应用",
        "统一身份认证平台"
      ],
      "answer": "ABD",
      "analysis": "无原文只能通过P437和P435分析，这几道都是综合题 和书上有出入。"
    },
    {
      "id": "3643",
      "title": "车联网OTA（在线升级）业务场景中，智能网联汽车首先接入某运营商网络，然后与OTA云平台（云上应用系统）建立网络通信信道，下载OTA升级包到车端以完成软固件升级工作。根据上述所描述的OTA升级场景，依据GM/T 0115《信息系统密码应用测评要求》，密评时的关注点有以下哪些（）",
      "option": [
        "OTA平台与智能网联汽车的网络通信实体鉴别",
        "OTA升级包从车企到OTA平台的重要数据传输完整性保护",
        "车端下载的OTA升级包的来源真实性和传输完整性",
        "智能网联汽车接入运营商网络的安全认证"
      ],
      "answer": "ABC",
      "analysis": "接入运营网络的的安全认证，属于手机卡与移动通信网之间的认证。与具体业务无关。"
    },
    {
      "id": "3645",
      "title": "根据GM/T 0115《信息系统密码应用测评要求》附录C，在密评中对“传输完整性”的测评技术，下列描述正确的是（）。",
      "option": [
        "若该密码功能采用HMAC-SM3实现，可利用协议分析工具捕获受完整性保护的数据在传输过程中的数据包，并进一步分析MAC长度是否为256比特或更短",
        "若该密码功能采用HMAC-SHA1实现，可利用协议分析工具捕获受完整性保护的数据在传输过程中的数据包，并进一步分析MAC长度是否为128",
        "若该密码功能采用基于SM2数字签名技术实现，可利用协议分析工具捕获受完整性保护的数据在传输过程中的数据包，并进一步分析签名值长度是否为512比特",
        "若该密码功能采用基于SM2数字签名技术实现，可使用给相应签名证书签发的CA的公钥对签名结果进行签名验证"
      ],
      "answer": "AC",
      "analysis": "B为160比特。D采用签名证书的公钥对签名值验签。"
    },
    {
      "id": "3647",
      "title": "根据GM/T  0115 《信息系统密码应用测评要求》，针对网络和通信安全层面“通信数据完整性”指标的测评，下列哪些说法是正确的（）。",
      "option": [
        "通过验证测试发 现，可以使用工具修改请求数据包的内容得到想要的响应，因此判断本通信信道不能保证通信数据完整性",
        "通过验证测试发 现，无法修改请求数据包，但可以进行重放攻击，因此判断本通信信道不能保证通信数据完整性",
        "通过对SSL握手阶段的抓包分析，使用的密码套件中算法全部为国密算法，但依然无法判断本通信信道是否可以保证通信数据完整性",
        "通过对SSL握手阶段的抓包分析，获得的服务端的SM2签名证书为可信第三方 CA机构颁发的，因此判断本通信信道能保证通信数据完整性"
      ],
      "answer": "AC",
      "analysis": "B中重放攻击不能判断数据完整性有无保护，重放攻击主要针对数据发送者身份的真实性；D、SSL信道中SM2签名主要是针对通信实体身份真实性，不是针对通信数据完整性。"
    },
    {
      "id": "3649",
      "title": "根据GM/T  0115 《信息系统密码应用测评要求》，针对网络和通信安全层面“网络边界访问控制信息的完整性”指标的测评，下列哪些说法是正确的（）。",
      "option": [
        "某通信信道使用 IPSec VPN 进行网络边界访问控制， IPSec VPN 获得了商用密码产品认证证书，通过IPSec VPN自身的安全机制可以保证访问控制信息的完整性",
        "某通信信道通过防火墙进行网络边界访问控制，采用服务器密码机对访问控制信息计算MAC后保存， 服务器密码机获得了商用密码产品认证证书，因此可以实现网络边界访问控制信息的完整性保护",
        "某通信信道通过边界路由进行网络边界访问控制，并采用自实现的HMAC- SM3对访问控制信息计算MAC后保存，因此可以实现网络边界访问控制信息的完整性保护",
        "通过核查发现，某网络边界设备的访问控制信息采用 SM4-ECB算法加密后保存在硬盘中，因此可以判断该设备能够保证访问控制信息的完整性"
      ],
      "answer": "AB",
      "analysis": ""
    },
    {
      "id": "3657",
      "title": "GM/T 0137《信息系统密码应用测评要求》，某涉及法律责任认定的应用系统采用电子签章系统实现重要行为的不可否认性，在进行应用和数据安全层面“不可否认性”第三级指标测评时，测评要点包括但不限于（）。",
      "option": [
        "核查电子签章系统是否具有商用密码产品认证证书，且密码模块安全等级为二级及以上",
        "核查电子印章载体是否合规",
        "核查制章人和签章人数字证书格式、签名算法标识和颁发机构",
        "核查电子印章的验证、电子签章的生成和验证是否符合 GB/T 38540的要求"
      ],
      "answer": "BCD",
      "analysis": "检查电子印章和电子签章是否合规"
    },
    {
      "id": "3658",
      "title": "某信息系统部署了经检测认证的签名验签服务器，且密码模块达到了相应等级要求，关于设备和计算安全层面应用服务器“系统资源访问控制信息完整性”测评项，依据GM/T 0115《信息系统密码应用测评要求》，以下判定结果错误的是（）。",
      "option": [
        "通过调用签名验签服务器的AES-128 ECB模式加密接口，对访问控制信息加密，取最后一组分组密文作为MAC并存储，值为A；在验证完整性时，调用签名验签服务器的 AES-128 ECB模式加密接口，对访问控制信息加密，取最后一组分组密文作为MAC，值为B，比对A与B是否一致；基于上述措施，测评人员判定为部分符合",
        "通过调用签名验签服务器的SM4 CBC- MAC接口，对访问控制信息计算MAC并存储，值为A；在验证完整性时，调用签名验签服务器 SM4 CBC-MAC接口，对访问控制信息计算MAC，值为 B，比对A与B是否一致；其中，计算 SM4 CBC-MAC使用的初始向量为符合密码相关国家和行业标准的随机数；基于上述措施，测评人员判定为符合",
        "通过调用签名验签服务器的SM3接口，计算访问控制信息的杂凑值并存储，值为A；在验证完整性时，调用签名验签服务器SM3接口，计算访问控制信息的杂凑值，值为B，比对A与B是否一致；基于上述措 施，测评人员判定为不符合",
        "通过调用签名验签服务器的HMAC- SHA256接口，对访问控制信息计算 MAC并存储，值为 A；在验证完整性 时，将访问控制信息与A拼接，并调用签名验签服务器 HMAC-SHA256接口，对拼接数据计算MAC，值为B，比对A与B是否一致；基于上述措施，测评人员判定为部分符合"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "3659",
      "title": "某信息系统在国密改造实施技术文档中标明，采用SM2签名验签的机制对应用服务器日志记录进行完整性保护，并采用HMAC-SM3算法对系统资源访问控制信息进行完整性保护，两名密码操作员可使用智能密码钥匙登录签名验签服务器，依据GM/T 0115《信息系统密码应用测评要求》，以下关于测评人员在测评实施中，属于错误判定的是（）。",
      "option": [
        "测评人员经核查发现，系统实际存储 SM2签名的字段值长度为256位，因此判定日志记录完整性保护可能未使用SM2签名验签机制",
        "测评人员经核查发现，系统实际存储 HMAC-SM3的字段值长度为128位，因此判定系统资源访问控制信息完整性保护使用的不是 HMAC-SM3算法",
        "测评人员经核查发现，智能密码钥匙设置的口令长度不小于6个字符，使用错误口令登录的次数限制不超过10次，因此判定智能密钥钥匙的口令相关设置不符合GM/T 0027的要求",
        "测评人员经核查发现，两名密码操作员都使用了合规CA机构签发的同一张数字证书，证书在有效期内，且进行了证书的有效性验证，因此判定数字证书的签发和使用符合密评相关标准要求"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "3660",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，以下关于测评人员在设备和计算安全层面测评实施过程中，正确的是（）。",
      "option": [
        "某信息系统访问堡垒机管理应用的远程管理通道使用了 HTTPS协议，算法套件为 TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA；测评人员判定用于通信数据完整性保护的算法为CBC-MAC-AES- 256",
        "某信息系统访问堡垒机管理应用的远程管理通道使用了 HTTPS协议，测评人员经核查发现 HTTPS数字证书在有效期内，并使用该证书内的公钥对证书签名值进行验签，验签不通过；测评人员判定该证书为无效证书",
        "某信息系统管理员在互联网直接访问堡垒机对设备进行管理；测评人员将访问堡垒机的通信信道作为设备和计算安全层面“远程管理通道安全”的测评对象",
        "某信息系统部署和使用了2台SSL VPN网关，商用密码产品认证证书编号分别为GMxxx、 GMyyy;测评人员将2台SSL VPN网关分别作为设备和计算安全层面的两个测评对象"
      ],
      "answer": "CD",
      "analysis": ""
    },
    {
      "id": "3662",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，以下关于设备和计算安全层面“身份鉴别”测评项的判定，错误的是（）。",
      "option": [
        "某信息系统管理员使用用户名+口令或使用经检测认证的智能密码钥匙（密码模块达到相应等级要求）登录签名验签服务器，口令使用加盐SHA256算法进行传输和存储保护，测评人员判定签名验签服务器“身份鉴别”测评项为部分符合",
        "某信息系统管理员使用经检测认证的智能密码钥匙（密码模块达到相应等级要求）登录堡垒机，身份鉴别机制符合GB/T 15843标准要求，测评人员判定堡垒机“身份鉴别”测评项一定为符合",
        "某信息系统管理员使用智能密码钥匙登录堡垒机，测评人员发现智能密码钥匙换发的商用密码产品认证证书中未标注密码模块安全等级，测评人员判定智能密码钥匙仅符合一级密码模块要求",
        "某信息系统管理员使用动态令牌登录堡垒机，测评人员经核查发现，动态令牌设置的PIN码长度不少于6位数字， PIN码尝试次数最大不可超过8次；测评人员判定PIN码相关设置不符合GB/T 38556的要求"
      ],
      "answer": "ABC",
      "analysis": "C未查型号证书,D使用错误口令登录的次数限制不超过10次"
    },
    {
      "id": "3663",
      "title": "某信息系统管理员使用智能密码钥匙登录签名验签服务器，对管理员进行身份鉴别，身份鉴别机制采用数字签名技术，并基于“挑战-响应”鉴别机制。依据GM/T 0115《信息系统密码应用测评要求》，在上述场景下，以下关于该机制的实现方式，错误的是（）。",
      "option": [
        "通过智能密码钥匙产生随机数，并检验该随机数来保证唯一性和时效性",
        "智能密码钥匙产生并向签名验签服务器发送Token",
        "签名验签服务器产生的挑战值“随机数”未包含在Token签名数据中",
        "由智能密码钥匙解密私钥对签名数据进行签名，并由签名验签服务器验签"
      ],
      "answer": "ACD",
      "analysis": "不应该是解密私钥进行签名，而是签名私钥。"
    },
    {
      "id": "3668",
      "title": "某信息系统应用服务器通过调用最新版OpenSSL密码算法库的HMAC-SM3接口对日志记录计算 MAC，依据GM/T 0115《信息系统密码应用测评要求》，以下哪些HMAC-SM3算法输出长度，使设备和计算安全“日志记录完整性”指标可能是“部分符合”的判定结果（）。",
      "option": [
        "128比特",
        "256比特",
        "384比特",
        "512比特"
      ],
      "answer": "AB",
      "analysis": "128可能是MD5"
    },
    {
      "id": "3669",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，关于设备和计算安全层面的判定结果，以下说法正确的是（）。",
      "option": [
        "某三级信息系统，采用经检测认证的服务器密码机，其密码模块等级为二级，调用其SM4- CBC模式的加密算法接口，对应用服务器的日志记录进行加密，测评人员判定该应用服务器“日志记录完整性”为不符合",
        "某二级信息系统，采用经检测认证的签名验签服务器，其密码模块等级为一级，调用其SM3算法接口，对应用服务器的系统资源访问控制信息进行杂凑运算，测评人员判定该应用服务器“系统资源访问控制信息完整性”为不符合",
        "某信息系统采用智能密码钥匙登录签名验签服务器，智能密码钥匙和签名验签服务器均经过检测认证，密码模块均达到了相应等级安全要求，并采用了符合GB/T 15843标准要求的身份鉴别机制，测评人员判定该签名验签服务器“身份鉴别”为符合",
        "某三级信息系统部署了经检测认证的服务器密码机，其密码模块等级为二级，测评人员判定服务器密码机“身份鉴别”为符合"
      ],
      "answer": "ABC",
      "analysis": "SM3-MAC保证完整性，SM4-CBC也可以"
    },
    {
      "id": "3672",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，某业务应用系统在身份鉴别和不可否认性实现方面采用了数字证书，数字证书由经商用密码认证机构认证合格的证书认证系统签发，则密评人员在测评实施时需要（）。",
      "option": [
        "参考GM/T 0037和 GM/T 0038的要求核查证书认证系统部署是否正确、合规",
        "核查证书扩展项 KeyUsage字段，确定是否符合双证书体系要求，并验证证书及其相关私钥是否正确使用",
        "核查Signature、 Issuer等字段是否符合预期",
        "通过数字证书格式合规性检测工具，验证证书格式是否符合GB/T 20518的有关要求"
      ],
      "answer": "ABCD",
      "analysis": " 不确定 附录B里面没提到C选项，但检测不可否认性的时候如果使用数字签名是需要检测签名结果"
    },
    {
      "id": "3674",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，对物联网平台开展应用和数据安全层面测评时，根据其密码应用需求，需要针对下列哪些环节进行“身份鉴别”指标测评（）。",
      "option": [
        "物联网终端接入",
        "管理系统业务用户登录",
        "管理系统运维用户登录",
        "对感知节点设备上的软件应用进行配置或变更"
      ],
      "answer": "BC",
      "analysis": "终端接入不属于应用层面。"
    },
    {
      "id": "3691",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，某三级信息系统，经核查和验证，网络通信信道采用了具有商用密码产品认证证书的SSL VPN 设备， SSL 协议使用的密码算法套件为 ECC_SM4_SM3，因此判定该网络信道符合“通信数据完整性”和“通信过程中重要数据机密性”测评指标的要求。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "（不确定）三级不需要双向认证，可以使用ECC。 但这题没说使用几级产品 很怪"
    },
    {
      "id": "3692",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，在对“网络和通信安全”层面测评时，如果网络边界的访问控制信息存储在具有商用密码产品认证证书的VPN类设备中，则针对该层面“网络边界访问控制信息的完整性”指标可直接判定为“符合”。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "在网络和通信安全层面，要求为“采用密码技术保证网络边界访问控制信息的完整性”， 强调的是网络边界。因此在该层面中，访问控制信息主要包括部署在网络边界的VPN中的访 问控制列表、防火墙的访问控制列表、边界路由的访问控制列表等进行网络边界访问控制的 信息。"
    },
    {
      "id": "3701",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，某信息系统通过堡垒机对设备进行集中运维管理，管理员使用合规的智能密码钥匙登录堡垒机，采用基于国密算法的数字签名机制进行身份鉴别，若堡垒机服务端的验签未采用经商用密码检测认证合格的密码产品实现，则堡垒机的“身份鉴别”指标应判为部分符合。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "3721",
      "title": "GM/T 0115《信息系统密码应用测评要求》中的风险分析和评价针对单元测评结果中产生的不符合项和部分符合项进行的。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "具体来说，测评人员要根据威胁类型和威胁发生频率，判断测评结果汇总中部分符合项 或不符合项所产生的安全问题被威胁利用的可能性；根据资产价值的高低，判断测评结果汇总 中部分符合项或不符合项所产生的安全问题被威胁利用后，对被测系统的业务信息安全造成的 影响程度；综合前两者的结果，测评机构根据自身经验和相关国家标准要求，对被测系统面临 的安全风险进行赋值（例如，高、中、低）。如果存在高风险项，则认为信息系统面临高风险； 同时也需要考虑多个中低风险叠加可能导致的高风险问题。存在高风险的信息系统不能通过密 码应用安全性评估。"
    },
    {
      "id": "3723",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，对于三级信息系统，网络和通信安全层面“安全接入认证”指标，信息系统责任方可自行决定是否将其纳入标准符合性测评范围。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "3730",
      "title": "依据GM/T  0115 《信息系统密码应用测评要求》，进行安全管理制度测评时，应核查各项安全管理制度是否包括密码人员管理、密钥管理、建设运行、应急处置、设备软硬件及介质管理等制度。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "基本是原文"
    },
    {
      "id": "3738",
      "title": "应用和数据安全层面测评时，经核查发现应用系统客户端调用智能密码钥匙对重要业务数据进行 SM4加密和计算SM3杂凑值后传输，服务端调用服务器密码机进行SM4解密并校验SM3杂凑值，重要业务数据无其他传输场景，则可判定重要业务数据符合本层面“重要数据传输机密性”和“重要数据传输完整性”测评指标。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "使用HMAC实现完整性"
    },
    {
      "id": "3746",
      "title": "测评人员在对某三级信息系统的网络和通信安全层面抓包分析时发现，通信过程中IPSec协议通信双方均发送其签名证书和加密证书，双证书分别用于身份鉴别和会话加密。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "3747",
      "title": "根据GM/T  0115 《信息系统密码应用测评要求》，对于三级信息系统，密钥管理员、密码安全审计员、密码操作员应由本机构的内部员工担任，并必须在任前对其进行背景调查。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "四级系统才必须人员背景调查,三级系统没有强制要求"
    },
    {
      "id": "3759",
      "title": "某云管平台面向云管理员提供云资源统一调度、统一管理等功能，面向云租户提供资源实例的申请开通、资源实例的操作等功能。在对该云管平台进行应用和数据安全层面“身份鉴别”指标测评时，只需要核查云管理员用户的身份鉴别机制，云租户用户的身份鉴别机制应在云租户信息系统密评时核实。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "参考FAQ22项"
    },
    {
      "id": "3761",
      "title": "在对应用和数据安全层面“身份鉴别”指标测评时发现，应用系统业务用户采用了具有商用密码产品认证证书（证书在有效期内）的智能密码钥匙进行用户登录身份鉴别，具体为智能密码钥匙与用户身份ID绑定，应用通过读取智能密码钥匙中存储的用户ID做身份鉴别，则针对应用用户“身份鉴别”指标的测评结果至少为“部分符合”。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "比对的ID 没用密码技术"
    },
    {
      "id": "3780",
      "title": "根据GM/T 0116《信息系统密码应用测评过程指南》，在密评工作方案编制活动中，关于被测信息系统的核心资产确定，以下说法不正确的是（）。",
      "option": [
        "核心资产及其他需要保护的配套数据、敏感安全参数的威胁模型和安全策略等均由被测单位自主确定。",
        "测评方需要多对信息系统的核心资产进行核查和确认。",
        "核心资产可以是业务应用、业务数据或者业务应用的某些设备、组件。",
        "被测单位需要确定被测信息系统需要保护的核心资产，以及相应的威胁模型和安全策略。"
      ],
      "answer": "A",
      "analysis": "核心资产可以是业务应用、业务数据或者业务应用的某些设备、组件。核心资产及其他需要保护的配套数据(如审计信息、配置信息、访问控制列表等)、敏感安全参数(主要指密钥)的威胁模型和安全策略等均由被测单位根密码应用方案、网络安全等级保护定级报告等确定，并由测评方进行核查和确认。"
    },
    {
      "id": "3818",
      "title": "根据GM/T 0116《信息系统密码应用测评过程指南》，在测评准备阶段进行是信息收集和分析的过程中，测评方可以使用（   ）等方式，了解被测信息系统的构成和密码应用情况，为编写密评方案和开展现场测评工作奠定基础。",
      "option": [
        "填写调查表格",
        "查阅资料",
        "现场调查",
        "预测试"
      ],
      "answer": "AB",
      "analysis": "答案应该为AB。不包括现场调查。\n5.2.2信息收集和分析\n测评方使用调查表格、查阅被测信息系统资料等方式,了解被测信息系统的构成和密码应用情况，为编写密评方案和开展现场测评工作奠定基础。\n"
    },
    {
      "id": "3819",
      "title": "根据GM/T 0116《信息系统密码应用测评过程指南》，在测评准备阶段进行是信息收集和分析的过程中，测评方收集测评所需资料包括（ ）。",
      "option": [
        "被测信息系统总体描述文件、 密码应用总体描述文件",
        "网络安全等级保护定级报告、网络安全等级保护测评报告",
        "安全总体方案、安全详细设计方案、密码应用方案",
        "密码产品的用户操作指南、密码应用安全规章制度"
      ],
      "answer": "ACD",
      "analysis": "标准原话，参考3820题解析：收集信息未描述网络安全等级保护测评报告。"
    },
    {
      "id": "3820",
      "title": "根据GM/T 0116《信息系统密码应用测评过程指南》，以下哪些材料为测评方需要收集的（ ）。",
      "option": [
        "被测信息系统总体描述文件",
        "被测信息系统密码应用总体描述文件",
        "被测系统密码应用方案",
        "等级保护定级报告及等级测评报告"
      ],
      "answer": "ABC",
      "analysis": "测评方收集测评所需资料，包括被测信息系统总体描述文件、被测信息系统密码应用总体描述文件、网络安全等级保护定级报告、安全需求分析报告、安全总体方案、安全详细设计方案、密码应用方案、相关密码产品的用户操作指南、各种密码应用安全规章制度，以及相关过程管理记录和配置管理文档等。"
    },
    {
      "id": "3843",
      "title": "根据GM/T 0116《信息系统密码应用测评过程指南》，密评人员在对关键设备进行现场检查时，若测评工具接入被测信息系统条件不成熟时。以下测评操作，不正确的是（ ）。",
      "option": [
        "自行模拟被测信息系统搭建测评环境获取测评数据",
        "与被测单位协商、配合，生成必要的离线数据",
        "告知被测单位风险后，接入被测系统获取真实数据",
        "将该测评项做不适用处理"
      ],
      "answer": "ACD",
      "analysis": ""
    },
    {
      "id": "3855",
      "title": "根据GM/T 0116《信息系统密码应用测评过程指南》，关于资产和威胁评估，说法正确的是（）。",
      "option": [
        "资产价值的认定，是依据资产价格来决定",
        "资产价值越高表明资产遭到威胁时将导致越高的风险",
        "威胁发生频率越高表明资产的安全越有可能受到威胁",
        "资产价值高低的界定可由测评委托单位根据密码应用方案、等级保护定级报告等继承和确 定，并由测评结构进行审查和确认"
      ],
      "answer": "BC",
      "analysis": "D项 测评委托单位，在原文中是被测单位"
    },
    {
      "id": "3858",
      "title": "以下关于评估结论的描述正确的是（ ）。",
      "option": [
        "符合：被测信息系统中未发现安全问题，测评结果中所有单元测评结果中部分符合和不符合项的统计结果全为 0，综合得分为100分。",
        "基本符合：被测信息系统中存在安全问题，部分符合和不符合项的统计结果不全为 0，且综合得分不低于阈值。",
        "不符合：被测信息系统中存在安全问题，部分符合和不符合项的统计结果不全为0，综合得分低于阈值。",
        "不符合：被测信息系统存在的安全问题会导致 被测信息系统面临高等级安全风险。"
      ],
      "answer": "ACD",
      "analysis": "安全问题是否是高风险问题不确定，所以没选B"
    },
    {
      "id": "3872",
      "title": "根据GM/T 0116《信息系统密码应用测评过程指南》，在测评活动开展前，需要对被测信息系统的密码应用方案进行评估，密码应用方案可以作为测评实施的依据。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "通过评估的密码应用方案可以作为测评实施依据"
    },
    {
      "id": "3886",
      "title": "根据GM/T 0116《信息系统密码应用测评过程指南》，无论信息系统密码应用方案是否通过评估，测评方均需要对所有不适用项进行逐条核查、评估，论证其安全需求、不适用的具体原因，以及是否采用了可满足安全要求的其他替代性风险控制措施来达到等效控制。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "需要特别指出的是，对于不适用项应逐条论证，论证内容至少包括：网络或数据的安全需求（资产、\n数据等的重要性及其安全需求通常由等级保护定级、关键信息基础设施识别等来确定，密码\n应用解决方案设计时应继承这些内容）、不适用的具体原因（如环境约束、业务条件约束、\n经济社会稳定性等）和可满足安全要求并达到等效控制的其他替代性风险控制措施。"
    },
    {
      "id": "3897",
      "title": "密评实施过程中，需要深入验证密码产品的功能实现，并核查密码产品是否在信息系统中正确、有效地发挥作用。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "与3903矛盾"
    },
    {
      "id": "3910",
      "title": "根据GM/T 0116《信息系统密码应用测评过程指南》，层面间测评是指对同一技术层面或管理方面内的两个或者两个以上不同测评单元间的关联进行测评分析。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "3912",
      "title": "根据GM/T 0116《信息系统密码应用测评过程指南》，整体测评过程中，针对测评对象“部分符合 ”及“不符合”要求的单个测评项，分析与该测评项相关的其他测评项、其他单元、其他层面的测评对象能否和它发生关联关系，发生何种关联关系，这些关联关系产生的作用是否可以“弥补”该测评项的不足，以及该测评项的不足是否会影响与其有关联关系的其他测评项的测评结果。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "3921",
      "title": "某信息系统整体量化评估结果为70分，且风险评估未发现高风险，因此该系统的密评结论应为部分符合。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "是基本符合，不是部分符合。"
    },
    {
      "id": "3938",
      "title": "某三级信息系统运维人员从互联网， 通过SSL VPN接入内网后，再登录堡垒机对系统中的服务器进行远程运维管理，运维人员均配置了智能密码钥匙，则在网络和通信安全层面的“身份鉴别”的主要测评内容包括（）。",
      "option": [
        "客户端对SSL VPN服务端的身份鉴别",
        "SSL VPN服务端对客户端使用智能密码钥匙的身份鉴别",
        "第三方电子认证服务",
        "身份鉴别过程是否采用了挑战响应机制"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "3939",
      "title": "网络和通信安全、应用和数据安全都有传输安全性（机密性、完整性）的要求，以下说法正确的是（）。",
      "option": [
        "如果网络和通信安全层面合规，应用和数据安全层面的传输机密性和完整性未采用密码技 术，则网络层可以缓解应用层传输安全的风险",
        "如果应用和数据安全层面的某关键数据传输机密性和完整性符合要求，网络和通信安全层面未采用密码技术，则应用层可以弥补网络层的传输安全",
        "两个安全层面的数据保护对象不一样",
        "两个安全层面可以相互弥补，降低风险"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "3953",
      "title": "某信息系统部署了B两台服务器，其生产厂商、型号和操作系统版本等都相同，购买后对服务器 A的身份鉴别进行了改造，测评时对服务器的身份鉴别量化评估方法为（）。",
      "option": [
        "D/A/K均以两个服务器的实际应用情况各自赋分",
        "D/A/K均以未改造服务器B的实际应用情况赋分",
        "D/A/K均以未改造服务器A的实际应用情况赋分",
        "依据被测单位要求对服务器赋分"
      ],
      "answer": "A",
      "analysis": "faq7"
    },
    {
      "id": "3961",
      "title": "使用IPSec协议分析工具抓包，主要抓取并分析的是哪个阶段的数据包（）。",
      "option": [
        "握手阶段数据包",
        "密钥交换协议第一阶段的数据包",
        "密钥交换协议第二阶段的数据包",
        "安全报文协议"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "3963",
      "title": "关于云平台“被部分评估的支撑能力”描述错误的是（  ）。",
      "option": [
        "“被部分评估的支撑能力表”只在云平台测评时填写",
        "“被部分评估的支撑能力表”包含有适用条件的量化评估和风险分析",
        "被部分评估的支撑能力只需在云平台测评",
        "被部分评估的支撑能力主要指的是对云上应用提供的密码支撑服务"
      ],
      "answer": "C",
      "analysis": "(2) 被部分评估的支撑能力:指的是云平台提供的某些支撑服务，这些支撑服务仅用于云上应用而不用于云平台，或者将服务于云平台和云上应用的不同测评对象。比如云平台的电子签章系统仅用于支撑了云上应用合同的抗抵赖保护，而不用于云平台本身:又比如云服务器密码机在进行数据存储保护时，面向的是云平台和云上应用的不同数据。由于这种情况下,该支撑能力必须结合云上应用的密码应用一起评估,因此无法在云平台测评时进行“完全评估”，只能进行“部分评估”，评估的内容包括:1) 支撑能力相应的部分量化评估情况，包括《商用密码应用安全性量化评估规则》中定义的A和K的赋值和适用情况 (即，在何种情况下可以取得相应量化评估分值:比如支撑能力提供了AES和SM4两种对称密码算法，在使用AES时，A为x: 在使用SM4时，A为V)支撑能力相应的风险评价和适用情况(即，在何种情况下可以取得相应风险评价结论)"
    },
    {
      "id": "3968",
      "title": "对于已更换商用密码产品认证证书的密码产品如果未标注密码模块安全等级，以下描述错误的是（  ）。",
      "option": [
        "需要进一步提供换证前的商用密码产品型号证书",
        "需要确认换证前的商用密码产品型号证书的安全等级是否符合要求",
        "未提供安全等级证明的按照“密码产品等级不符合”进行判定",
        "提供密码产品的密钥管理安全措施方案，证明其符合安全要求，并按 “密码产品等级符合”判定"
      ],
      "answer": "D",
      "analysis": "对于换证的密码产品，因为其换发的认证证书上一律没有标注密码模块安全等级，此时\n需要密码厂商进一步提供换证前的商用密码产品型号证书，如果商用密码产品型号证书中标\n注了其符合的密码模块等级，则按此等级进行判定；否则，依据《商用密码应用安全性评估\n量化评估规则》按“密码产品符合一级密码模块”进行判定。"
    },
    {
      "id": "3972",
      "title": "某信息系统的安全等级为第三级，被测单位认为网络与通信安全层面的安全接入认证不适用，则应在设计密码应用方案时（）。",
      "option": [
        "不需要明确说明安全接入认证指标的不适用性",
        "需要明确说明安全接入认证指标的不适用性，并且需要采取风险控制措施",
        "需要明确说明安全接入认证指标的不适用性，但不需要采取风险控制措施",
        "无法作为不适用项"
      ],
      "answer": "C",
      "analysis": "测评指标为可，不适用由用户自行决定"
    },
    {
      "id": "3978",
      "title": "信息系统可采用以下密码产品保护其应用和数据安全层面的安全：（）",
      "option": [
        "利用智能密码钥匙、智能 IC 卡、动态令牌等作为用户登录应用的凭证。",
        "利用服务器密码机等设备对应用系统指定的重要数据进行加密和计算消息杂凑后传输，实现对重要数据（在应用和数据安全层 面）在传输过程中的保密性和完整 性保护。",
        "利用服务器密码机等设备对重要数据进行加密、计算 MAC 或签名后存储在数据库中，实现对重要数据在存储过程中的保密性和完整性保护。",
        "利用签名验签服务器、智能密码钥匙、电子签章系统、时间戳服务器等设备实现对可能涉及法律责任认定的数据原发、接收行为的不可否认性"
      ],
      "answer": "ACD",
      "analysis": ""
    },
    {
      "id": "3983",
      "title": "对于符合 GM/T 0036-2014《采用非接触卡的门禁系统密码应用技术指南》标准的电子门禁系统，在密评时，以下表述正确的是（）。",
      "option": [
        "需要核实是否采用并正确应用了经检测认证合格的电子门禁系统",
        "按照密评相关标 准，需要门禁系统厂商进一步提供门禁系统进出记录数据存储完整性保护的相关证据",
        "按照密评相关标 准，需要门禁系统厂商进一步提供门禁系统进出记录数据存储机密性保护的相关证据",
        "门禁卡发卡系统可不纳入测试范围"
      ],
      "answer": "AB",
      "analysis": "根据39786，物理和环境安全层面需检测“身份鉴别”、“电子门禁记录完整性”、“视频监控记录完整性”，所以AB是需要的，C不需要；在测身份鉴别时，除了门禁系统自身的合规，还需对门禁卡、对卡器等设备采用的相关密码技术、密码算法做对应的检查"
    },
    {
      "id": "3987",
      "title": "某信息系统部署在公有云平台的独立VPC内，通过云平台的堡垒机对设备进行远程管理，则在设备和计算安全层面“远程管理通道安全”测评单元的测评对象为（）。",
      "option": [
        "堡垒机与设备之间的通信信道",
        "浏览器与堡垒机之间的通信信道",
        "浏览器与设备之间的通信信道",
        "设备与设备之间的通信信道"
      ],
      "answer": "AB",
      "analysis": ""
    },
    {
      "id": "3988",
      "title": "某电商平台包括用户注册业务和商品交易业务两大类，以下选项中属于应用和数据安全层面的测评时关注的内容的是（）。",
      "option": [
        "用户注册业务",
        "商品交易业务",
        "交易订单数据",
        "用户浏览记录"
      ],
      "answer": "ABCD",
      "analysis": "重要操作和重要数据纳入测评时考虑。"
    },
    {
      "id": "3992",
      "title": "某电商平台用户需使用合规的智能密码钥匙才能登录，平台通过调用服务器密码机对用户注册信息采用SM4算法进行加密存储，则在应用和数据安全层面“重要数据存储机密性”测评单元的测评对象主要包括（）。",
      "option": [
        "用户注册信息",
        "智能密码钥匙",
        "服务器密码机",
        "数据库服务器"
      ],
      "answer": "AC",
      "analysis": ""
    },
    {
      "id": "3997",
      "title": "堡垒机使用合规的智能密码钥匙进行身份鉴别，对通用服务器、数据库进行统一管理，针对通用服务器和数据库采用用户名+口令方式实现身份鉴别的情况，以下关于通用服务器、数据库身份鉴别判定合理的是（）。",
      "option": [
        "判定通用服务器和数据库为部分符合",
        "判定通用服务器和数据库为不符合",
        "判定通用服务器和数据库采取了风险缓解措施",
        "判定通用服务器和数据库为高风险"
      ],
      "answer": "BC",
      "analysis": ""
    },
    {
      "id": "4002",
      "title": "某信息系统包括前台应用系统和后台管理系统，通过互联网或企业内网使用浏览器访问前台应用系统，则网络和通信安全层面的测评对象有哪些（）。",
      "option": [
        "互联网浏览器与前台应用系统之间的通信信道",
        "互联网浏览器与后台管理系统之间的通信信道",
        "企业内网浏览器与前台应用系统之间的通信信道",
        "企业内网浏览器与后台管理系统之间的通信信道"
      ],
      "answer": "AC",
      "analysis": "这道题题干中，只说了互联网和内网能访问前台，未说后台怎么访问，所以AC"
    },
    {
      "id": "4003",
      "title": "某信息系统包括前台应用系统和后台管理系统，通过非国密浏览器或国密浏览器访问前台应用系统，则网络和通信安全层面的测评对象有哪些（）。",
      "option": [
        "互联网国密浏览器与前台应用系统之间的通信信道",
        "互联网国密浏览器与后台管理系统之间的通信信道",
        "互联网非国密浏览器与前台应用系统之间的通信信道",
        "互联网非国密浏览器与后台管理系统之间的通信信道"
      ],
      "answer": "AC",
      "analysis": ""
    },
    {
      "id": "4004",
      "title": "某互联网端汽车租赁系统采用B/S架构，通过互联网使用了第三方电子认证服务，则网络和通信安全层面的测评对象有哪些（）。",
      "option": [
        "互联网浏览器与汽车租赁系统之间的通信信道",
        "汽车租赁系统与与第三方电子认证服务相关系统之间的通信信道",
        "互联网浏览器与第三方电子认证服务相关系统之间的通信信道",
        "以上均是"
      ],
      "answer": "AB",
      "analysis": ""
    },
    {
      "id": "4005",
      "title": "某办公系统部署了SSL VPN安全网关，并向相关用户配发USBKey，实现对PC端登录系统用户的身份鉴别，在密评时以下选项中属于应用和数据安全层面测评对象的是（）。",
      "option": [
        "SSL VPN安全网关",
        "USBKey",
        "PC端浏览器",
        "办公系统"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "4006",
      "title": "某办公系统部署了SSL VPN安全网关，并向相关用户配发USBKey，实现对PC端登录系统用户的身份鉴别，在密评时以下选项中属于网络和通信安全层面测评对象的是（）。",
      "option": [
        "SSL VPN安全网关",
        "USBKey",
        "PC端浏览器",
        "PC端浏览器与SSL VPN 安全网关之间通信信道"
      ],
      "answer": "ACD",
      "analysis": "FAQ5.2"
    },
    {
      "id": "4007",
      "title": "某信息系统的机房和办公区在同一个办公楼且系统和办公区同属于一个网络（办公内网），运维时，可以在办公区通过堡垒机进行设备的运维管理，也可以从互联网和政务外网通过SSL VPN进入办公内网再登录堡垒机运维，则在网络和通信安全层面，以下属于该远程运维管理通道测评对象的是（）。",
      "option": [
        "从互联网访问SSL VPN的通信信道",
        "从政务外网访问SSL VPN的通信信道",
        "从办公网访问堡垒机的通信信道",
        "堡垒机登录设备运维的通信信道"
      ],
      "answer": "ABC",
      "analysis": "FAQ问题8"
    },
    {
      "id": "4011",
      "title": "在针对应用和数据安全层面进行测评时，以下属于该安全层面测评对象的是（）。",
      "option": [
        "应用系统管理员",
        "应用系统",
        "密码产品",
        "技术文档"
      ],
      "answer": "BC",
      "analysis": ""
    },
    {
      "id": "4012",
      "title": "以下可能属于应用和数据安全层面不可否认性测评单元测评时需要关注的内容是（）。",
      "option": [
        "接收到重要邮件的确认操作",
        "对重要数据进行签名",
        "公文管理系统业务用户公文签发操作",
        "某银行网上的取钱或转账操作"
      ],
      "answer": "ABCD",
      "analysis": "重要操作行为不可否认性，如果答案定义成重要操作行为，那需要关注不可否认性。建议ABCD。"
    },
    {
      "id": "4015",
      "title": "以下选项中可纳入业务系统应用和数据安全层面重要数据存储完整性测评单元测评对象的有（）。",
      "option": [
        "用户名和口令",
        "重要审计数据",
        "公开网站用户浏览记录",
        "数据库的应用日志记录"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "4028",
      "title": "根据《商用密码应用安全性评估FAQ（第二版）》，某三级信息系统部署了经检测认证合格的服务器密码机（密码模块为二级），则密评时针对设备和计算安全层面“系统资源访问控制信息完整性”指标要求，该服务器密码机可直接判定为符合。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4034",
      "title": "某信息系统部署在公有云平台的独立VPC内，通过云平台的堡垒机对设备进行远程管理，应将堡垒机与设备之间的远程管理通道作为网络和通信安全层面的测评对象。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4057",
      "title": "某二级信息系统责任单位不计划把视频监控记录数据存储完整性指标纳入测评范围，在设计密码应用方案时（）。",
      "option": [
        "不需要明确说明视频监控记录数据存储完整性指标的不适用性",
        "需要明确说明视频监控记录数据存储完整性指标的不适用性，但不需要采取风险控制措施",
        "需要明确说明视频监控记录数据存储完整性指标的不适用性，并且需要采取风险控制措施",
        "视频监控记录数据存储完整性指标无法作为不适用项"
      ],
      "answer": "A",
      "analysis": "二级无该指标要求"
    },
    {
      "id": "4082",
      "title": "在密评实施过程中，发现用户虽然使用HMAC- SM3对口令数据进行完整性保护，且采用认证合格的智能密码钥匙生成MAC，但是只截取使用了 MAC值的前8个比特，那么对应用和数据安全层面的“重要数据存储完整性保护”指标判定时，以下DAK判定最为合理的是（）。",
      "option": [
        "√√√",
        "√××",
        "√√×",
        "×√√"
      ],
      "answer": "D",
      "analysis": ""
    },
    {
      "id": "4102",
      "title": "某机房电子门禁记录数据完整性保护通过服务器密码机的HMAC实现，以下哪些属于电子门禁记录数据存储完整性测评单元的测评方法（）。",
      "option": [
        "核查电子门禁系统的商用密码产品认证证书",
        "核查服务器密码机的商用密码产品认证证书",
        "核查是否能够修改电子门禁记录",
        "核查是否能够发现修改电子门禁记录数据"
      ],
      "answer": "BCD",
      "analysis": "电子门禁记录的完整性通过服务器密码机实现，那么密码部分在服务器密码机，所以看密码机有证没有。"
    },
    {
      "id": "4109",
      "title": "某公有云平台部署了服务器密码机对云平台和云上应用提供数据存储保护，部署了电子签章系统仅供云上应用调用，则在对公有云平台进行密码应用安全性评估时，以下关于测评对象选择正确的是（）。",
      "option": [
        "云平台运行所在机房应作为测评对象",
        "服务器密码机不作为测评对象",
        "服务器密码机应作为测评对象",
        "电子签章系统应作为测评对象"
      ],
      "answer": "ACD",
      "analysis": "FAQ，（2）被部分评估的支撑能力：指的是云平台提供的某些支撑服务，这些支撑服务仅用于云上应用而不用于云平台，或者将服务于云平台和云上应用的不同测评对象。比如云平台的电子签章系统仅用于支撑了云上应用合同的抗抵赖保护，而不用于云平台本身；又比如云服务器密码机在进行数据存储保护时，面向的是云平台和云上应用的不同数据。由于这种情况下，该支撑能力必须结合云上应用的密码应用一起评估，因此无法在云平台测评时进行“完全评估”，只能进行“部分评估”。\n部分评估也是要作为评估对象的"
    },
    {
      "id": "4126",
      "title": "某机房的电子门禁系统通过ID卡进行身份鉴别，则该电子门禁系统的身份鉴别通常判定为部分符合。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "ID卡应该不符合要求，而不是部分符合，与其他题不相容"
    },
    {
      "id": "4177",
      "title": "在密评中，以下（）设备一般不作为测评工具接入点。",
      "option": [
        "防火墙",
        "交换机",
        "服务器",
        "堡垒机"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4185",
      "title": "通过对网络信道中的SSL协议数据进行分析， Server Hello中显示密码套件ID为{0xe0,0x53}，则表示双方所协商的密钥交换算法为和加密算法分别为（）",
      "option": [
        "SM2公钥加密算法， SM4_CBC",
        "SM2密钥交换算法， SM4_CBC",
        "SM2密钥交换算法， SM4_GCM",
        "SM2公钥加密算法， SM4_GCM"
      ],
      "answer": "D",
      "analysis": ""
    },
    {
      "id": "4195",
      "title": "某证书的签名算法是1.2.156.10197.1.501，则意味着（）。",
      "option": [
        "该证书所包含的公钥是SM2公钥",
        "签发该证书采用的是 SM3withSM2Encrypt ion算法",
        "颁发者所使用的公钥是SM2公钥",
        "不考虑编码，该证书的签名值长度应为64字节"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "4196",
      "title": "对数字证书进行解析时，发现该证书的公钥对应的类型是1.2.156.10197.1.301，则意味着（）。",
      "option": [
        "该证书所包含的公钥是SM2公钥",
        "签发该证书采用的是 SM3withSM2Encrypt ion算法",
        "颁发者所使用的公钥是SM2公钥",
        "不考虑编码，该证书所包括的公钥长度应为64字节"
      ],
      "answer": "AD",
      "analysis": ""
    },
    {
      "id": "4198",
      "title": "用户通过安全浏览器与SSL VPN 搭建的SSL 通道，与信息系统所属内网的应用服务器进行数据通信，那么从以下（）位置可以抓取到SSL报文。",
      "option": [
        "用户使用安全浏览器的终端",
        "SSL VPN内部",
        "安全浏览器与SSL VPN之间的通信信道",
        "信息系统所属内网的服务器"
      ],
      "answer": "ABC",
      "analysis": "1可在安全浏览器终端安装协议分析工具抓取SSL报文2部分SSLVPN设备具有报文抓取功能3可在通信链路交换机配置镜像端口进行SSL报文抓取4SSLVPN后端内部网络不涉及SSL报文"
    },
    {
      "id": "4199",
      "title": "在验证某个密文是否由SM2算法加密时，如果可以知道明文和公钥，但无法获得私钥时，以下方法中可行，并且可以作为证据的是（）。",
      "option": [
        "分析该密文开头的 64字节是否是SM2椭圆曲线上的点",
        "对明文进行公钥加密，对比产生密文是否与待测密文一致",
        "分析明密文长度是否相差96字节",
        "分析密文长度是否是512字节"
      ],
      "answer": "AC",
      "analysis": ""
    },
    {
      "id": "4200",
      "title": "以下（）方法可以用于辅助数字证书的分析。",
      "option": [
        "对数字证书的数字签名算法进行正确性验证",
        "对数字证书进行随机性检测",
        "使用ASN.1工具对数字证书格式进行解析",
        "对数字证书的杂凑密码算法进行正确性验证"
      ],
      "answer": "ACD",
      "analysis": "密码算法合规性检测包含两部分内容:商用密码算法实现的合规性检测和随机数生成合规性检测。\n(1)商用密码算法实现合规性,是指商用密码算法应按照密码算法标准要求进行参数设置和代码实现。检测商用密码算法实现的合规性时,首先通过送检产品对指定的输入数据进行相应密码计算,产生输出数据,该过程中的输入和输出作为测试数据;再将测试数据中的输入作为商用密码算法实现的合规性检测工具的输入,\n通过检测工具产生输出结果。如果送检产品的输出结果与检测工具的输出结果一致,则说明密码算法实现正确,即合规。一般地,需要准备多组测试数据(如10组)进行测试,输入数据的长度也会有所不同。当所有测试结果均一致时,才能说明密码算法实现是合规的。商用密码算法实现的合规性检测项目包括:\n①ZUC算法:基于ZUC的机密性算法128-EEA3的合规性检测;基于ZUC的\n完整性算法128乇IA3的合规性检测。\n②SM2、sM9算法:密钥对生成合规性检测;加/解密实现的合规性检测;签\n名/验签实现的合规性检测;密钥协商实现(发起方/口向应方)的合规性检测。\n③SM3算法:杂凑算法实现的合规性检测。\n④SM4算法:在ECB、CBC等不同工作模式下加/解密实现的合规性检测。\n(2)随机数生成合规性检测,是密码算法合规性检测中的另一项重要检测内容。\n随机数在密码学中广泛应用,例如,在密钥产生过程、数字签名方案、密钥交换协\n议和实体鉴别协议都用到了随机数,产生随机数的部件称为随机数发生器。对随机\n数质量的检测是保证密码产品安全的基础,几乎在所有密码产品标准中都有对随机\n数质量的要求。\n目前,针对随机数检测的已发布标准有两个,分别是测试随机数统计特性的\nGM/TOOOS-⒛12《随机性检测规范》(对应国家标准为GB/T”91S-2016《二元序\n刿随机性检测方法》),以及规范随机数在不同类型密码产品中检测方式的GM/T\nOO⒍¨⒛18《密码产品随机数检测要求》。此外,还有一些关于随机数发生器设计和\n检测的标准正在制定过程中,如《密码随机数生成模块设计》《软件随机数发生器\n设计指南》《随机数发生器总体框架》等标准。"
    },
    {
      "id": "4201",
      "title": "某信息系统中部署了IPSec VPN对网络信道进行保护，通过分析信道中的IPSec协议数据，可以获取的信息是（）。",
      "option": [
        "ISAKMP主模式中的签名证书",
        "ISAKMP主模式中的加密证书",
        "ISAKMP快速模式中的载荷（除ISAKMP头外）",
        "ISAKMP主模式中响应方生成的临时密钥"
      ],
      "answer": "AB",
      "analysis": ""
    },
    {
      "id": "4208",
      "title": "在测评时发现某信息系统数据库中某数据密文长度为160字节，则其使用的算法可能为（）。",
      "option": [
        "SM4",
        "AES-128",
        "AES-192",
        "DES"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4210",
      "title": "一般数字证书的后缀名是（）。",
      "option": [
        "cer",
        "crt",
        "der",
        "pem"
      ],
      "answer": "ABCD",
      "analysis": "一般数字证书的后缀名是\".cer\"或者\".crt\"。这两个后缀都表示证书文件，其中\".cer\"通常用于公钥证书，而\".crt\"用于通用的证书格式。\n.pem:采用PEM编码格式的X.509证书的文件扩展名；\n.der:采用DER编码格式的X.509证书的文件扩展名；\n.crt:即certificate的缩写，常见于类UNIX系统，有可能是PEM编码，也有可能是DER编码，但绝大多数情况下此格式证书都是采用PEM编码；\n.cer:也是certificate的缩写，常见于Windows系统，同样地，可能是PEM编码，也可能是DER编码，但绝大多数情况下此格式证书都是采用DER编码；"
    },
    {
      "id": "4216",
      "title": "通过对网络信道中的IPSec协议数据包进行分析，密评人员可以获得以下哪些信息（）。",
      "option": [
        "IPSec协议建立过程中双方协商的密码算法",
        "IPSec协议建立过程中双方的证书",
        "IPSec协议建立过程中双方协商的会话密钥",
        "IPSec协议的报文封装协议"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "4217",
      "title": "在密评中，使用Wireshark对网络通道的SSL协议数据进行抓取，描述不正确的有（）。",
      "option": [
        "可接入到安装有国密SSL安全浏览器的客户端，捕获SSL协议建立过程的数据包",
        "一定可以查看到握手协议中双方的身份证书",
        "可查看到双方协商的用于密钥协商的算法",
        "可以在不需要双方公私钥对的情况下，解密SSL协议记录层保护的数据"
      ],
      "answer": "BD",
      "analysis": ""
    },
    {
      "id": "4222",
      "title": "以下关于Wireshark过滤规则的说法，（）是正确的。",
      "option": [
        "icmp and ip.dst==192.168.1.1可以用于获取目标IP地址为192.168.1.1并且协议为ICMP的所有数据包",
        "dns.dstport==53 and ip.src==192.168.1.1用于获取所有源IP地址为192.168.1.1并且目标端口号为53的所有DNS请求数据包",
        "udp.dstport==00:11:2 2:33:44:55 可以用于获取目标MAC地址为00:11:22:33:44:55并且协议为UDP的所有数据包",
        "eth.dst==00:11:22:33:44:55可以用于获取所有目标MAC地址为00:11:22:33:44:55的数据包"
      ],
      "answer": "AD",
      "analysis": "dns端口就是53，没有dns.port==53的说法"
    },
    {
      "id": "4223",
      "title": "某信息系统在网络边界处部署了SSL VPN网关，为互联网终端访问内网资源建立安全传输通道，测评人员在以下接入点（）无法捕获SSL协议通信数据包。",
      "option": [
        "SSL VPN网关上",
        "SSL VPN网关与互联网终端之间的交换机上",
        "信息系统内的应用服务器上",
        "SSL VPN网关与信息系统应用服务器之间的核心交换机上"
      ],
      "answer": "CD",
      "analysis": ""
    },
    {
      "id": "4249",
      "title": "对同一数据分别使用SHA-224和SHA-512/224算法计算杂凑值，其输出长度是一样的。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4252",
      "title": "ISAKMP快速模式中的载荷（除ISAKMP 头外）可以通过Wireshark进行解析。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4253",
      "title": "通过Wireshark可以解析ESP协议中的数据字段。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4254",
      "title": "通过Wireshark可以解析SSL协议中记录层的字段。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4256",
      "title": "解 析 数 字 证 书 中 的keyUsage 扩 展 项 ， 如 果keyCertSign位被置为1，则表示该证书为CA证书。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4258",
      "title": "GB/T 20518《信息安全技术 公钥基础设施 数字证书格式》规定CRL数据结构若包含version 字段，必须是v2。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "GB/T 20518《信息安全技术 公钥基础设施 数字证书格式》 附录A.2基本证书域"
    },
    {
      "id": "4269",
      "title": "Wireshark可以帮助密评人员核实在IPSec 协议Hello消息中，通信双方协商的密码算法。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "ipsec协议不是hello，是IKE"
    },
    {
      "id": "4271",
      "title": "分析数字证书格式时，通过ASN.1 DER格式展示证书签名值（采用SM2签名算法），该字段TLV三元组长度为64字节。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4273",
      "title": "密评人员在对密码算法进行分析时，若遇到SM4- CBC加密模式，应进一步确认算法的填充方式。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "CBC模式需要填充"
    },
    {
      "id": "4281",
      "title": "根据《商用密码应用安全性评估量化评估规则（2021版）》，某信息系统使用签名验证服务器（获得商用密码产品认证证书）实现SM2数字签名功能，在设备和计算层面对签名验签服务器进行量化评估时，其结果为（）。",
      "option": [
        "1",
        "0.5",
        "0",
        "无法判断"
      ],
      "answer": "D?",
      "analysis": "题干未提有效性和秘钥管理，无从判定。"
    },
    {
      "id": "4287",
      "title": "某信息系统基于OpenSSL软件实现的RSA-2048算法，对用户登录口令的传输机密性进行保护。根据《商用密码应用安全性评估量化评估规则（2021版）》，该信息系统在应用和数据安全层面的身份鉴别的量化评估结果为（）。",
      "option": [
        "0",
        "0.25",
        "0.5",
        "1"
      ],
      "answer": "A",
      "analysis": "原因是身份鉴别是用户名口令"
    },
    {
      "id": "4293",
      "title": "根据《商用密码应用安全性评估量化评估规则（2021版）》，某三级信息系统密评时所有安全层面均适用，经测评，“物理和环境安全”、“网络和通信安全”、“设备和计算安全”、“应用和数据安全”量化评估结果分别为0.5、0.75、0.3333， 0.6667，该系统上述4个层面整体量化评估结果为（）。",
      "option": [
        "41.25",
        "43.33",
        "58.93",
        "61.9"
      ],
      "answer": "B",
      "analysis": "量化评估以上四个层面权重wi分别为10、20、10、30。"
    },
    {
      "id": "4299",
      "title": "根据《商用密码应用安全性评估量化评估规则（2021版）》，某三级信息系统在对网络和通信安全层面测评过程中发现，非国密浏览器（未通过商用密码检测认证）和安全认证网关（经检测认证的二级密码模块）之间通信信道使用自签的 RSA-2048数字证书进行身份鉴别，则该测评对象在“身份鉴别”的量化评估结果为（）。",
      "option": [
        "0",
        "0.25",
        "0.5",
        "1"
      ],
      "answer": "B",
      "analysis": "通信两端，非国密浏览器端未通过商用密码检测认证，不符合。"
    },
    {
      "id": "4300",
      "title": "根据《商用密码应用安全性评估量化评估规则（2021版）》，某二级信息系统对应用和数据安全层面测评过程中发现，系统通过调用服务器密码机（经检测认证的一级密码模块）使用AES- 256算法实现个人敏感信息存储的机密性保护，则该测评对象的量化评估结果为（）。",
      "option": [
        "0",
        "0.25",
        "0.5",
        "1"
      ],
      "answer": "C",
      "analysis": "密码算法/技术合规性A不满足，D、K满足。"
    },
    {
      "id": "4302",
      "title": "根据《商用密码应用安全性评估量化评估规则（2021版）》，某三级网银系统用户通过智能密码钥匙（经检测认证的二级密码模块）使用美国 GlobalSign 颁发的SHA-256WtihRSA-2048 算法数字证书登录网银系统，则该测评对象分值最合理的是为（）。",
      "option": [
        "0",
        "0.25",
        "0.5",
        "1"
      ],
      "answer": "B",
      "analysis": "D/A/K的A不符合"
    },
    {
      "id": "4319",
      "title": "在某个政务三级信息系统的设备和计算层面测评过程中，发现采用了具有商用密码产品认证证书的SSL VPN设备，根据《商用密码应用安全性评估量化评估规则（2021版）》，该测评对象“日志记录完整性”的的量化结果为（）。",
      "option": [
        "0",
        "0.5",
        "1",
        "不确定"
      ],
      "answer": "C",
      "analysis": "依据FAQ 9.1判定，获证的整机类密码产品改测评向可判定符合"
    },
    {
      "id": "4322",
      "title": "在某个政务三级信息系统的设备和计算层面测评过程中，发现采用了具有商用密码产品认证证书的SSL VPN设备，根据《商用密码应用安全性评估量化评估规则（2021版）》，该测评对象“系统资源访问控制信息完整性”的量化结果为（）。",
      "option": [
        "0",
        "0.5",
        "1",
        "不确定"
      ],
      "answer": "C",
      "analysis": "依据FAQ 9.1判定，获证的整机类密码产品改测评向可判定符合"
    },
    {
      "id": "4336",
      "title": "某三级信息系统， 在内网接入区通过部署SSL VPN网关（经检测认证的二级密码模块）、国密浏览器（经检测认证的一级密码模块），实现对办公内网通道的密码应用改造。上述使用的密码产品均进行了正确的配置。根据《商用密码应用安全性评估量化评估规则（2021版）》，以下量化评估描述中，正确的有（）。",
      "option": [
        "测评时使用国密览器访问系统时，发现其HTTPS协议使用的加密算法为 SM4-GCM，该通道通信过程中重要数据的机密性测评单元量化评估结果为 0.5",
        "测评时使用国密浏览器访问系统时，发现其HTTPS协议使用的数字签名算法为RSA，该通道身份鉴别测评单元量化评估结果为0.5",
        "测评时使用国密览器访问系统时，发现其HTTPS协议使用的MAC算法为 HMAC-SM3，该通道通信过程中重要数据的机密性测评单元量化评估结果为1",
        "测评时使用谷歌览器访问系统时，发现其HTTPS协议使用的MAC算法为 HMAC-SHA1，该通道通信过程中重要数据的机密性测评单元量化评估结果为0.25"
      ],
      "answer": "AD",
      "analysis": "一级证书k不给分"
    },
    {
      "id": "4339",
      "title": "根据《商用密码应用安全性评估量化评估规则（2021版）》，以下说法错误的有（）。",
      "option": [
        "无论哪个安全层 面，测评单元的量化评估结果共有{0，0.25，0.5，1}四种情况",
        "在技术要求中，测评单元的量化评估结果介于[0,1]之间，取小数点后4位",
        "在密码应用技术各层面中，测评单元的量化评估结果介于[0,1]之间，取小数点后2位",
        "在密码应用管理各层面中，测评单元的量化评估结果共有{0，0.25，0.5， 1}四种情况"
      ],
      "answer": "ACD",
      "analysis": "测评单元量化评估取测评对象的算数平均值"
    },
    {
      "id": "4343",
      "title": "根据《商用密码应用安全性评估量化评估规则（2021版）》，下列说法正确的是（）。",
      "option": [
        "若一个测评对象涉及多个密码算法/产品/服务/密钥， D/A/K都按照最低分值给分",
        "密码应用管理要求不针对各个测评对象的测评结果进行量化评估，其中符合为1分，不符合为 0分，部分符合为0.5分",
        "通用要求和密码应用技术要求各安全层面的“密码服务”和 “密码产品”指标不单独评价",
        "若某测评对象使用了经检测认证的密码产品且满足相应的密码模块要求，但使用的密码算法/技术不合规，则为部分符合，该测评对象量化评估结果为0.5"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4347",
      "title": "根据《商用密码应用安全性评估量化评估规则（2021版）》，下列说法不正确的是（）。",
      "option": [
        "网络和通信安全、设备和计算安全和应用和数据安全三个层面“访问控制信息完整性”量化评估权重相同",
        "若信息系统未制定密码应用方案，则可判定该系统建设运行层面各测评单元量化评估分值一定为0",
        "若信息系统未制定密码应用方案，已知信息系统于2021年2月1日上线运 行，则该系统建设运行中“投入运行前进行密码应用安全性评估”量化评估分值为1",
        "若信息系统测评时发现，其使用的服务器密码机采购时间在商用密码产品认证证书的有效期内，但测评时该证书已过期，则对测评单元评估时，K为×"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "4348",
      "title": "某三级信息系统应用和数据安全层面测评过程中发现，用户身份鉴别数据（即用户口令）和重要业务数据均通过调用服务器密码机（具有二级商密产品认证证书）进行保护，使用SM3带盐杂凑和HMAC-SM3对身份鉴别数据进行存储机密性保护和存储完整性保护，使用SM4-CBC、SM3算法实现重要业务数据存储机密性和存储完整性保护，则根据《商用密码应用安全性评估量化评估规则（2021版）》，以下说法正确的是（）。",
      "option": [
        "重要业务数据存储机密性和存储完整性，量化评估分值相同",
        "重要业务数据存储机密性和存储完整性，量化评估分值不相同",
        "若该系统应用层仅涉及身份鉴别数据、重要业务数据，则数据存储机密性测评单元的量化评估分值为0.5",
        "若该系统应用层仅涉及这两类关键数据，则数据存储完整性测评单元的量化评估分值为0.5"
      ],
      "answer": "BD",
      "analysis": "要么ACD，要么BD BCD的答案是冲突的，原因在于不需要原文的杂凑是否能实现保密性"
    },
    {
      "id": "4349",
      "title": "在测评某三级信息系统应用和数据安全层面重要数据存储时发现，该系统个人敏感信息使用SM4- GCM算法算法实现数据存储保护，重要业务数据使用AES-256、HMAC-SHA-256算法实现数据存储保护，且所有密码算法均通过调用具有二级商密产品认证证书的密码设备实现，根据《商用密码应用安全性评估量化评估规则（2021版）》，下列说法不正确的是（）。",
      "option": [
        "该系统应用和数据安全层面重要数据存储机密性测评单元分值为0.75",
        "该系统应用和数据安全层面重要数据存储完整性保护测评单元分值为0.25",
        "该系统应用和数据安全层面重要数据存储机密性和完整性保护两个测评单元分值不同",
        "若信息系统改用一级商密产品认证证书的密码设备实现重要数据存储的机密性和完整性保 护，则量化评估分值不变"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "4350",
      "title": "在对某三级信息系统设备和安全层面“身份鉴别”进行测评时，该系统三台操作系统和硬件型号均相同的服务器密码机分值分别为0.25、0.5、0，根据《商用密码应用安全性评估量化评估规则（2021版）》，以下说法正确的是（）。",
      "option": [
        "三台服务器密码机可能均具有商用密码产品认证证书",
        "三台服务器密码机可能均不具有商用密码产品认证证书",
        "三台密码机作为同一测评对象时的分值为0",
        "三台密码机作为同一测评对象时的分值为0.5"
      ],
      "answer": "ABC",
      "analysis": ""
    },
    {
      "id": "4354",
      "title": "根据《商用密码应用安全性评估量化评估规则（2021版）》，在某次测评中，物理和环境安全层面被列为不适用，以下（）是可能发生的。",
      "option": [
        "该系统最终得分大于90分",
        "该系统最终测评结论为不符合",
        "该系统最终测评结论为符合",
        "该安全层面属于密码应用技术要求维度"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4371",
      "title": "某第二级信息系统密评时，若“应急处置”中“事件处置”测评指标做为适用，根据《商用密码应用安全性评估量化评估规则（2021版）》，则“事件处置”测评指标应参与量化评估。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4415",
      "title": "某三级信息系统用户口令存储时，先使用DES算法加密后再使用SM4算法加密，使用的密码产品具有二级密码模块认证证书，根据《商用密码应用安全性评估量化评估规则（2021版）》，口令做为测评对象在“重要数据存储机密性”测评单元的量化评估结果为1分。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "先DES再SM4，不影响"
    },
    {
      "id": "4417",
      "title": "依据《信息系统密码应用高风险判定指引》，信息系统应用和数据层面，未采用密码技术对登录用户进行身份鉴别时，可以采用的缓解措施有（）。",
      "option": [
        "安排专人值守",
        "部署视频监控",
        "部署入侵检测系统",
        "采用基于特定识别技术进行身份鉴 别，如设备指纹、生物指纹和第三方身份鉴别服务等"
      ],
      "answer": "D",
      "analysis": "可能的缓解措施：\n1)基于生物识别技术（如指纹等）对重要区域进入人员进行身份鉴别；\n2)重要区域出入口配备专人值守并进行登记，且采用视频监控系统进行实时监控等。"
    },
    {
      "id": "4418",
      "title": "密评过程中，如果遇到《信息系统密码应用高风险判定指引》没有描述的风险判定情况，那么测评人员应（ ）。",
      "option": [
        "结合实际情况进行综合判定风险",
        "判定为高风险",
        "判定为中风险",
        "判定为低风险"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4419",
      "title": "依据《信息系统密码应用高风险判定指引》，信息系统中使用的密码产品或服务可能引起高风险的是（ ）。",
      "option": [
        "使用自实现且能够提供安全证明的密码产品",
        "使用的密码产品存在高危漏洞",
        "密码产品的使用符合国家密码主管部门的管理要求和标准规范的要求",
        "密码服务提供商具有国家密码管理部门的相关资质"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4420",
      "title": "在《信息系统密码应用高风险判定指引》中，对安全接入认证问题的风险判定适用于（ ）。",
      "option": [
        "第一级信息系统",
        "第二级信息系统",
        "第三级信息系统",
        "第四级信息系统"
      ],
      "answer": "D",
      "analysis": "适用范围：第四级信息系统。"
    },
    {
      "id": "4421",
      "title": "依据《信息系统密码应用高风险判定指引》，以下不存在缺陷或没有安全问题警示的密码技术是（）。",
      "option": [
        "SSH 1.0",
        "TLS 1.3",
        "SSL 2.0",
        "SSL 3.0"
      ],
      "answer": "B",
      "analysis": "使用存在缺陷或有安全问题警示的密码技术，如SSH1.0、SSL2.0、SSL3.0、TLS1.0等；"
    },
    {
      "id": "4422",
      "title": "某系统采用了未经安全性论证的密码通信协议，依据《信息系统密码应用高风险判定指引》，则该情况属于哪种风险（）。",
      "option": [
        "密码算法层面 的风险",
        "密码产品层面的风险",
        "密码技术层的面风险",
        "密码服务层面的风险"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "4423",
      "title": "在《信息系统密码应用高风险判定指引》中，关于指标“信息系统中使用的密码产品、密码服务应符合法律法规的相关要求”，主要是针对（）系统提出的。",
      "option": [
        "第二级以上",
        "第三级以上",
        "所有级别",
        "第三级"
      ],
      "answer": "C",
      "analysis": "《信息系统密码应用高风险判定指引》5.3密码产品和密码服务：指标要求：信息系统中使用的密码产品、密码服务应符合法律法规的相关要求。适用范围：所有级别信息系统。\n"
    },
    {
      "id": "4424",
      "title": "依据《信息系统密码应用高风险判定指引》中，网络通信过程中重要数据的机密性可以从（）层面进行缓解，从而降低安全风险。",
      "option": [
        "设备和计算安全",
        "应用和数据安全",
        "物理和环境安全",
        "安全管理制度"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4425",
      "title": "依据《信息系统密码应用高风险判定指引》，网络和通信安全层面如果未采用基于（）的数字签名机制等密码技术对通信实体进行身份鉴别，可能会导致信息系统面临高风险。",
      "option": [
        "公钥密码算法",
        "对称密码算法",
        "密码杂凑算法",
        "标识算法"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4426",
      "title": "依据《信息系统密码应用高风险判定指引》，网络和通信安全层面如果未采用基于对称密码算法或（）的消息鉴别码（MAC）机制等密码技术对通信实体进行身份鉴别，可能会导致信息系统面临高风险。",
      "option": [
        "密码杂凑算法",
        "生物特征",
        "祖冲之密码算法",
        "公钥密码算法"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4427",
      "title": "依据《信息系统密码应用高风险判定指引》，没有采用密码技术保证远程通道管理安全的情况下，信息系统为降低安全风险，可采用的缓解措施包括：搭建与业务网络（）隔离，并采取相应的安全防护措施的专用管理网络。",
      "option": [
        "逻辑",
        "物理",
        "区域",
        "边界"
      ],
      "answer": "B",
      "analysis": "《信息系统密码应用高风险判定指引》8.2远程管理通道安全\n：搭建了与业务网络物理隔离、采取相应的安全防护措施的专用管理网络（如带外管理网\n络）进行远程管理；\n若远程管理设备时未采用密码技术建立安全的信息传输通道，或远程管理信道所采用的密码技术实现机制不正确或无效，但通过搭建与业务网络物理隔离、采取相应的安全防护\n措施的专用管理网络进行远程管理，可酌情降低风险等级；"
    },
    {
      "id": "4428",
      "title": "依据《信息系统密码应用高风险判定指引》，应用系统在身份鉴别方面，可能存在高风险的是（）。",
      "option": [
        "使用了基于国产密码算法的USBKey实现用户身份的鉴别",
        "采用的密码产品具有商用密码产品认证证书",
        "用户身份真实性的密码技术实现机制正确且有效",
        "用户口令使用SM3密码算法处理后存储"
      ],
      "answer": "D",
      "analysis": ""
    },
    {
      "id": "4429",
      "title": "依据《信息系统密码应用高风险判定指引》，应用和数据安全层面没有采用密码技术保证用户身份鉴别安全的情况下，不属于降低信息系统安全风险可采用的缓解措施是（）。",
      "option": [
        "动态口令机制",
        "设备指纹",
        "生物指纹",
        "第三方身份鉴别服务"
      ],
      "answer": "A",
      "analysis": "可能的缓解措施：基于特定识别技术（如设备指纹、生物指纹、第三方身份鉴别服务等）保\n证用户身份的真实性"
    },
    {
      "id": "4430",
      "title": "依据《信息系统密码应用高风险判定指引》，能够最有效缓解应用和数据层面重要数据存储机密性安全风险的方式是（）。",
      "option": [
        "使用MD5算法实现重要数据存储机密性保护",
        "使用SM4算法实现重要数据存储机密性保护",
        "使用SM3算法实现重要数据存储机密性保护",
        "使用SHA-256算法实现重要数据存储机密性保护"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4431",
      "title": "依据《信息系统密码应用高风险判定指引》，在没有采用密码技术保证进入机房人员身份鉴别安全的情况下，以下能够降低安全风险的措施是（）。",
      "option": [
        "采用用户名+口令+ID卡方式鉴别进入人员身份",
        "人员信息自行登记后进入",
        "机房出入口配备专人值守并进行登 记，且采用视频监控系统进行实时监控",
        "机房禁止外部人员进入"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "4432",
      "title": "依据《信息系统密码应用高风险判定指引》，以下对于通用要求中“密码技术”描述正确的是（）。",
      "option": [
        "该要求适用级别为一级到四级信息系统",
        "若采用OpenSSL协议库实现TLS，则一定不会导致高风险",
        "指标要求为“信息系统中使用的密码技术应遵循密码相关国家标准和行业标准”",
        "若使用TLS 1.1,则一定会导致高风险"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "4433",
      "title": "依据《信息系统密码应用高风险判定指引》，以下对通用要求中“密码产品”描述不正确的是（）。",
      "option": [
        "使用了具有电子认证服务密码使用许可证的CA机构签发是数字证书，一定不会导致高风险",
        "使用自实现且未提供安全性证明的密码产品，可能会导致高风险",
        "使用存在高危安全漏洞的公开算法 库，可能会导致高风险",
        "三级信息系统中，使用了安全等级二级的密码产品，也可能会导致高风险"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4434",
      "title": "对测评单元“重要数据存储完整性”的测评结果如果为“部分符合”，依据《信息系统密码应用高风险判定指引》，以下哪些情况可以缓解风险（）。",
      "option": [
        "应用系统具有符合要求的身份鉴别措施，保证只有授权人员才能访问应用系统的重要数据，且定期对重要数据进行备份",
        "对数据进行加密存储保护",
        "定期对重要数据进行备份",
        "对数据进行加密传输保护"
      ],
      "answer": "A",
      "analysis": "可能的缓解措施：应用系统具有符合要求的身份鉴别措施，保证只有授权人员才能访问应用系统的重要数据，且定期对重要数据进行备份。"
    },
    {
      "id": "4435",
      "title": "在设备和计算安全层中，依据《信息系统密码应用高风险判定指引》，能够降低服务器身份鉴别安全风险的措施是（）。",
      "option": [
        "采用设备指纹方式登录服务器",
        "采用手机短信验证码方式登录服务器",
        "登录堡垒机后，再输入用户名+口令的方式，登录服务器",
        "采用进入机房，本地运维的方式进行服务器管理"
      ],
      "answer": "A",
      "analysis": "8.1身份鉴别：采用密码技术对登录设备的用户进行身份鉴别，保证用户身份的真实性。可能的缓解措施：基于特定识别技术（如设备指纹、生物指纹等）保证用户身份的真实性。"
    },
    {
      "id": "4436",
      "title": "SSL   VPN 设 备 采 用 HTTPS 协 议 进 行 管 理（ TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384），依据《信息系统密码应用高风险判定指引》，对远程管理通道安全测评指标的结果判定最合理的是（）。",
      "option": [
        "符合",
        "部分符合",
        "不适用",
        "不符合"
      ],
      "answer": "B",
      "analysis": "非国产"
    },
    {
      "id": "4437",
      "title": "数据库服务器采用SSH协议进行远程管理，协议中使用非国密算法保障远程管理通道的安全，且经漏洞扫描发现SSH协议存在高风险漏洞。依据《信息系统密码应用高风险判定指引》，以下对远程管理通道安全测评指标结果判定正确的是（）。",
      "option": [
        "0.5分",
        "0分",
        "存在高风险安全问题",
        "存在低风险安全问题"
      ],
      "answer": "C",
      "analysis": ""
    },
    {
      "id": "4438",
      "title": "根据《信息系统密码应用高风险判定指引》，对采用密码技术实现数据完整性和机密性保护，说法错误的是（）。",
      "option": [
        "业务系统中对身份证号、手机号等重要个人信息不应采用杂凑算法保证其机密性",
        "数据完整性保护主要基于杂凑算法或数字签名算法实现",
        "数据机密性主要基于对称或非对称密码算法实现",
        "数据完整性和机密性应使用相同的密码算法实现"
      ],
      "answer": "D",
      "analysis": ""
    },
    {
      "id": "4439",
      "title": "根据《信息系统密码应用高风险判定指引》，通常使用（）方法来实现数据原发行为的不可否认性和数据接收行为的不可否认性。",
      "option": [
        "加密",
        "时间戳",
        "数字签名",
        "手写签字"
      ],
      "answer": "C",
      "analysis": "在可能涉及法律责任认定的应用中，未采用基于公钥密码算法的数字签名机制等密码技\n术对数据原发行为和接收行为实现不可否认性"
    },
    {
      "id": "4440",
      "title": "依据《信息系统密码应用高风险判定指引》，（）是建立评估对象所需密钥管理策略和密钥管理规则的主要依据。",
      "option": [
        "评审通过的密码应用方案",
        "系统安全性设计方案",
        "系统建设实施方案",
        "项目立项报告"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4441",
      "title": "某面向公众的三级门户网站系统通过部署经检测认证合格的安全网关（密码模块二级）， 使用 TLS  _ECDHE_  RSA_WITH  _AES_  256_  GCM_SHA384密码算法套件，实现通信过程中重要数据的机密性和完整性保护，则根据《信息系统密码应用高风险判定指引》，以下对该密码技术实现方式的风险分析描述正确的是（）。",
      "option": [
        "使用的密码算法可能不合规",
        "存在密钥被非法授权篡改，或密钥与实体之间的关联关系被非法授权篡改的风险",
        "密钥质量随机性不好，存在被攻击者猜测的风险",
        "存在通信数据在信息系统外部被截取、篡改的风险"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4442",
      "title": "根据《信息系统密码应用高风险判定指引》，网络和通信安全层面的身份鉴别高风险适用于以下信息系统（）。",
      "option": [
        "一级信息系统",
        "二级信息系统",
        "三级及以上级别信息系统",
        "二级及以上级别信息系统"
      ],
      "answer": "C",
      "analysis": "《高风险判定指引》7.1"
    },
    {
      "id": "4443",
      "title": "依据《信息系统密码应用高风险判定指引》，以下关于网络和通信安全层面“通信过程中重要数据机密性”风险缓解措施有效的是（）。",
      "option": [
        "在“应用和数据安全”层面仅针对信息系统部分重要数据传输采用符合要求的密码技术进行机密性保护，且加密后的数据流能够覆盖网络通信信道",
        "在“应用和数据安全”层面对信息系统所有需要保护的重要数据传输采用符合要求的密码技术进行机密性保护，且加密后的数据流能够覆盖网络通信信道",
        "针对内网访问的信息系统，因不涉及互联网数据传输，所以可以降低网络和通信安全层面“通信过程中重要数据的机密性”面临的安全风险",
        "通过专线进行数据传输的通道，可以认为专线面临的安全风险可控，能够降低其面临的安全风险"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4444",
      "title": "依据《信息系统密码应用高风险判定指引》，密钥更新环节可能会对密钥安全造成安全隐患的是（）。",
      "option": [
        "按照制定的密钥生命周期的安全管理策略执行",
        "未建立密钥已泄露或存在泄露风险时的密钥更新机制",
        "在更新密钥过程 中，填写相关表格进行记录",
        "密钥定期备份"
      ],
      "answer": "B",
      "analysis": "《高风险判定指引》附录A"
    },
    {
      "id": "4445",
      "title": "依据《信息系统密码应用高风险判定指引》，网络和通信安全层面如果通信实体身份真实性的密码技术实现机制（）或无效，可能会导致信息系统面临高风险。",
      "option": [
        "不科学",
        "不安全",
        "不完整",
        "不正确"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4446",
      "title": "依据《信息系统密码应用高风险判定指引》，以下对通用要求“密码算法”描述不正确的是（）。",
      "option": [
        "指标要求是“信息系统中使用的密码算法应符合密码相关国家标准、行业标准的有关要求”",
        "对所有不同安全等级的信息系统均适用",
        "存在可能的缓解措施",
        "若信息系统中采用 OpenSSL算法库实现 AES，为信息系统提供加密保护，则会导致高风险"
      ],
      "answer": "CD",
      "analysis": "《高风险判定指引》5.1"
    },
    {
      "id": "4447",
      "title": "依据《信息系统密码应用高风险判定指引》，以下对通用要求中“密码算法”的描述正确的是（）。",
      "option": [
        "采用DES算法提供数据加密，则很可能导致高风险",
        "采用SHA-1提供口令存储完整性保护，则很可能导致高风险",
        "采用自行设计的数据处理算法，达到将数据不可读的目的，则该算法依然可能导致高风险",
        "采用MD5 with RSA2048进行数字签名，不会导致高风险"
      ],
      "answer": "ABC",
      "analysis": "该部分包括以下内容:\na)指标要求:信息系统中使用的密码算法应符合法律、法规的规定和密码相关国家标准、行业\n标准的有关要求。\nb)适用范围:所有级别信息系统\n安全问题:\nc)\nMD5\n1)采用存在安全问题或安全强度不足的密码算法对重要数据进行保护，\nDES.\nSHA-1、RSA(不足2048比特)等密码算法;\n2)采用安全性未知的密码算法，如自行设计的密码算法、经认证的密码产品中未经安全性\n论证的密码算法。\nd)可能的缓解措施:无。\n风险评价:上述安全问题一旦被威胁利用后，可能会导致信息系统面临高等级安全风险。\ne)"
    },
    {
      "id": "4448",
      "title": "在《信息系统密码应用高风险判定指引》中，以下属于不安全的密码算法是（）。",
      "option": [
        "SM2",
        "SHA-1",
        "RSA-1024",
        "MD5"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "4449",
      "title": "在《信息系统密码应用高风险判定指引》中,以下属于密码算法安全问题的是（）。",
      "option": [
        "采用了安全强度不够的密码算法",
        "自行设计的密码算法",
        "采用未经安全性论证的密码算法",
        "采用了符合法律、法规规定和密码相关国家标准、行业标准有关要求的算法"
      ],
      "answer": "ABC",
      "analysis": ""
    },
    {
      "id": "4450",
      "title": "某单位管理员远程登录服务器时，采用密码协议保证远程管理通道安全，依据《信息系统密码应用高风险判定指引》，避免带来高风险，以下可能采用的协议包括（）。",
      "option": [
        "SSH 2.0",
        "SSL 2.0",
        "SSL 3.0",
        "TLS 1.2"
      ],
      "answer": "AD",
      "analysis": "安全问题:\n使用存在缺陷或有安全问题警示的密码技术，如SSH1.0、SSL2.0、SSL3.0、TLS1.0等.\n0\n使用安全性未知的密码技术，如自行设计的密码通信协议、未经安全性论证的密码通信\n2)\n协议等。\n可能的缓解措施:无。\n风险评价:上述任一安全问题一旦被威胁利用后，可能会导致信息系统面临高风险。"
    },
    {
      "id": "4451",
      "title": "在《信息系统密码应用高风险判定指引》中，未涉及的安全问题场景，以下判定其风险程度的做法正确的是（）。",
      "option": [
        "结合实际场景客观判断",
        "无需关注",
        "需分析考虑是否对其造成严重的安全隐患",
        "直接判定为中或低风险"
      ],
      "answer": "AC",
      "analysis": ""
    },
    {
      "id": "4452",
      "title": "在《信息系统密码应用高风险判定指引》中，对高风险判定，从（）方面进行了描述。",
      "option": [
        "指标要求",
        "适用范围",
        "安全问题",
        "可能的缓解措施和风险评价"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4453",
      "title": "密评过程中发现的问题，在《信息系统密码应用高风险判定指引》中没有相关描述的，仍需从（）方面核查该问题是否存在风险。",
      "option": [
        "密码算法",
        "密码技术",
        "密码产品",
        "密码服务"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4454",
      "title": "依据《信息系统密码应用高风险判定指引》，采用密码技术对重要区域进入人员进行身份鉴别的措施可包括（）。",
      "option": [
        "采用动态口令机制",
        "基于对称密码算法或密码杂凑算法的消息鉴别码（MAC）机制",
        "基于公钥密码算法的数字签名机制",
        "基于生物特征识别"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4455",
      "title": "依据《信息系统密码应用高风险判定指引》，属于物理和环境安全层面身份鉴别方面引发的安全问题的是（）。",
      "option": [
        "对进出机房人员采用的身份鉴别类产品不符合密码产品相关要求",
        "对进出机房人员的身份鉴别机制无效",
        "机房未采用视频监控系统",
        "对进出机房人员未采用基于密码技术的身份鉴别措施"
      ],
      "answer": "AB",
      "analysis": ""
    },
    {
      "id": "4456",
      "title": "在《信息系统密码应用高风险判定指引》中，对网络和通信安全层面的通信实体进行身份鉴别时，引发高风险的原因可能是（）。",
      "option": [
        "密码技术实现机制不正确或无效",
        "未采用基于消息鉴别码（MAC）的机制",
        "未采用数字签名机制",
        "采用的密码产品未获得商用密码产品认证证书"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4457",
      "title": "某信息系统的用户仅使用“用户名+口令”方式进行登录系统，根据《信息系统密码应用高风险判定指引》，以下（）措施可以缓解这种登录方式带来的风险",
      "option": [
        "设备指纹",
        "人脸识别",
        "第三方身份鉴别服务",
        "指纹识别"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4458",
      "title": "设备指纹是指可以用于标识出该设备的设备特征或者独特的设备标识，用于区分和识别不同的设备。按照《信息系统密码应用高风险判定指引》的规定，设备指纹因子包括（）。",
      "option": [
        "计算机的操作系统类型",
        "设备的硬件ID",
        "手机的IMEI",
        "电脑的网卡MAC地址"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4459",
      "title": "用户先通过SSL VPN接入信息系统内网，然后再通过浏览器登录系统内部应用。根据《信息系统密码应用高风险判定指引》，以下对该系统风险缓解的描述，合理的有（）。",
      "option": [
        "用户通过使用智能密码钥匙登录SSL VPN，经测评为符合；因此，该应用的用户角色的“身份鉴别”指标的风险可以适当降低",
        "如果SSL VPN所涉及的通信信道对应的“网络和应用安全”层面的“身份鉴别”指标均为符合，那么应用和数据安全层面的“身份鉴别”指标的风险可以适当降低",
        "如果SSL VPN所涉及的通信信道相应的“网络和应用安全”层面的“通信过程中重要数据的机密性”指标均为符合，那么应用和数据安全层面的“重要数据传输机密性”指标的风险可以适当降低",
        "《信息系统密码应用高风险判定指引》不涉及“网络和应用安全”层面的“重要数据传输完整性”指标，因此该指标不会存在高风险"
      ],
      "answer": "AC",
      "analysis": ""
    },
    {
      "id": "4460",
      "title": "在《信息系统密码应用高风险判定指引》中，以下存储保护方式会导致系统在“重要数据存储完整性”方面存在高危风险的有（）。",
      "option": [
        "使用SHA1 With RSA-2048进行数字签名",
        "使用SM3杂凑算法对数据进行杂凑计算，杂凑值与数据一同存放",
        "使用SM4-GCM算法对数据进行加密保护",
        "使用HMAC-SM3对数据进行MAC计算，但是仅截取MAC的8个比特进行使用"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "4461",
      "title": "在《信息系统密码应用高风险判定指引》中，以下存储保护方式会导致系统在“重要数据存储机密性”方面存在高危风险的有（）。",
      "option": [
        "使用DES-CBC进行数字签名",
        "使用SM4-CBC算法加密",
        "使用RSA-1024算法对SM4密钥加密",
        "使用SM4-GCM算法对数据进行加密保护"
      ],
      "answer": "AC",
      "analysis": "密码算法：采用存在安全问题或安全强度不足的密码算法对重要数据进行保护，如MD5、DES、SHA-1、RSA（不足2048比特）等密码算法；SM4无线局域网标准的分组数据算法。对称加密，密钥长度和分组长度均为128位，SM4算法主要包含5种基本模式:ECB、CBC、CFB、OFB，CTR(后4种都是ECB算法模块衍生而来)"
    },
    {
      "id": "4462",
      "title": "在《信息系统密码应用高风险判定指引》中，以下实现用户身份真实性的措施，不会带来安全问题的是（）。",
      "option": [
        "生物指纹技术",
        "动态口令机制",
        "基于对称密码算法或密码杂凑算法的消息鉴别码（MAC）机制",
        "基于公钥密码算法的数字签名机制"
      ],
      "answer": "BCD",
      "analysis": "6.1章节"
    },
    {
      "id": "4463",
      "title": "《信息系统密码应用高风险判定指引》中，在应用和数据安全层面，采用以下（）措施，可以可缓解系统在用户身份鉴别方面存在的安全风险。",
      "option": [
        "采用设备指纹保证用户身份的真实性",
        "采用生物指纹保证用户身份的真实性",
        "采用第三方身份鉴别服务保证用户身份的真实性",
        "绑定登录用户终端的IP地址"
      ],
      "answer": "ABC",
      "analysis": "9.1身份鉴别，可能的缓解措施：基于特定识别技术（如设备指纹、生物指纹、第三方身份鉴别服务等）保证用户身份的真实性"
    },
    {
      "id": "4464",
      "title": "在《信息系统密码应用高风险判定指引》中，使用（）身份鉴别方式，可能会触发应用和数据安全层面“身份鉴别”的风险判定。",
      "option": [
        "USB-Key",
        "动态口令机制",
        "短信验证码",
        "邮箱验证码"
      ],
      "answer": "CD",
      "analysis": "CD不涉及密码技术"
    },
    {
      "id": "4465",
      "title": "在《信息系统密码应用高风险判定指引》中，使用（）方法不会触发应用和数据层面“重要数据传输机密性”的风险判定。",
      "option": [
        "采用标准tls 1.2协议",
        "基于SM4-CBC对称密码算法",
        "基于SM2非对称密码算法",
        "基于Base64编码的方式"
      ],
      "answer": "ABC",
      "analysis": "base64容易破解，不安全，其余是比较安全的算法。"
    },
    {
      "id": "4466",
      "title": "在《信息系统密码应用高风险判定指引》中，（）属于应用和数据层面“重要数据存储机密性”的涉及范围。",
      "option": [
        "业务系统采用AES加密存储数据",
        "使用SM3密码算法保存了银行客户的身份证号，以便发给公安系统进行比对",
        "使用HMAC-SM3算法对关键业务数据进行完整性保护",
        "使用SM4算法实现重要数据传输的机密性"
      ],
      "answer": "AB",
      "analysis": "C是完整性、D是传输过程"
    },
    {
      "id": "4467",
      "title": "依据《信息系统密码应用高风险判定指引》，下列说法错误的是（）。",
      "option": [
        "可使用密码杂凑算法的消息鉴别码（MAC）机制解决数据传输机密性的高风险问题",
        "可使用基于公钥密码算法的数字签名机制解决数据存储完整性问题",
        "三级及以上信息系统一定存在不可否认性的高风险问题",
        "使用RSA1024算法可解决重要数据存储机密性问题"
      ],
      "answer": "ACD",
      "analysis": "MAC单向函数，无法解决机密性问题，A错；公钥密码算法数字签名可保障完整性，B对；业务场景不一定有不可否认性场景，C错；RSA1024高风险算法，D错。"
    },
    {
      "id": "4468",
      "title": "依据《信息系统密码应用高风险判定指引》，在应用和数据安全层面，可能存在高风险项的是（）。",
      "option": [
        "身份鉴别",
        "重要数据传输机密性",
        "重要数据传输完整性",
        "重要数据存储完整性"
      ],
      "answer": "ABD",
      "analysis": "存储完整性无可缓解措施"
    },
    {
      "id": "4469",
      "title": "依据《信息系统密码应用高风险判定指引》，密评过程中主要关注的管理制度有（）。",
      "option": [
        "密码人员管理",
        "密钥管理",
        "建设运行",
        "应急处置"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4471",
      "title": "依据《信息系统密码应用高风险判定指引》，以下内容可能会给密钥管理带来安全隐患的是（）。",
      "option": [
        "未采用通过检测认证合格的随机数发生器生成密钥，且无公开文献和证据证明随机数发生器的合理性和正确性",
        "密钥在不可控的环境中生成",
        "密钥协商之前或协商过程中没有验证对方身份真实性",
        "密钥由具有商用密码认证证书的密码产品产生"
      ],
      "answer": "ABC",
      "analysis": ""
    },
    {
      "id": "4472",
      "title": "依据《信息系统密码应用高风险判定指引》，密钥分发环节可采取的安全措施有（）。",
      "option": [
        "使用没有访问控制机制的存储介质（如普通信封、普通U盘）等传输明文密钥",
        "密钥在可控的环境中分发，使用了密码技术保护密钥的机密性和完整性",
        "分发密钥时，一人可领取多段密钥",
        "密钥明文及其组件采用电子邮件、传真、电传、电话等方式直接传递"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4473",
      "title": "依据《信息系统密码应用高风险判定指引》，密钥销毁和撤销环节可能会对密钥管理带来安全隐患是（）。",
      "option": [
        "不具备密钥在应急情况下的密钥销毁/撤销的机制",
        "未按照设定的安全机制进行密钥销毁/撤销",
        "对于磁记录存储器存储的密钥，简单的删除、清0或写1即可",
        "停止使用的密钥一般不要立即毁掉，而需再保存一段时间然后再毁掉"
      ],
      "answer": "ABC",
      "analysis": "C虽然在原文没有，但是确实会带来风险"
    },
    {
      "id": "4474",
      "title": "在《信息系统密码应用高风险判定指引》中，对“通用要求”部分的理解正确的是（）。",
      "option": [
        "指标要求来自于 GB/T 39786《信息安全技术 信息系统密码应用基本要求》的通用要求部分",
        "描述的内容适用范围是从二级到四级信息系统",
        "不存在可能的缓解措施",
        "若出现相应安全问题的情形，则一定会导致高风险"
      ],
      "answer": "AC",
      "analysis": "本文件中判定内容由指标要求、适用范围、安全问题、可能的缓解措施和风险评价构成。其中，指标要求源自GB/T39786—2021的部分指标，对于本文件未覆盖的其他指标，仍需核查本文件第5章通用要求中密码算法、密码技术、密码产品和密码服务相关安全问题是否存在\n适用范围：所有级别信息系统。\n可能的缓解措施：无。\n风险评价：上述任一安全问题一旦被威胁利用后，可能会导致信息系统面临高风险"
    },
    {
      "id": "4475",
      "title": "依据《信息系统密码应用高风险判定指引》，对于通用要求“密码算法”的描述正确的是（）。",
      "option": [
        "描述的内容适用范围为所有级别信息系统",
        "RSA（不足2048比特）可能会导致高风险",
        "采用自行设计的密码算法可能会导致高风险",
        "使用MD5杂凑算法可能导致高风险"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4476",
      "title": "依据《信息系统密码应用高风险判定指引》，对于通用要求“密码技术”的描述正确的是（）。",
      "option": [
        "测评过程中，在该方面若发现问题，存在可能的缓解措施",
        "系统采用了未经安全性论证的密码协议，可能会给系统带来高风险",
        "使用TLS 1.0协议实现对通信信道的保护，可能会导致高风险",
        "信息系统选用密码技术时，需考虑该密码技术是否遵循密码相关国家标准和行业标准"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "4477",
      "title": "依据《信息系统密码应用高风险判定指引》，对于通用要求“密码算法”的描述不正确的是（）。",
      "option": [
        "存在安全问题或安全强度不足的密码算法可能会导致高风险",
        "使用自行设计的密码算法可能会导致高风险",
        "未经安全性论证的密码算法可能会导致高风险",
        "该指标对应的密码算法不仅要符合法律要求，还应遵循国家标准"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4478",
      "title": "依据《信息系统密码应用高风险判定指引》，通用要求“密码产品和密码服务”中，密码产品存在可能导致高风险的问题有（）。",
      "option": [
        "密码产品在使用时未按照产品的安全策略文档部署和使用",
        "不具有商用密码产品认证证书",
        "密码服务提供商不具有相关资质",
        "密码厂商自研一套软件密码模块，但无法提供该密码产品的安全性证明结论"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4479",
      "title": "根据《信息系统密码应用高风险判定指引》，下列属于密钥管理环节的是（）。",
      "option": [
        "产生",
        "撤销",
        "备份",
        "恢复"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4480",
      "title": "依据《信息系统密码应用高风险判定指引》，某三级信息系统主备机房，采用8位以上的口令，对进入机房的用户进行身份鉴别。以下针对身份鉴别测评指标的符合性判定以及针对问题风险的判定正确的是（）。",
      "option": [
        "不符合",
        "高风险",
        "部分符合",
        "中风险"
      ],
      "answer": "AB",
      "analysis": "静态口令未采用密码技术，为不符合\n无其他风险缓解措施"
    },
    {
      "id": "4481",
      "title": "依据《信息系统密码应用高风险判定指引》，某三级信息系统主备机房，采用人脸识别技术对进入机房的用户进行身份鉴别，并在机房出入口配备专人值守，并保留了人员进出记录，以下针对身份鉴别测评指标的符合性判定以及针对问题风险的判定正确的是（）。",
      "option": [
        "不符合",
        "高风险",
        "部分符合",
        "中风险"
      ],
      "answer": "AD",
      "analysis": "生物识别未采用密码技术，为不符合\n生物识别+有人值守，可降低风险，但不改变符合性结果"
    },
    {
      "id": "4482",
      "title": "依据《信息系统密码应用高风险判定指引》，以下措施能够缓解设备和计算安全层面远程管理通道安全测评项的高风险的是（）。",
      "option": [
        "采用带外管理的方式对所有设备进行远程管理",
        "所有运维人员均需要通过堡垒机进行身份认证",
        "所有设备均需要运维人员通过SSL VPN设备进行远程管理，且采用的密码技术符合要求",
        "运维人员采用两种身份鉴别措施对设备进行远程管理，其中一种身份鉴别措施为密码技术"
      ],
      "answer": "AC",
      "analysis": "题干说的是远程管理与身份鉴别没有关系"
    },
    {
      "id": "4483",
      "title": "根据《信息系统密码应用高风险判定指引》，以下采用的措施对物理和环境安全的身份鉴别，可能带来安全风险的是（）。",
      "option": [
        "采用口令方式鉴别进入人员身份",
        "采用ID卡方式鉴别进入人员身份",
        "采用指纹识别方式鉴别进入人员身份",
        "机房采用物理锁方式控制人员进出"
      ],
      "answer": "ABCD",
      "analysis": "只要是不符合都可能带来风险"
    },
    {
      "id": "4484",
      "title": "依据《信息系统密码应用高风险判定指引》，若未采用密码技术对重要区域进入人员进行身份鉴别，但基于生物识别技术（如指纹等）保证人员身份真实性，可酌情降低风险等级。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4485",
      "title": "根据《信息系统密码应用高风险判定指引》，依据相关密码算法标准自行开发实现的国密算法满足标准要求。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4486",
      "title": "根据《信息系统密码应用高风险判定指引》，远程管理设备时，未采用密码技术建立安全的信息传输通道且无缓解措施的情况下，风险分析应判断为高风险。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4487",
      "title": "依据《信息系统密码应用高风险判定指引》，在应用和数据安全层面，未采用密码技术对登录用户进行身份鉴别，保证应用系统用户身份的真实性，但基于特定识别技术（如设备指纹、生物指纹、第三方身份鉴别服务等）保证用户身份的真实性，可酌情降低风险。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4488",
      "title": "根据《信息系统密码应用高风险判定指引》，在应用和数据安全层面，未采用密码技术保证信息系统应用的重要数据在传输过程中的机密性，可直接判定为高风险问题。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4489",
      "title": "根据《信息系统密码应用高风险判定指引》，第二级及以上级别信息系统，未采用密码技术保证信息系统应用的重要数据在存储过程中的完整性，可直接判定为高风险问题。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "存储完整性高风险要密评三级以上"
    },
    {
      "id": "4491",
      "title": "根据《信息系统密码应用高风险判定指引》，应确保三级以上的信息系统中使用的密码算法符合法律、法规的规定和密码相关国家标准、行业标准的有关要求，其他级别可酌情考虑。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4492",
      "title": "根据《信息系统密码应用高风险判定指引》，若信息系统所使用的密码技术未遵循密码相关国家标准和行业标准，则一定会导致信息系统面临高等级安全风险。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4493",
      "title": "根据《信息系统密码应用高风险判定指引》，若信息系统中使用了存在安全问题的密码产品、密码服务，则可通过采取一定的缓解措施来降低可能的风险。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "高风险判定指引，密码技术、算法、产品、服务无缓解措施。"
    },
    {
      "id": "4495",
      "title": "信息系统测评过程中的风险判定只需依据《信息系统密码应用高风险判定指引》所列出的相关安全问题所引发的风险等级做出判断。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4496",
      "title": "依据《信息系统密码应用高风险判定指引》，缓解措施是指可以降低威胁利用安全问题导致安全事件发生造成严重程度的安全措施。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4497",
      "title": "《信息系统密码应用高风险判定指引》中所涉及的指标要求包括了《信息安全技术 信息系统密码应用基本要求》所有要求项。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4498",
      "title": "依据《信息系统密码应用高风险判定指引》，虽未采用密码技术对重要区域进入人员进行身份鉴别，但基于生物识别技术（如指纹等）同样保证了人员身份真实性，可酌情降低风险等级。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4499",
      "title": "依据《信息系统密码应用高风险判定指引》，在网络和通信安全中，通信实体身份鉴别方面的高风险问题可以有缓解措施。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4500",
      "title": "依据《信息系统密码应用高风险判定指引》，在网络通信过程中，重要数据机密性方面的高风险问题有缓解措施。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4501",
      "title": "依据《信息系统密码应用高风险判定指引》，在网络和通信安全中，安全接入认证方面的高风险问题没有缓解措施。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "可能的缓解措施：无。"
    },
    {
      "id": "4502",
      "title": "《信息系统密码应用高风险判定指引》中，安全接入认证方面的要求适用范围包含三级和四级信息系统。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "适用范围：第四级信息系统。"
    },
    {
      "id": "4503",
      "title": "依据《信息系统密码应用高风险判定指引》，设备和计算安全中，身份鉴别方面的高风险问题没有缓解措施。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "可能的缓解措施：基于特定识别技术（如设备指纹、生物指纹等）保证用户身份的真实性。"
    },
    {
      "id": "4504",
      "title": "依据《信息系统密码应用高风险判定指引》，设备和计算安全层面的身份鉴别，必须采用密码技术保证用户身份的真实性，没有缓解措施。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "可能的缓解措施：基于特定识别技术（如设备指纹、生物指纹等）保证用户身份的真实性。"
    },
    {
      "id": "4505",
      "title": "依据《信息系统密码应用高风险判定指引》，业务系统用户登录时，系统可通过用户名、口令的鉴别方式实现用户身份的鉴别。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "c)安全问题：\n1)存在第5章通用要求中密码算法、密码技术、密码产品和密码服务相关安全问题；\n2)未采用动态口令机制、基于对称密码算法或密码杂凑算法的消息鉴别码（MAC）机制、\n基于公钥密码算法的数字签名机制等密码技术对登录用户进行身份鉴别；\n3)用户身份真实性的密码技术实现机制不正确或无效；\n4)采用的密码产品未获得商用密码认证机构颁发的商用密码产品认证证书（适用时）。\n\nd)可能的缓解措施：基于特定识别技术（如设备指纹、生物指纹、第三方身份鉴别服务等）保\n证用户身份的真实性。"
    },
    {
      "id": "4506",
      "title": "依据《信息系统密码应用高风险判定指引》，业务用户登录时，可使用基于动态令牌的身份鉴别方式实现用户身份的鉴别，其中采用DES算法生成动态令牌。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "c)安全问题：\n1)使用存在安全问题或安全强度不足的密码算法对重要数据进行保护，如MD5、DES、\nSHA-1、RSA（不足2048比特）等密码算法"
    },
    {
      "id": "4507",
      "title": "依据《信息系统密码应用高风险判定指引》，业务用户登录系统时，系统对登录用户仅采用指纹认证的方式进行身份鉴别，由于鉴别过程未采用密码技术实现，则用户身份真实性方面可判定存在高风险问题。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "可能的缓解措施：基于特定识别技术（如设备指纹、生物指纹等）保证用户身份的真实性。"
    },
    {
      "id": "4508",
      "title": "依据《信息系统密码应用高风险判定指引》，系统可采用RSA1024密码算法，实现信息系统重要数据在传输过程中的机密性。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "c)安全问题：\n1)使用存在安全问题或安全强度不足的密码算法对重要数据进行保护，如MD5、DES、\nSHA-1、RSA（不足2048比特）等密码算法"
    },
    {
      "id": "4509",
      "title": "依据《信息系统密码应用高风险判定指引》，在“网络和通信安全”层面，采用符合要求的密码技术为网络通信信道提供机密性保护，且网络通信信道经评估无高风险，可酌情降低“应用和数据安全 ”层面未采用密码技术对重要数据进行传输机密性保护的风险等级。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "风险评价：若未采用密码技术的加解密功能对重要数据在传输过程中进行机密性保护，或重要数据传输机密性保护的实现机制不正确或无效，但在“网络和通信安全”层面通信实体间采用符合要求的密码技术建立网络通信信道，且网络通信信道经评估无高风险，可酌情降低风险等级。"
    },
    {
      "id": "4510",
      "title": "依据《信息系统密码应用高风险判定指引》，使用MD5算法实现对重要数据存储完整性保护，可判定为高风险问题。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "安全问题：\n1)使用存在安全问题或安全强度不足的密码算法对重要数据进行保护，如MD5、DES、\nSHA-1、RSA（不足2048比特）等密码算法；"
    },
    {
      "id": "4511",
      "title": "依据《信息系统密码应用高风险判定指引》，未采取密码技术措施实现数据原发行为的不可否认性和数据接收行为的不可否认性，则无其他可能的缓解措施对该问题风险进行缓解。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "a)指标要求：在可能涉及法律责任认定的应用中，采用密码技术提供数据原发证据和数据接收证据，实现数据原发行为的不可否认性和数据接收行为的不可否认性。\nd)可能的缓解措施：无。"
    },
    {
      "id": "4512",
      "title": "依据《信息系统密码应用高风险判定指引》，现场“对密码关键岗位人员进行上岗培训”测评时，测评人员应核查安全教育和培训计划文档是否具有针对涉及密码应用的操作和管理人员的培训计划，以及开展培训的记录。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "高风险判定指引中未提及，根据GMT0115，应当全部核查"
    },
    {
      "id": "4513",
      "title": "依据《信息系统密码应用高风险判定指引》，针对存量系统要制定密码应用整改方案，该方案可不进行评审。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "安全问题：信息系统未制定密码应用方案或密码应用方案未通过评审。"
    },
    {
      "id": "4514",
      "title": "依据《信息系统密码应用高风险判定指引》，密钥在恢复使用时，在对其他系统缺乏鉴别机制的情况下，可以被导入到其他系统中。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "密钥恢复环节可能会对密钥管理造成严重安全隐患的安全问题主要包括：\n1)密钥在恢复使用时没有鉴别机制，可以被导入到其他系统中。"
    },
    {
      "id": "4515",
      "title": "依据《信息系统密码应用高风险判定指引》，密码应用安全管理制度描述的内容适用范围是三级及以上级别信息系统。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "适用范围：第二级及以上级别信息系统。"
    },
    {
      "id": "4516",
      "title": "依据《信息系统密码应用高风险判定指引》，在通用要求的“密码技术”方面发现的高风险问题，存在可能的缓解措施。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "可能的缓解措施：无。"
    },
    {
      "id": "4517",
      "title": "未纳入《信息系统密码应用高风险判定指引》的指标条款，则一定不会导致高风险情形。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "由于信息系统密码应用场景的复杂性，本文件无法涵盖密码应用的所有高风险安全问题，对于本文\n件未涉及但确实可能会对信息系统造成严重安全隐患的安全问题，应结合信息系统的实际情况对相关安\n全问题所引发的风险等级做出客观判断。在某些情况下，受限于具体场景的安全需求和各项条件，本文\n件给出的安全问题也可能不会导致信息系统面临较高安全风险，在信息系统密码应用的规划、建设、运\n行及测评时应结合具体场景进行合理判定。"
    },
    {
      "id": "4519",
      "title": "按照《信息系统密码应用高风险判定指引》，某信息系统的用户仅使用“用户名+口令”方式进行登录，则“应用和数据安全”层面的“身份鉴别”指标判定为不符合，但是不会存在高危风险。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "若未采用密码技术对登录用户进行身份鉴别，或用户身份真实性的密码技术实现\n机制不正确或无效，基于特定识别技术（如设备指纹、生物指纹、第三方身份鉴别服务等）保证用户身份的真实性，可酌情降低风险等级。"
    },
    {
      "id": "4521",
      "title": "某信息系统在“网络和通信安全”层面对接入的用户设备进行了身份鉴别，但“应用和数据安全”未对用户进行身份鉴别，而是直接使用了“网络和通信安全”层面的“身份鉴别”结果，默认接入的用户可以登录应用。因此，按照《信息系统密码应用高风险判定指引》，“身份鉴别”指标的风险可以进行适当降低；如果风险降为“低”，则该指标结果可以弥补为“符合”。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "风险评价：若未采用密码技术对登录用户进行身份鉴别，或用户身份真实性的密码技术实现\n机制不正确或无效，基于特定识别技术（如设备指纹、生物指纹、第三方身份鉴别服务等）保\n证用户身份的真实性，可酌情降低风险等级。"
    },
    {
      "id": "4524",
      "title": "按照《信息系统密码应用高风险判定指引》，某二级信息系统在网络和通信安全层面，未使用密码技术实现通信前通信实体的身份鉴别，则密评时网络和通信安全层面身份鉴别测评单元的风险评价结果应为高风险。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "网络层身份鉴别高风险要密评三级以上"
    },
    {
      "id": "4525",
      "title": "依据《信息系统密码应用高风险判定指引》，某四级信息系统在网络和通信安全层面，存在安全接入认证需求，但采用密码技术实现短时间内难以实现，因此，可以通过设置白名单和终端ID绑定方式对该项测评指标面临的安全风险进行缓解。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "没有缓解措施"
    },
    {
      "id": "4526",
      "title": "依据《信息系统密码应用高风险判定指引》，新建二级信息系统如果未制定密码应用方案，密评时不会因未制定密码应用方案而面临高风险。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "适用范围：第二级及以上级别信息系统。"
    },
    {
      "id": "4527",
      "title": "依据《信息系统密码应用高风险判定指引》，二级及以上的信息系统必须具备密码安全管理制度，否则在密评时会因不具备密码应用安全管理制度而面临高风险。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "高风险判定指引，此项不可缓解，缺失就是高风险。见截图。"
    },
    {
      "id": "4544",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，某三级信息系统使用了自行设计（未经检测认证合格）且经过安全性证明的密码算法对业务系统重要数据进行保护，针对“应用和数据安全”层面的“重要数据存储机密性”指标最高可以给（）分。",
      "option": [
        "0.25",
        "0",
        "0.5",
        "1"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4555",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，在编制系统密评报告风险分析部分时，以下描述正确的是（）。",
      "option": [
        "如果系统中使用了 SHA-1算法，那么该系统一定面临高等级安全风险",
        "某个测评指标为不符合，量化评估分值为0分，经过风险分析后发现仅面临低等级安全风险，因此该指标的量化评估分数可以做相应的调整",
        "如果某个安全层面的测评指标为不符合，该指标涉及测评对象测评对象B，其中测评对象A经分析后面临高等级安全风险，测评对象B经分析后面临中等级安全风险，那么该测评指标的最终风险等级应该为中",
        "如果对测评结果中所有的不符合和部分符合项进行分析后发现存在高风险项，则认为信息系统面临高风险；同时也需要考虑多个中低风险叠加可能导致的高风险问题"
      ],
      "answer": "D",
      "analysis": "模板第28页：如果存在高风险项，则认为信息系统面临高风险；同时也需要考虑多个中低风险叠加可能导致的高风险问题。"
    },
    {
      "id": "4556",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，信息系统商用密码应用安全性评估的评估结论能够判定为符合的情况是（）。",
      "option": [
        "系统综合得分不低于60分",
        "系统密码得分为100分",
        "系统密码应用无中、高风险",
        "系统综合得分不低于60分且系统密码应用无高风险"
      ],
      "answer": "B",
      "analysis": "符合就是100分,D是基本符合"
    },
    {
      "id": "4557",
      "title": "密评人员在对某网络安全等级保护定级为第三级的OA办公系统的应急处置安全层面进行测评时发现，该系统责任单位制定并发布了详细的密码应用应急处置策略，在应急处置策略中明确了发生密码应用安全事件时的处置措施、报告流程以及完成事件处置后的汇报机制，设置了相应的责任岗位，相关应急处置策略合理可行，岗位职责明确，但现场测评发现，该系统从上线运行到本次密评，未发生过密码安全事件，且该系统未制定密码应用方案，则以下关于本系统“事件处置”和“向主管部门上报处置情况”两项指标的结果分析描述正确的是（）。",
      "option": [
        "由于被测系统从上线运行至本次密评期间，均未发生密码安全事件，故事件处置、向主管部门上报处置情况均为不适用",
        "由于被测系统从上线运行至本次密评期间，均未发生密码安全事件，仅有相应的应急管理制度，但无法验证其真在发生密码安全事件后能够按照相应的应急制度进行处置，故分别为不符合",
        "由于被测系统从上线运行至本次密评期间，均未发生密码安全事件，仅有相应的应急管理制度，但无法验证其真在发生密码安全事件后能够按照相应的应急制度进行处置，故分别为部分符合",
        "被测系统责任制定并发布了完善的密码应用应急处置策略，策略合理可 行，人员岗位职责明确，故判定为符合"
      ],
      "answer": "D",
      "analysis": ""
    },
    {
      "id": "4564",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，以下有关云平台密评报告编写的描述正确的是（）。",
      "option": [
        "云平台密评报告和传统信息系统密评报告所涉及内容不完全一致",
        "云平台的密评报告中，应在云平台支撑能力分析环节对“被部分评估的支撑能力”的D/A/K分别进行判定",
        "“云平台（密码）支撑能力说明”包含被完全评估的支撑能力、被部分评估的支撑能力两类",
        "在编写云平台密评报告时，被完全评估的支撑能力一般不涉及量化评估和风险判定"
      ],
      "answer": "AC",
      "analysis": ""
    },
    {
      "id": "4567",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，下列关于密评结果备案的说法中，正确的内容包括（）。",
      "option": [
        "密评结果备案的备案主体是信息系统运营者",
        "所属北京市的信息系统的密评结果备案材料应首先提交到北京市密码管理部门",
        "密评机构应每半年填写一次《密评机构工作情况统计表》并报送国家密码管理局",
        "中央和国家机关有关部委规划建设的关键信息基础设施或者国家政务信息系统可以直接将密评结果备案材料报送国家密码管理局"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "4582",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，在文档审查中会涉及的文档有（）。",
      "option": [
        "人员培训计划",
        "安全管理制度文件",
        "密钥管理制度",
        "密码应用方案及评审意见"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4587",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，对于应用和数据安全部分的报告编制，以下说法正确的是（）。",
      "option": [
        "测评指标可分为“应用用户身份鉴别”、“重要数据安全”、“关键操作不可否认性”三类",
        "应用用户可以是应用管理员和业务用户等",
        "重要数据通常可分为“鉴别类”“业务类” “日志类”这三类数据",
        "该安全层面的测评对象为应用系统，而不是应用用户、重要数据等"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4588",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，管理制度中“制定密码应用方案”测评单元结果为部分符合，其量化评估分值不可能为（）。",
      "option": [
        "0",
        "0.25",
        "0.5",
        "1"
      ],
      "answer": "ABD",
      "analysis": ""
    },
    {
      "id": "4592",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，在编制密评报告的整体测评部分时，需要注意的事项有（）。",
      "option": [
        "测评对象作为整体测评时弥补的最小单位",
        "弥补后的测评结果只能是“部分符合”",
        "弥补后的分数最多0.5分",
        "弥补后的分数最多0.25分"
      ],
      "answer": "ABC",
      "analysis": ""
    },
    {
      "id": "4597",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，在编制系统密评报告风险分析环节时，以下情况处理合适的是（）。",
      "option": [
        "某三级信息系统的设备仅支持本地运维，其登录方式为“用户名+口令+指纹 ”，这种情形下设备和计算安全层面的“身份鉴别”指标的风险等级可酌情降低",
        "某第三方支付平台和银行有业务交互需求，在应用和数据安全层面未采用密码技术对重要数据进行传输机密性保护。但采用了符合要求的密码技术建立网络通信信 道，且网络和通信安全层面适用指标的测评结果为满分。因此“重要数据传输机密性”的风险等级可酌情降低",
        "某三级信息系统的设备远程管理路径为：管理员终端- SSL VPN网关-通用设备（静态口令登录）。通用设备只能通过SSL VPN网关访问登录（由访问控制策略保证），若SSL VPN网关登录方式符合密评要求，则通用设备“身份鉴别”的风险等级可酌情降低",
        "某省中心系统和市中心系统有业务交互需求，在网络和通信安全层面未采用密码技术建立安全通信信道，通信报文的传输机密性无法得到保障。但采用了符合要求的密码技术对重要数据传输机密性进行保护，且加密后的数据流能够覆盖网络通信信道。因此“通信过程中重要数据的机密性”的风险等级可酌情降低"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4598",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，对系统密评报告中的风险分析表格描述错误的是（）。",
      "option": [
        "风险分析时可从威胁类型和威胁发生频率等方面阐述",
        "表格中每一行是一个测评对象的问题描述、关联威胁、风险分析和风险等级",
        "在网络和通信安全层面关联的安全威胁包括“非法设备从外部接入内部网络，或网络边界被",
        "在填写表格时，只需要注意识别出的高风险，无需考虑多个中低风险叠加而导致的高风险问"
      ],
      "answer": "BD",
      "analysis": "B按照指标整体对应问题进行风险分析，此处应与安全问题及改进建议章节和单元测评章节内问题一致\nD报告章节6"
    },
    {
      "id": "4601",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，在信息系统密评报告中“密评活动有效性证明记录”部分，应体现的密评活动质量文件有（）。",
      "option": [
        "现场测评授权书及风险告知书",
        "测评方案的评审记录及确认记录",
        "方案密评报告的评审记录及确认记录",
        "系统密评报告的评审记录"
      ],
      "answer": "ABD",
      "analysis": "《商用密码应用安全性评估报告模板(2023版)—系统密评报告》B.3密评活动质量文档：表B-4现场测评授权及风险告知、表B-5测评方案评审、表B-6密评报告评审"
    },
    {
      "id": "4609",
      "title": "按照《商用密码应用安全性评估报告模板（2023版）》，被测信息系统“总体评价”部分的部分符合项及不符合项数量总和，与“安全问题及改进建议”中的高、中风险数量总和应该一致。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "高、中、低风险之和"
    },
    {
      "id": "4617",
      "title": "在《商用密码应用安全性评估报告模板（2023版）》中，如果附录A测评结果记录中某个测评单元的测评对象量化评估结果为0.25分或0.5分，则在“单元测评”环节中该测评对象的结果应写部分符合。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "报告单元测评章节中表格分为测评对象和单元整体的符合性结果，测评对象的应按结果记录中填写，单元结果按照纵列中结果整体判定"
    },
    {
      "id": "4621",
      "title": "在《商用密码应用安全性评估报告模板（2023版）》中，整体测评分为测评结果修正、整体测评结果和量化评估。其中测评结果修正要按测评单元、测评对象，填写弥补前和弥补后的测评结果和分值，并说明弥补原因。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "测评结果修正\n序号\t安全层面\t测评单元\t测评对象\t经弥补前的测评结果/分值\t经弥补后的测评结果/分值 \t弥补原因及相关测评对象"
    },
    {
      "id": "4627",
      "title": "密评人员在编制系统密评报告风险分析部分时，将网络和通信安全“通信过程中重要数据的机密性 ”测评单元降至中低风险，并给出如下分析：在网络和通信安全层面未采用密码技术建立安全通信信道，但采用了符合要求的密码技术对重要数据传输机密性进行保护，因此“通信过程中重要数据的机密性”的风险等级可以酌情降低。报告审核人员认为该风险缓解分析是到位的。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4635",
      "title": "如果基于数字证书方式进行用户的身份鉴别，在进行密评时，以下核查（）不是必要的。",
      "option": [
        "检查根证书如何安全导入或预置到系统内",
        "检查数字证书的合规性",
        "验证数字证书的证书链是否通过",
        "检查数字证书的机密性是如何保证的"
      ],
      "answer": "D",
      "analysis": ""
    },
    {
      "id": "4649",
      "title": "应用服务器的数据库中，用户的单条记录（包括口令杂凑值、身份证号、手机号等密文值、角色、权限等）利用HMAC-SM3计算后， 把得到的 MAC值一并存放在该条目中，针对“应用和数据安全”层面的“重要数据存储完整性”指标判定最多可以给（）分。",
      "option": [
        "0",
        "0.25",
        "0.5",
        "1"
      ],
      "answer": "D",
      "analysis": "未发现必须扣分的地方，所以最多可能给1分"
    },
    {
      "id": "4660",
      "title": "某三级信息系统客户端与服务端之间的网络通信信道使用TLSv1.2协议进行传输保护，使用的密码套件为 TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384，记录层协议中使用（）算法进行通信数据机密性和完整性保护。",
      "option": [
        "ECDHE，RSA",
        "AES_256_GCM,AES_256_GCM",
        "AES-GCM，HMAC- SHA384",
        "AES-GCM，SHA384"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4665",
      "title": "密评人员对SSL VPN进行测评时发现所使用的密码套件为{0xe0，0x13}后，以下判断不合理的是（）。",
      "option": [
        "该套件使用SM2密钥交换算法进行密钥协商",
        "该套件使用SM4- CBC进行数据加密",
        "该套件使用HMAC- SM3进行数据完整性保护",
        "该套件使用SM3作为PRF派生密钥"
      ],
      "answer": "A",
      "analysis": ""
    },
    {
      "id": "4667",
      "title": "在测评时，信息系统声称采用SM4-CBC进行个人隐私信息的存储机密性保护，以下收集的证据与其声称的存在矛盾或证明其使用不合规的包括（）。",
      "option": [
        "密文长度为192比特",
        "密文长度为64比特",
        "IV值以明文形式存储",
        "IV值都为全0"
      ],
      "answer": "ABD",
      "analysis": "DIV全为0时，对于性别这类固定结果的敏感信息加密结果依然固定，无法实现隐私保护"
    },
    {
      "id": "4674",
      "title": "测评人员在测评时，发现以下情况，其中密码应用合规正确的有( )。",
      "option": [
        "通信双方进行加密通信前，使用了双证书中的加密证书进行SM2密钥协商",
        "通信双方使用TLS 1.3进行通信，并将其中的密码算法全部替换为 SM2/SM3/SM4",
        "用户使用SM4-CTR进行加密时，以随机数和当前时间值的拼接作为计数器值，将计数器值以明文形式与密文一并发送给接收方",
        "信息系统使用同一个数据密钥采用 SM4-CBC模式对所有用户的性别信息进行加密保护，并使用全0的IV值"
      ],
      "answer": "AC",
      "analysis": ""
    },
    {
      "id": "4676",
      "title": "密评人员在检查数据库中存储的口令杂凑值时，发现以下情况：（1）A和B有相同的口令杂凑值；（2）口令杂凑值长度均为256比特。以下分析正确的是（）。",
      "option": [
        "可以确定使用了SM3对口令进行杂凑保护",
        "可能采用了MD5对口令进行杂凑计算",
        "计算口令杂凑值时可能未加入用户唯一的盐值",
        "A和B可能共享相同的口令"
      ],
      "answer": "CD",
      "analysis": ""
    },
    {
      "id": "4679",
      "title": "重要数据存储完整性可以通过以下（）密码技术实现。",
      "option": [
        "带盐的SM3",
        "HMAC-SHA256",
        "CMAC-SM4",
        "SM2数字签名"
      ],
      "answer": "BCD",
      "analysis": ""
    },
    {
      "id": "4683",
      "title": "测评人员在核查“真实性”密码功能时，可能需要关注以下内容（）。",
      "option": [
        "发送的挑战值是否每次均不重复",
        "使用对应公钥能否对签名值通过验签操作",
        "公钥或对称密钥与实体的绑定方式",
        "对数字证书格式正确性进行验证"
      ],
      "answer": "ABCD",
      "analysis": "1)实现对用户、设备的真实性鉴别的外接密码产品符合相应密码产品应用的要求;\n2)实体鉴别协议符合GB/T15843的要求;\n3)静态口令的鉴别信息以非明文形式传输,对于使用数字签名进行鉴别，公钥验证签名结果通过,并且符合证书认证系统应用的相关要求:4)公钥和(对称)密钥与实体的绑定方式可靠,部署过程安全"
    },
    {
      "id": "4685",
      "title": "以下关于用户密钥的存储方式， 说法正确的是（）。",
      "option": [
        "数据加密密钥在经过检测认证的三级密码模块中存储",
        "SM2签名私钥经 SM4-GCM加密后存储在数据库中",
        "SM2签名证书明文存储在应用服务器中",
        "SM4密钥经SHA1加密存储在数据库"
      ],
      "answer": "ABC",
      "analysis": "《信息系统密码应用测评要求》附录A\n签名证书是公钥证书"
    },
    {
      "id": "4692",
      "title": "信息系统中使用的用于业务数据保护的密钥，以下做法不正确的是（）。",
      "option": [
        "同一个密钥既用于加密保护又用于安全认证",
        "公钥明文存储在数据库中，未进行完整性保护",
        "在进行签名验签前未对公钥证书有效性进行验证",
        "对签名私钥进行归档"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4695",
      "title": "在对医疗机构信息系统进行测评时，涉及不可否认性需求的可能有（）。",
      "option": [
        "病例完成时间的不可否认性",
        "医护人员开具处方的不可否人性",
        "患者知情同意文书签署的不可否认性",
        "电子病例书写的不可否任性"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4696",
      "title": "某四级信息系统的责任单位可采用以下（）机制以满足“人员管理”方面的要求。",
      "option": [
        "设置密钥管理员、密码安全审计员、密码操作员并分别由甲、乙、丙三人担任",
        "关键岗位人员由机构内部人员担任，并在任前进行背景调查",
        "建立上岗人员培训制度，对涉及密码的操作和管理人员进行专门培训",
        "建立人员保密和调离制度，签订保密合同"
      ],
      "answer": "BCD",
      "analysis": "A要多人共管"
    },
    {
      "id": "4702",
      "title": "关于数字证书的使用，以下存在风险的有（）。",
      "option": [
        "证书中未标明持有者的身份",
        "证书在使用前未验证真实性和有效性",
        "未及时更新CRL或未使用OCSP查询证书状态",
        "CA签发的用户证书在未保护的通道中进行分发"
      ],
      "answer": "ABC",
      "analysis": "可参考《商用密码应用与安全性评估》中1.5.3公钥基础设施（PKI）"
    },
    {
      "id": "4705",
      "title": "某信息系统客户端APP与服务端之间通过SSL VPN建立的安全传输通道，对网络和通信安全进行保护，通过抓取和分析通信数据包，使用的密码套件为 TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384，以下分析正确的是（）。",
      "option": [
        "该协议使用RSA密码算法的数字信封功能进行密钥协商",
        "该协议使用AES-256的GCM工作模式保护传输数据的机密性",
        "无法确定所使用RSA算法的密钥长度，还需要抓取传输中涉及的证书进行判断",
        "该协议使用AES-256的GCM工作模式保护传输数据的完整性"
      ],
      "answer": "BCD",
      "analysis": "GCM模式可同时机密性和完整性"
    },
    {
      "id": "4731",
      "title": "某二级信息系统于2019年进行规划并有密码应用方案且方案通过评估，2020年建设完成后投入运行，2021年开展首次密评，测评人员在测评时仅以该系统在投入运行前未进行密码应用安全性评估为由，对“建设运行”层面的“投入运行前进行密码应用安全性评估”指标判定为“不符合”。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "A",
      "analysis": "FAQ15.2以密码法实施时间为界限。2020年1月1日前投入运行的系统，首次密评时该项可判定“不适用”；2020年1月1日后投入运行的系统，首次密评时该项判定为“不符合”"
    },
    {
      "id": "4743",
      "title": "测评人员在对某三级信息系统的人员管理中的“建立密码应用岗位责任制度”测评时发现，该信息系统根据密码应用的实际情况，设置甲、乙、丙三人分别担任密钥管理员、密码安全审计员、密码操作员，并建立了岗位责任制度、确定了各自的岗位职责，设备与系统的管理和使用人员都有各自单独的账号。因此，该测评项可以给1分。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "对关键岗位没有建立多人共管机制"
    },
    {
      "id": "4752",
      "title": "根据《商用密码应用安全性评估报告模板（2023版）》，如果应用和数据安全层面的“重要数据存储完整性”指标未采用密码应用措施，那么针对该指标的安全控制措施评估结果一定是（）。",
      "option": [
        "通过",
        "未通过",
        "不符合",
        "无法判断"
      ],
      "answer": "D",
      "analysis": ""
    },
    {
      "id": "4756",
      "title": "根据《商用密码应用安全性评估报告模板（2023版）》，关于方案密评，以下说法正确的是（）。",
      "option": [
        "依据被测信息系统具体业务情况，审查被测信息系统的密码应用方案是否涵盖了所有需要采用密码保护的核心资产",
        "依据被测信息系统具体业务情况，审查被测信息系统的密码应用方案是否涵盖了所有需要采用密码保护的敏感信息",
        "依据被测信息系统具体业务情况，审查被测信息系统的密码应用方案采取的密码保护措施是否均能够达到相应等级的密码使用要求或规定",
        "方案密评可由信息系统责任单位委托密评机构或自行开展密评"
      ],
      "answer": "ABCD",
      "analysis": ""
    },
    {
      "id": "4763",
      "title": "根据《商用密码应用安全性评估报告模板（2023版）》，方案密评报告中应用和数据安全层面的保护对象应重点梳理（）。",
      "option": [
        "各个应用具有身份鉴别需求的应用用户",
        "各个应用具有可用性需求的重要数据",
        "各个应用的重要数据及对应具体安全需求",
        "各个应用具有不可否认性需求的操作行为"
      ],
      "answer": "ACD",
      "analysis": ""
    },
    {
      "id": "4768",
      "title": "根据《商用密码应用安全性评估报告模板（2023版）》，系统各安全层面需要梳理的保护对象不包括（）。",
      "option": [
        "网络和通信安全层面的通信信道",
        "不同应用用户",
        "重要数据",
        "通用交换机"
      ],
      "answer": "D",
      "analysis": "仅网络设备、常规安全设备（除堡垒机）不需作为测评对象或保护对象\n个人认为不应该是多项选择"
    },
    {
      "id": "4799",
      "title": "根据《商用密码应用安全性评估报告模板（2023版）》，如果指标所涉及的某一保护对象的相应安全控制措施有效（不存在高风险），则该指标的安全控制措施评估结果为“通过”。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": ""
    },
    {
      "id": "4804",
      "title": "根据《商用密码应用安全性评估报告模板（2023版）》，在密码应用方案密评报告中，所有指标的安全控制措施评估结果均通过，则可判定方案评估结论为“通过”。",
      "option": [
        "正确",
        "错误"
      ],
      "answer": "B",
      "analysis": "若所有指标的安全控制措施评估结果均为通过，且初步量化评估分数能够达到阈值要求，则方案评估结论为通过；否则为不通过。"
    }
  ]

};

module.exports = questions;  // 导出 questions 对象